{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-response-to-the-pope", "text": "", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-is-pro-life", "text": "Despite Senator Ted Cruz attempting to smear me and totally lie about my beliefs and positions on almost all of the issues, I am a conservative person and I believe in conservative values. Like Ronald Reagan, on many issues, I have evolved. I am pro-life and have been for a long time. https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-response-to-the-pope", "text": "\nIf and when the Vatican is attacked by ISIS, which as everyone knows is ISIS’s ultimate trophy, I can promise you that the Pope would have only wished and prayed that Donald Trump would have been President because this would not have happened. ISIS would have been eradicated unlike what is happening now with our all talk, no action politicians.\n\n\nThe Mexican government and its leadership has made many disparaging remarks about me to the Pope, because they want to continue to rip off the United States, both on trade and at the border, and they understand I am totally wise to them. The Pope only heard one side of the story - he didn’t see the crime, the drug trafficking and the negative economic impact the current policies have on the United States. He doesn’t see how Mexican leadership is outsmarting President Obama and our leadership in every aspect of negotiation.\n\n\nFor a religious leader to question a person’s faith is disgraceful. I am proud to be a Christian and as President I will not allow Christianity to be consistently attacked and weakened, unlike what is happening now, with our current President. No leader, especially a religious leader, should have the right to question another man’s religion or faith. They are using the Pope as a pawn and they should be ashamed of themselves for doing so, especially when so many lives are involved and when illegal immigration is so rampant.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-is-pro-life", "text": "Despite Senator Ted Cruz attempting to smear me and totally lie about my beliefs and positions on almost all of the issues, I am a conservative person and I believe in conservative values. Like Ronald Reagan, on many issues, I have evolved. I am pro-life and have been for a long time. https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "text": "Let me be clear—I am pro-life. I support that position with exceptions allowed for rape, incest or the life of the mother being at risk. I did not always hold this position, but I had a significant personal experience that brought the precious gift of life into perspective for me. My story is well documented, so I will not retell it here. However, what I will do with the remaining space is express my feelings about life, and the culture of life, as we approach the 43nd anniversary of the Roe v. Wade.I build things. There is a process involved in building things. We tap into a lot of disciplines with engineering being one of the most important. The rules for putting structures together are as strict as are the rules of physics. These rules have stood the test of time and have become the path to putting together structures that endure and are beautiful. America, when it is at its best, follows a set of rules that have worked since our founding. One of those rules is that we, as Americans, revere life and have done so since our Founders made it the first, and most important, of our “unalienable” rights.Over time, our culture of life in this country has started sliding toward a culture of death. Perhaps the most significant piece of evidence to support this assertion is that since Roe v. Wade was decided by the Supreme Count 43 years ago over 50 million Americans never had the chance to enjoy the opportunities offered by this country. They never had the chance to become doctors, musicians, farmers, teachers, husbands, fathers, sons or daughters. They never had the chance to enrich the culture of this nation or to bring their skills, lives, loves or passions into the fabric of country. They are missing, and they are missed.The Supreme Court in 1973 based their decision on imagining rights and liberties in the Constitution that are nowhere to be found. Even if we take the court at its word, that abortion is a matter of privacy, we should then extend the argument to the logical conclusion that private funds, then, should subsidize this choice rather than the half billion dollars given to abortion providers every year by Congress. Public funding of abortion providers is an insult to people of conscience at the least and an affront to good governance at best.If using taxpayer money to facilitate our slide to a culture of death was not enough, the 1973 decision became a landmark decision demonstrating the utter contempt the court had for federalism and the 10th Amendment. Roe v. Wade gave the court an excuse to dismantle the decisions of state legislatures and the votes of the people. This is a pattern that the court has repeated over and over again since that decision. Perhaps Roe v. Wade became yet another incidence of disconnect between the people and their government.We are in the middle of a presidential political cycle and votes will be cast in just days. The citizens of this nation will have the chance to vote for candidates that are aligned with their individual worldviews. It is my hope that they will choose the builder, the man who has the ability to imagine the greatness of this nation. The next President must follow those principles that work best and that reinforce the reverence Americans hold for life. A culture of life is too important to let slip away for convenience or political correctness. It is by preserving our culture of life that we will Make America Great Again. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-responds-to-senator-cruz-lies-and-warns-of-legal-action", "text": "\nTed Cruz is a totally unstable individual. He is the single biggest liar I’ve ever come across, in politics or otherwise, and I have seen some of the best of them. His statements are totally untrue and completely outrageous. It is hard to believe a person who proclaims to be a Christian could be so dishonest and lie so much.\n\n\nCruz said I would be appointing a liberal judge when in fact I will appoint a great conservative and I am the only candidate who has gone so far, at the debate, as to suggest two individuals I feel would best represent the conservative values we need to protect: William “Bill” Pryor Jr. and Diane Sykes.\n\n\nCruz says I am pro-choice, when in fact I am staunchly pro-life and have been for a long time. Like Ronald Reagan, on many issues, I have evolved.\n\n\nCruz says I am in favor of ObamaCare, when in fact I have spoken about repealing and replacing this disaster of a system at every speech throughout my campaign and since it’s inception. Meanwhile, Cruz was responsible for getting Bush to put in the judge that failed to vote against ObamaCare twice.\n\n\nCruz says I will try to take away your second amendment rights, when I am one of the strongest proponents of the right to bear arms and I say so in every speech that I have made for years. I am a proud member of the NRA and so are my sons.\n\n\nCruz has become unhinged and is lying with the hopes that his statements will go unchecked until after the election and he will save his failing campaign.\n\n\nIn Iowa, Cruz told thousands of Ben Carson voters that Dr. Carson had left the race and to instead vote for Ted Cruz. He apologized when the race was over. Likewise, his fraudulent voter violation form sent to Iowa voters. If Ted is going to continue to lie with such desperation, I have no choice but to fight back.\n\n\nOne of the ways I can fight back is to bring a lawsuit against him relative to the fact that he was born in Canada and therefore cannot be President. If he doesn’t take down his false ads and retract his lies, I will do so immediately. Additionally, the RNC should intervene and if they don’t they are in default of their pledge to me.\n\n\nI am the strongest on the borders and I will build a wall, and it will be a real wall. I am strongest on illegal immigration, strongest on ISIS, strongest on the military and I will take care of our Vets. I will end common core and preserve the second amendment. I will renegotiate our trade deals and bring our jobs back to our country. I am the only person who will Make America Great Again. \n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-justice-scalia", "text": "I would like to offer my sincerest condolences to the Scalia family after the passing of Justice Scalia. Justice Scalia was a remarkable person and a brilliant Supreme Court Justice, one of the best of all time. His career was defined by his reverence for the Constitution and his legacy of protecting Americans’ most cherished freedoms. He was a Justice who did not believe in legislating from the bench and he is a person whom I held in the highest regard and will always greatly respect his intelligence and conviction to uphold the Constitution of our country. My thoughts and prayers are with his family during this time. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-unauthorized-rnc-fundraising-notice", "text": "The RNC, which is probably not on my side, just illegally put out a fundraising notice saying ‘Trump wants you to contribute to the RNC.' The RNC does not treat me well and then they use my name, without my knowledge, to raise money for themselves. At my insistence, they have withdrawn their request. I am self-funding my campaign and this totally unauthorized notice is yet another example of deceptive Washington tricks used to take advantage of the voters and get money from the hard-working people the politicians have failed. I will not stand for it and neither should you.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-begins-airing-new-ad-in-south-carolina-focused-on-illegal-i", "text": "\n(New York, NY) February 12th, 2016 – Today Donald J. Trump began airing a new ad in South Carolina focused on illegal immigration featuring Jamiel Shaw, whose son was brutally murdered by an illegal immigrant. \n\n\nMr. Trump says, “People wouldn’t be talking about illegal immigration had I not brought it up when I announced I was running for President. It is a massive problem in our country and now everybody agrees with me --- bad for crime and the economy. A wonderful young man, Jamiel Shaw Jr., whose father has become a friend of mine, was shot in the face for no reason by an illegal immigrant. He was getting ready to go to college on a football scholarship and his sole fault was walking home to see his father. Because of the relationship I have established with his father, Jamiel’s death is very personal to me. We must stop illegal immigration.”\n\n\nJamiel Shaw added, “Donald Trump is the only person fighting to put American families first. He will protect our children and put an end to these senseless acts of violence that are caused by our failed policies and broken immigration system. Donald Trump has made it clear he, like most Americans, wants to return the rule of law to the people of this country. Without strong borders we don’t have a country. Strong border enforcement is the first step to preventing future tragedies. We must secure our borders and return those who came here illegally to their native lands. Donald Trump is a man who stands for what is right. He stands for America and I stand with him.”\n\n\nThe ad is currently airing in South Carolina leading up to the February 20th primary contest. Mr. Trump maintains a substantial, double digit lead in all state polls and will spend the week prior to the primary campaigning around the state.\n\n\nYou can view the ad here: \nhttp://www.donaldjtrump.com/media/jamiel-tv-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-three-influential-florida-endorsements", "text": "\nTop National Security Experts and National Gold Star Mother Endorse Trump at Tampa Rally\n\n\n(New York, NY) February 12th, 2016 – Today Donald J. Trump was endorsed by former USAF Colonel and retired senior intelligence and political-military affairs officer, Jim Waurishuk, highly decorated, retired Senior CIA Operations Officer Gary Bernsten, and National Gold Star Mother, Susan Price.\n\n\nMr. Trump says, “I am proud to be endorsed by such accomplished and well-respected military experts. Additionally, to be endorsed by a Gold Star mother is such a wonderful honor. Homeland security and strengthening our military are two of the most important issues and cornerstones of my campaign. Jim and Gary’s support is so important to me and Susan is an incredible person and with their help we will win Florida and Make America Great Again!”\n\n\nWaurishuk is extremely well respected in the security community and an expert on national security with specific expertise in strategic engagement and policy, and unconventional and asymmetric warfare. He has served as Deputy Director for Intelligence for U.S. Central Command (USCENTCOM) during the peak years (2004-07) of the wars in Afghanistan, Iraq, and the War on Terrorism. He is a former White House National Security Council staffer and former Distinguished Senior Fellow at the Atlantic Council, Washington, DC.\n\n\nAdditionally, Colonel Waurishuk served combat and combat-support tours in Grenada, Panama, Bosnia, Lebanon, Afghanistan, and Iraq, as well as on numerous special operations and intelligence contingency missions and operations Colonel Waurishuk is an in-resident graduate of both DIA’s and CIA’s National Senior Intelligence Officer programs, the USAF and the Armed Forces Command and Staff Colleges, a War College Senior Fellow, and the Office of the Secretary of Defense Executive Leadership Development Program.\n\n\nGary Berntsen is a highly decorated, retired Senior CIA Operations Officer and Chief of Station. He is the bestselling author of \nJawbreaker, The Attack on Bin Laden and Al Qaeda,where he chronicles his leading role in the response to the September 11th attacks. In that role Berntsen led CIA Paramilitary Operations in Eastern Afghanistan on the Shomali Plains, Talaqan and Tora Bora where 135 CIA Officers and 350 Special Forces personnel led indigenous forces to defeat 70,000 Taliban and 5,000 Al Qaeda fighters. Mr. Berntsen is the recipient of the CIA’s Distinguished Intelligence Medal and Intelligence Star. Mr. Berntsen is the author of several other books and is a frequent guest commentator on National Security and Counter terrorism on Fox News, CNN, Newsmax and other media outlets.\n\n\nSusan Price, resident of Hillsborough County, is a National Gold Star Mother. She is an Army Veteran and the daughter of a Marine. She is also the mother of a fallen Marine hero, Gunnery Sgt. Aaron M. Kenefick, USMC. Aaron was killed in action on September 8, 2009, in Kunar Province, Afghanistan. Susan is a Veterans advocate and a national voice. She has appeared on 60 Minutes, and other national media, in television, newspaper, and radio. Susan has dedicated herself in the name of her son to protect America’s legacy.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-announces-dan-scavino-as-director-of-soc", "text": "\n(New York, NY) February 11th, 2016 – Today Donald J. Trump for President Inc. announced campaign staffer and longtime Trump confidant has been named Director of Social Media for the Trump Campaign. Scavino joined the campaign last spring and has since managed the campaign’s social media efforts working directly with Mr. Trump to strategize and execute all social content.\n\n\nTrump Campaign Manager, Corey Lewandowski said, “We are pleased to announce Dan’s promotion. He is a real asset that provides tremendous value as Mr. Trump continues to change the political landscape with his unprecedented influence on social media channels, among other tactics.”\n\n\nMr. Trump continues to dominate social media channels with over 13,000,000 followers, a larger audience than all the other candidates combined. His current social media followings include Twitter 6,125,000, Facebook 5,675,000, and Instagram 970,000. You can follow Mr. Trump and the campaign’s activities via @RealDonaldTrump.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-endorsements-from-dozens-of-georgia-officials", "text": "\n(New York, NY) February 11th, 2016 - Today Donald J. Trump for President Inc. announced the endorsements of dozens of Georgia officials including that of his first statewide elected official, Public Service Commission Chairman Lauren “Bubba” McDonald, Jr.\n\n\nMr. Trump stated, “It is my great honor to receive these coveted and influential endorsements from tremendous people in the state of Georgia. I have visited many times and had great crowds and poll numbers. I look forward to being in Georgia again soon and working with each of these local leaders to Make America Great Again.”\n\n\nMcDonald served 20 years as a State Representative in the Georgia Legislature and also served as a commissioner in Jackson County, served on the Board of Managers of the Association of County Commissioners of Georgia, and volunteered as a Firefighter for the city of Commerce for 35 years. He joins the campaign as a Statewide Co-Chair.\n\n\nMcDonald said, “Mr. Trump is a proven leader with unparalleled success. He has the capabilities to make our country stronger and better than ever before. I am proud to endorse his candidacy for President of the United States along with many other community leaders here in Georgia.”\n\n\nFormer State Representative Mitchell Kaye will lead the local elected officials coalition. Mitchell Kaye served east Cobb county for five terms in the Georgia House of Representatives, rising to deputy GOP Whip and ranking member of the tax-writing and cutting House Ways and Means committee. Kaye was awarded \"Legislator of the Year\" by the Georgia Association of Taxpayers for his tax cutting successes and by Phyllis Schlafly's Eagle Forum for his educational efforts.\n\n\nThe Georgia officials endorsing Donald J. Trump for President join State Senators Burt Jones and Michael Williams. Mr. Trump continues to lead in all national and state polls after winning the New Hampshire Primary by a landslide. He will campaign in South Carolina and other SEC states prior to the first in the south primary on February 20th.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-bill-stern-in-south-carolina", "text": "\n(New York, NY) February 10th, 2016 - Bill Stern of Columbia, S.C. has endorsed Donald Trump and has been announced Chairman of the Southeast Business Coalition on the Trump for President campaign.\n\n\nOne of the South’s most respected business leaders, Bill Stern is President and CEO of Stern & Stern, a commercial real estate development company that owns and manages real estate throughout the United States.\n\n\nMr. Trump said,”I am delighted Bill Stern has accepted a leadership role in my campaign. He is a successful real estate developer and for eight years he served as Chair of the South Carolina Ports Authority, which is one of the most important commercial ports in the world. I look forward to working closely with Bill --- with his support we will Make American Great Again.”\n\n\nMr. Stern stated, ”Throughout American history, we've had great Presidents who were lawyers, politicians and military leaders. I believe the complex global challenges of our time call for a President with a background in business, a record of success in creating jobs and the strong leadership skills it will take to Make America Great Again. That's why I'm supporting Donald Trump. He's a world class business leader who I believe will make a world class President of the United States.\"\n\n\nStern has served as Chair of the South Carolina Ports Authority for eight years and has recently been named the first Chairman Emeritus in the port's history. During his period of leadership, South Carolina's port was ranked as the fastest growing in the nation and now ranks number one in container volume growth.\n\n\nBill Stern has also served in leadership roles in political campaigns at the national, state and local levels. He served on the George W. Bush for President State Finance Committee, and he was State Finance Chair of the John McCain for President campaign. Other leadership roles include: State Finance Chair, Lindsey Graham for U.S. Senate, Co-Chair, Lindsey Graham for President; and State Finance Chair for Henry McMaster for Lt. Governor, Alan Wilson for Attorney General, and many other state and local political campaigns.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-new-radio-ad-featuring-south-carolina-lieutenant-go", "text": "\n(New York, NY) February 5th, 2015 -  Today Donald J. Trump debuted a new radio ad featuring South Carolina Lieutenant Governor Henry McMaster. The ad will begin airing today in South Carolina. Last week Mr. Trump received McMaster’s endorsement. The Lt. Gov. previously served as South Carolina Attorney General, South Carolina Republican Party Chairman, and was the first United States Attorney appointed by President Ronald Reagan.\n\n\nThe new ad focuses on key issues of Mr. Trump’s campaign including homeland security, job creation and Mr. Trump’s leadership and strength.\n\n\nLt. Gov. McMaster joined Mr. Trump at his rally in Lexington County, South Carolina last week, where there were thousands in attendance, to voice his support.\n\n\nHe said, “I am delighted to support Donald Trump.  He is a man of accomplishment and speaks the truth in words everyone can understand, instills confidence in the people about our country’s bright future, and reflects and believes in the strength and determination necessary for success.  These qualities - and his quiet compassion for those in need - are essential to making America Great Again.  Now is the time for Donald Trump.”\n\n\nMr. Trump will be in Florence this evening for a rally with a record crowd expected to attend. The Trump Campaign continues to dominate in South Carolina with all recent polls showing Mr. Trump with substantial, double digit leads in all state polls and great momentum as the February 20th primary contest approaches.\n\n\nYou can listen to the ad here: http://www.donaldjtrump.com/media/mcmaster-radio-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-endorsement-from-former-santorum-senior-adviser", "text": "\n(New York, NY) February 4th, 2016 - Today Donald J. Trump for President Inc. announced the endorsement of respected Alderman Nick Pappas of Manchester, New Hampshire.\n\n\nPappas served as the New Hampshire based senior adviser to Senator Rick Santorum and recently served as New Hampshire State Director for Generation Opportunity, a national conservative advocacy group with a focus on millennials.\n\n\nMr. Trump will be campaigning in New Hampshire today with five events around the state. He will return for the eighth Republican Presidential Debate on Saturday and stay through the primary on Tuesday.\n\n\nMr. Trump continues to lead in all national and state polls, with a significant lead in New Hampshire where he has 38% support, a massive 26-point lead over his nearest rival. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-latest-campaign-ad-to-begin-airing-in-new-hampshire", "text": "\n(New York, NY) February 3rd, 2016 – Today Donald J. Trump unveiled the latest campaign add to begin airing in New Hampshire. The ad will appear on TV starting Wednesday and is part of an $850,000 spend the campaign made last week. The ad is a compilation of footage from Trump events showcasing massive crowds, energy, passion and supporters reinforcing Mr. Trump’s message to take back the country. \n\n\nMr. Trump stated, “This is a movement. People believe in my vision to make our country better and stronger than ever before and I am so honored to have their support. I am going to make you so proud--- we will take our country back and Make America Great Again!”\n\n\nMr. Trump continues to dominate all national and local polls including maintaining a massive twenty-six point lead in New Hampshire, where he will compete in the first in the nation primary contest on Tuesday, February 9th.\n\n\nMr. Trump is self-funding his campaign and has spent millions on advertising in the first three early states. He also maintains his frontrunner status in South Carolina and all national surveys.\n\n\nYou can view the ad here: \nhttp://www.donaldjtrump.com/media/voters-speak-tv-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-response-to-the-pope", "text": "\nIf and when the Vatican is attacked by ISIS, which as everyone knows is ISIS’s ultimate trophy, I can promise you that the Pope would have only wished and prayed that Donald Trump would have been President because this would not have happened. ISIS would have been eradicated unlike what is happening now with our all talk, no action politicians.\n\n\nThe Mexican government and its leadership has made many disparaging remarks about me to the Pope, because they want to continue to rip off the United States, both on trade and at the border, and they understand I am totally wise to them. The Pope only heard one side of the story - he didn’t see the crime, the drug trafficking and the negative economic impact the current policies have on the United States. He doesn’t see how Mexican leadership is outsmarting President Obama and our leadership in every aspect of negotiation.\n\n\nFor a religious leader to question a person’s faith is disgraceful. I am proud to be a Christian and as President I will not allow Christianity to be consistently attacked and weakened, unlike what is happening now, with our current President. No leader, especially a religious leader, should have the right to question another man’s religion or faith. They are using the Pope as a pawn and they should be ashamed of themselves for doing so, especially when so many lives are involved and when illegal immigration is so rampant.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-is-pro-life", "text": "Despite Senator Ted Cruz attempting to smear me and totally lie about my beliefs and positions on almost all of the issues, I am a conservative person and I believe in conservative values. Like Ronald Reagan, on many issues, I have evolved. I am pro-life and have been for a long time. https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-response-to-the-pope", "text": "\nIf and when the Vatican is attacked by ISIS, which as everyone knows is ISIS’s ultimate trophy, I can promise you that the Pope would have only wished and prayed that Donald Trump would have been President because this would not have happened. ISIS would have been eradicated unlike what is happening now with our all talk, no action politicians.\n\n\nThe Mexican government and its leadership has made many disparaging remarks about me to the Pope, because they want to continue to rip off the United States, both on trade and at the border, and they understand I am totally wise to them. The Pope only heard one side of the story - he didn’t see the crime, the drug trafficking and the negative economic impact the current policies have on the United States. He doesn’t see how Mexican leadership is outsmarting President Obama and our leadership in every aspect of negotiation.\n\n\nFor a religious leader to question a person’s faith is disgraceful. I am proud to be a Christian and as President I will not allow Christianity to be consistently attacked and weakened, unlike what is happening now, with our current President. No leader, especially a religious leader, should have the right to question another man’s religion or faith. They are using the Pope as a pawn and they should be ashamed of themselves for doing so, especially when so many lives are involved and when illegal immigration is so rampant.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-is-pro-life", "text": "Despite Senator Ted Cruz attempting to smear me and totally lie about my beliefs and positions on almost all of the issues, I am a conservative person and I believe in conservative values. Like Ronald Reagan, on many issues, I have evolved. I am pro-life and have been for a long time. https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-response-to-the-pope", "text": "\nIf and when the Vatican is attacked by ISIS, which as everyone knows is ISIS’s ultimate trophy, I can promise you that the Pope would have only wished and prayed that Donald Trump would have been President because this would not have happened. ISIS would have been eradicated unlike what is happening now with our all talk, no action politicians.\n\n\nThe Mexican government and its leadership has made many disparaging remarks about me to the Pope, because they want to continue to rip off the United States, both on trade and at the border, and they understand I am totally wise to them. The Pope only heard one side of the story - he didn’t see the crime, the drug trafficking and the negative economic impact the current policies have on the United States. He doesn’t see how Mexican leadership is outsmarting President Obama and our leadership in every aspect of negotiation.\n\n\nFor a religious leader to question a person’s faith is disgraceful. I am proud to be a Christian and as President I will not allow Christianity to be consistently attacked and weakened, unlike what is happening now, with our current President. No leader, especially a religious leader, should have the right to question another man’s religion or faith. They are using the Pope as a pawn and they should be ashamed of themselves for doing so, especially when so many lives are involved and when illegal immigration is so rampant.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-is-pro-life", "text": "Despite Senator Ted Cruz attempting to smear me and totally lie about my beliefs and positions on almost all of the issues, I am a conservative person and I believe in conservative values. Like Ronald Reagan, on many issues, I have evolved. I am pro-life and have been for a long time. https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-response-to-the-pope", "text": "\nIf and when the Vatican is attacked by ISIS, which as everyone knows is ISIS’s ultimate trophy, I can promise you that the Pope would have only wished and prayed that Donald Trump would have been President because this would not have happened. ISIS would have been eradicated unlike what is happening now with our all talk, no action politicians.\n\n\nThe Mexican government and its leadership has made many disparaging remarks about me to the Pope, because they want to continue to rip off the United States, both on trade and at the border, and they understand I am totally wise to them. The Pope only heard one side of the story - he didn’t see the crime, the drug trafficking and the negative economic impact the current policies have on the United States. He doesn’t see how Mexican leadership is outsmarting President Obama and our leadership in every aspect of negotiation.\n\n\nFor a religious leader to question a person’s faith is disgraceful. I am proud to be a Christian and as President I will not allow Christianity to be consistently attacked and weakened, unlike what is happening now, with our current President. No leader, especially a religious leader, should have the right to question another man’s religion or faith. They are using the Pope as a pawn and they should be ashamed of themselves for doing so, especially when so many lives are involved and when illegal immigration is so rampant.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-is-pro-life", "text": "Despite Senator Ted Cruz attempting to smear me and totally lie about my beliefs and positions on almost all of the issues, I am a conservative person and I believe in conservative values. Like Ronald Reagan, on many issues, I have evolved. I am pro-life and have been for a long time. https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "text": "Let me be clear—I am pro-life. I support that position with exceptions allowed for rape, incest or the life of the mother being at risk. I did not always hold this position, but I had a significant personal experience that brought the precious gift of life into perspective for me. My story is well documented, so I will not retell it here. However, what I will do with the remaining space is express my feelings about life, and the culture of life, as we approach the 43nd anniversary of the Roe v. Wade.I build things. There is a process involved in building things. We tap into a lot of disciplines with engineering being one of the most important. The rules for putting structures together are as strict as are the rules of physics. These rules have stood the test of time and have become the path to putting together structures that endure and are beautiful. America, when it is at its best, follows a set of rules that have worked since our founding. One of those rules is that we, as Americans, revere life and have done so since our Founders made it the first, and most important, of our “unalienable” rights.Over time, our culture of life in this country has started sliding toward a culture of death. Perhaps the most significant piece of evidence to support this assertion is that since Roe v. Wade was decided by the Supreme Count 43 years ago over 50 million Americans never had the chance to enjoy the opportunities offered by this country. They never had the chance to become doctors, musicians, farmers, teachers, husbands, fathers, sons or daughters. They never had the chance to enrich the culture of this nation or to bring their skills, lives, loves or passions into the fabric of country. They are missing, and they are missed.The Supreme Court in 1973 based their decision on imagining rights and liberties in the Constitution that are nowhere to be found. Even if we take the court at its word, that abortion is a matter of privacy, we should then extend the argument to the logical conclusion that private funds, then, should subsidize this choice rather than the half billion dollars given to abortion providers every year by Congress. Public funding of abortion providers is an insult to people of conscience at the least and an affront to good governance at best.If using taxpayer money to facilitate our slide to a culture of death was not enough, the 1973 decision became a landmark decision demonstrating the utter contempt the court had for federalism and the 10th Amendment. Roe v. Wade gave the court an excuse to dismantle the decisions of state legislatures and the votes of the people. This is a pattern that the court has repeated over and over again since that decision. Perhaps Roe v. Wade became yet another incidence of disconnect between the people and their government.We are in the middle of a presidential political cycle and votes will be cast in just days. The citizens of this nation will have the chance to vote for candidates that are aligned with their individual worldviews. It is my hope that they will choose the builder, the man who has the ability to imagine the greatness of this nation. The next President must follow those principles that work best and that reinforce the reverence Americans hold for life. A culture of life is too important to let slip away for convenience or political correctness. It is by preserving our culture of life that we will Make America Great Again. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-responds-to-senator-cruz-lies-and-warns-of-legal-action", "text": "\nTed Cruz is a totally unstable individual. He is the single biggest liar I’ve ever come across, in politics or otherwise, and I have seen some of the best of them. His statements are totally untrue and completely outrageous. It is hard to believe a person who proclaims to be a Christian could be so dishonest and lie so much.\n\n\nCruz said I would be appointing a liberal judge when in fact I will appoint a great conservative and I am the only candidate who has gone so far, at the debate, as to suggest two individuals I feel would best represent the conservative values we need to protect: William “Bill” Pryor Jr. and Diane Sykes.\n\n\nCruz says I am pro-choice, when in fact I am staunchly pro-life and have been for a long time. Like Ronald Reagan, on many issues, I have evolved.\n\n\nCruz says I am in favor of ObamaCare, when in fact I have spoken about repealing and replacing this disaster of a system at every speech throughout my campaign and since it’s inception. Meanwhile, Cruz was responsible for getting Bush to put in the judge that failed to vote against ObamaCare twice.\n\n\nCruz says I will try to take away your second amendment rights, when I am one of the strongest proponents of the right to bear arms and I say so in every speech that I have made for years. I am a proud member of the NRA and so are my sons.\n\n\nCruz has become unhinged and is lying with the hopes that his statements will go unchecked until after the election and he will save his failing campaign.\n\n\nIn Iowa, Cruz told thousands of Ben Carson voters that Dr. Carson had left the race and to instead vote for Ted Cruz. He apologized when the race was over. Likewise, his fraudulent voter violation form sent to Iowa voters. If Ted is going to continue to lie with such desperation, I have no choice but to fight back.\n\n\nOne of the ways I can fight back is to bring a lawsuit against him relative to the fact that he was born in Canada and therefore cannot be President. If he doesn’t take down his false ads and retract his lies, I will do so immediately. Additionally, the RNC should intervene and if they don’t they are in default of their pledge to me.\n\n\nI am the strongest on the borders and I will build a wall, and it will be a real wall. I am strongest on illegal immigration, strongest on ISIS, strongest on the military and I will take care of our Vets. I will end common core and preserve the second amendment. I will renegotiate our trade deals and bring our jobs back to our country. I am the only person who will Make America Great Again. \n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-justice-scalia", "text": "I would like to offer my sincerest condolences to the Scalia family after the passing of Justice Scalia. Justice Scalia was a remarkable person and a brilliant Supreme Court Justice, one of the best of all time. His career was defined by his reverence for the Constitution and his legacy of protecting Americans’ most cherished freedoms. He was a Justice who did not believe in legislating from the bench and he is a person whom I held in the highest regard and will always greatly respect his intelligence and conviction to uphold the Constitution of our country. My thoughts and prayers are with his family during this time. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-unauthorized-rnc-fundraising-notice", "text": "The RNC, which is probably not on my side, just illegally put out a fundraising notice saying ‘Trump wants you to contribute to the RNC.' The RNC does not treat me well and then they use my name, without my knowledge, to raise money for themselves. At my insistence, they have withdrawn their request. I am self-funding my campaign and this totally unauthorized notice is yet another example of deceptive Washington tricks used to take advantage of the voters and get money from the hard-working people the politicians have failed. I will not stand for it and neither should you.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-begins-airing-new-ad-in-south-carolina-focused-on-illegal-i", "text": "\n(New York, NY) February 12th, 2016 – Today Donald J. Trump began airing a new ad in South Carolina focused on illegal immigration featuring Jamiel Shaw, whose son was brutally murdered by an illegal immigrant. \n\n\nMr. Trump says, “People wouldn’t be talking about illegal immigration had I not brought it up when I announced I was running for President. It is a massive problem in our country and now everybody agrees with me --- bad for crime and the economy. A wonderful young man, Jamiel Shaw Jr., whose father has become a friend of mine, was shot in the face for no reason by an illegal immigrant. He was getting ready to go to college on a football scholarship and his sole fault was walking home to see his father. Because of the relationship I have established with his father, Jamiel’s death is very personal to me. We must stop illegal immigration.”\n\n\nJamiel Shaw added, “Donald Trump is the only person fighting to put American families first. He will protect our children and put an end to these senseless acts of violence that are caused by our failed policies and broken immigration system. Donald Trump has made it clear he, like most Americans, wants to return the rule of law to the people of this country. Without strong borders we don’t have a country. Strong border enforcement is the first step to preventing future tragedies. We must secure our borders and return those who came here illegally to their native lands. Donald Trump is a man who stands for what is right. He stands for America and I stand with him.”\n\n\nThe ad is currently airing in South Carolina leading up to the February 20th primary contest. Mr. Trump maintains a substantial, double digit lead in all state polls and will spend the week prior to the primary campaigning around the state.\n\n\nYou can view the ad here: \nhttp://www.donaldjtrump.com/media/jamiel-tv-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-three-influential-florida-endorsements", "text": "\nTop National Security Experts and National Gold Star Mother Endorse Trump at Tampa Rally\n\n\n(New York, NY) February 12th, 2016 – Today Donald J. Trump was endorsed by former USAF Colonel and retired senior intelligence and political-military affairs officer, Jim Waurishuk, highly decorated, retired Senior CIA Operations Officer Gary Bernsten, and National Gold Star Mother, Susan Price.\n\n\nMr. Trump says, “I am proud to be endorsed by such accomplished and well-respected military experts. Additionally, to be endorsed by a Gold Star mother is such a wonderful honor. Homeland security and strengthening our military are two of the most important issues and cornerstones of my campaign. Jim and Gary’s support is so important to me and Susan is an incredible person and with their help we will win Florida and Make America Great Again!”\n\n\nWaurishuk is extremely well respected in the security community and an expert on national security with specific expertise in strategic engagement and policy, and unconventional and asymmetric warfare. He has served as Deputy Director for Intelligence for U.S. Central Command (USCENTCOM) during the peak years (2004-07) of the wars in Afghanistan, Iraq, and the War on Terrorism. He is a former White House National Security Council staffer and former Distinguished Senior Fellow at the Atlantic Council, Washington, DC.\n\n\nAdditionally, Colonel Waurishuk served combat and combat-support tours in Grenada, Panama, Bosnia, Lebanon, Afghanistan, and Iraq, as well as on numerous special operations and intelligence contingency missions and operations Colonel Waurishuk is an in-resident graduate of both DIA’s and CIA’s National Senior Intelligence Officer programs, the USAF and the Armed Forces Command and Staff Colleges, a War College Senior Fellow, and the Office of the Secretary of Defense Executive Leadership Development Program.\n\n\nGary Berntsen is a highly decorated, retired Senior CIA Operations Officer and Chief of Station. He is the bestselling author of \nJawbreaker, The Attack on Bin Laden and Al Qaeda,where he chronicles his leading role in the response to the September 11th attacks. In that role Berntsen led CIA Paramilitary Operations in Eastern Afghanistan on the Shomali Plains, Talaqan and Tora Bora where 135 CIA Officers and 350 Special Forces personnel led indigenous forces to defeat 70,000 Taliban and 5,000 Al Qaeda fighters. Mr. Berntsen is the recipient of the CIA’s Distinguished Intelligence Medal and Intelligence Star. Mr. Berntsen is the author of several other books and is a frequent guest commentator on National Security and Counter terrorism on Fox News, CNN, Newsmax and other media outlets.\n\n\nSusan Price, resident of Hillsborough County, is a National Gold Star Mother. She is an Army Veteran and the daughter of a Marine. She is also the mother of a fallen Marine hero, Gunnery Sgt. Aaron M. Kenefick, USMC. Aaron was killed in action on September 8, 2009, in Kunar Province, Afghanistan. Susan is a Veterans advocate and a national voice. She has appeared on 60 Minutes, and other national media, in television, newspaper, and radio. Susan has dedicated herself in the name of her son to protect America’s legacy.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-announces-dan-scavino-as-director-of-soc", "text": "\n(New York, NY) February 11th, 2016 – Today Donald J. Trump for President Inc. announced campaign staffer and longtime Trump confidant has been named Director of Social Media for the Trump Campaign. Scavino joined the campaign last spring and has since managed the campaign’s social media efforts working directly with Mr. Trump to strategize and execute all social content.\n\n\nTrump Campaign Manager, Corey Lewandowski said, “We are pleased to announce Dan’s promotion. He is a real asset that provides tremendous value as Mr. Trump continues to change the political landscape with his unprecedented influence on social media channels, among other tactics.”\n\n\nMr. Trump continues to dominate social media channels with over 13,000,000 followers, a larger audience than all the other candidates combined. His current social media followings include Twitter 6,125,000, Facebook 5,675,000, and Instagram 970,000. You can follow Mr. Trump and the campaign’s activities via @RealDonaldTrump.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-endorsements-from-dozens-of-georgia-officials", "text": "\n(New York, NY) February 11th, 2016 - Today Donald J. Trump for President Inc. announced the endorsements of dozens of Georgia officials including that of his first statewide elected official, Public Service Commission Chairman Lauren “Bubba” McDonald, Jr.\n\n\nMr. Trump stated, “It is my great honor to receive these coveted and influential endorsements from tremendous people in the state of Georgia. I have visited many times and had great crowds and poll numbers. I look forward to being in Georgia again soon and working with each of these local leaders to Make America Great Again.”\n\n\nMcDonald served 20 years as a State Representative in the Georgia Legislature and also served as a commissioner in Jackson County, served on the Board of Managers of the Association of County Commissioners of Georgia, and volunteered as a Firefighter for the city of Commerce for 35 years. He joins the campaign as a Statewide Co-Chair.\n\n\nMcDonald said, “Mr. Trump is a proven leader with unparalleled success. He has the capabilities to make our country stronger and better than ever before. I am proud to endorse his candidacy for President of the United States along with many other community leaders here in Georgia.”\n\n\nFormer State Representative Mitchell Kaye will lead the local elected officials coalition. Mitchell Kaye served east Cobb county for five terms in the Georgia House of Representatives, rising to deputy GOP Whip and ranking member of the tax-writing and cutting House Ways and Means committee. Kaye was awarded \"Legislator of the Year\" by the Georgia Association of Taxpayers for his tax cutting successes and by Phyllis Schlafly's Eagle Forum for his educational efforts.\n\n\nThe Georgia officials endorsing Donald J. Trump for President join State Senators Burt Jones and Michael Williams. Mr. Trump continues to lead in all national and state polls after winning the New Hampshire Primary by a landslide. He will campaign in South Carolina and other SEC states prior to the first in the south primary on February 20th.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-bill-stern-in-south-carolina", "text": "\n(New York, NY) February 10th, 2016 - Bill Stern of Columbia, S.C. has endorsed Donald Trump and has been announced Chairman of the Southeast Business Coalition on the Trump for President campaign.\n\n\nOne of the South’s most respected business leaders, Bill Stern is President and CEO of Stern & Stern, a commercial real estate development company that owns and manages real estate throughout the United States.\n\n\nMr. Trump said,”I am delighted Bill Stern has accepted a leadership role in my campaign. He is a successful real estate developer and for eight years he served as Chair of the South Carolina Ports Authority, which is one of the most important commercial ports in the world. I look forward to working closely with Bill --- with his support we will Make American Great Again.”\n\n\nMr. Stern stated, ”Throughout American history, we've had great Presidents who were lawyers, politicians and military leaders. I believe the complex global challenges of our time call for a President with a background in business, a record of success in creating jobs and the strong leadership skills it will take to Make America Great Again. That's why I'm supporting Donald Trump. He's a world class business leader who I believe will make a world class President of the United States.\"\n\n\nStern has served as Chair of the South Carolina Ports Authority for eight years and has recently been named the first Chairman Emeritus in the port's history. During his period of leadership, South Carolina's port was ranked as the fastest growing in the nation and now ranks number one in container volume growth.\n\n\nBill Stern has also served in leadership roles in political campaigns at the national, state and local levels. He served on the George W. Bush for President State Finance Committee, and he was State Finance Chair of the John McCain for President campaign. Other leadership roles include: State Finance Chair, Lindsey Graham for U.S. Senate, Co-Chair, Lindsey Graham for President; and State Finance Chair for Henry McMaster for Lt. Governor, Alan Wilson for Attorney General, and many other state and local political campaigns.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-new-radio-ad-featuring-south-carolina-lieutenant-go", "text": "\n(New York, NY) February 5th, 2015 -  Today Donald J. Trump debuted a new radio ad featuring South Carolina Lieutenant Governor Henry McMaster. The ad will begin airing today in South Carolina. Last week Mr. Trump received McMaster’s endorsement. The Lt. Gov. previously served as South Carolina Attorney General, South Carolina Republican Party Chairman, and was the first United States Attorney appointed by President Ronald Reagan.\n\n\nThe new ad focuses on key issues of Mr. Trump’s campaign including homeland security, job creation and Mr. Trump’s leadership and strength.\n\n\nLt. Gov. McMaster joined Mr. Trump at his rally in Lexington County, South Carolina last week, where there were thousands in attendance, to voice his support.\n\n\nHe said, “I am delighted to support Donald Trump.  He is a man of accomplishment and speaks the truth in words everyone can understand, instills confidence in the people about our country’s bright future, and reflects and believes in the strength and determination necessary for success.  These qualities - and his quiet compassion for those in need - are essential to making America Great Again.  Now is the time for Donald Trump.”\n\n\nMr. Trump will be in Florence this evening for a rally with a record crowd expected to attend. The Trump Campaign continues to dominate in South Carolina with all recent polls showing Mr. Trump with substantial, double digit leads in all state polls and great momentum as the February 20th primary contest approaches.\n\n\nYou can listen to the ad here: http://www.donaldjtrump.com/media/mcmaster-radio-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-endorsement-from-former-santorum-senior-adviser", "text": "\n(New York, NY) February 4th, 2016 - Today Donald J. Trump for President Inc. announced the endorsement of respected Alderman Nick Pappas of Manchester, New Hampshire.\n\n\nPappas served as the New Hampshire based senior adviser to Senator Rick Santorum and recently served as New Hampshire State Director for Generation Opportunity, a national conservative advocacy group with a focus on millennials.\n\n\nMr. Trump will be campaigning in New Hampshire today with five events around the state. He will return for the eighth Republican Presidential Debate on Saturday and stay through the primary on Tuesday.\n\n\nMr. Trump continues to lead in all national and state polls, with a significant lead in New Hampshire where he has 38% support, a massive 26-point lead over his nearest rival. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-latest-campaign-ad-to-begin-airing-in-new-hampshire", "text": "\n(New York, NY) February 3rd, 2016 – Today Donald J. Trump unveiled the latest campaign add to begin airing in New Hampshire. The ad will appear on TV starting Wednesday and is part of an $850,000 spend the campaign made last week. The ad is a compilation of footage from Trump events showcasing massive crowds, energy, passion and supporters reinforcing Mr. Trump’s message to take back the country. \n\n\nMr. Trump stated, “This is a movement. People believe in my vision to make our country better and stronger than ever before and I am so honored to have their support. I am going to make you so proud--- we will take our country back and Make America Great Again!”\n\n\nMr. Trump continues to dominate all national and local polls including maintaining a massive twenty-six point lead in New Hampshire, where he will compete in the first in the nation primary contest on Tuesday, February 9th.\n\n\nMr. Trump is self-funding his campaign and has spent millions on advertising in the first three early states. He also maintains his frontrunner status in South Carolina and all national surveys.\n\n\nYou can view the ad here: \nhttp://www.donaldjtrump.com/media/voters-speak-tv-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-raises-millions-for-veterans-organizations", "text": "\nMr. Trump Made a $1 Million Dollar Contribution at a Special Event in Des Moines to Benefit Vets\n\n\n(New York, NY) January 28th, 2016 – Today Donald J. Trump hosted an event to raise money for Veterans organizations in Des Moines, Iowa. The GOP frontrunner spoke to a record crowd at Drake University and was joined by special guests, including Senator Rick Santorum and Governor Mike Huckabee, as well as Veterans, throughout the night. Mr. Trump personally contributed $1 million dollars to the cause and raised an additional $5 million before the one-hour event concluded, totaling more than $6 million dollars.\n\n\nMr. Trump stated, “Our Veterans have been treated like third-class citizens and it is my great honor to support them with this $1 million dollar contribution – they are truly incredible people. We are going to strengthen our military, take care of our Vets and Make America Great Again.”\n\n\nThe night benefited twenty-two different organizations, a number of which are Iowa based Veterans groups. Mr. Trump has been a major supporter of Veterans organizations throughout his life and has made strengthening our military, reforming the VA and taking care of our great Veterans cornerstones of his campaign.\n\n\nSFC (R) John Wayne Walding, who spoke during the event, spent 12 years in the U. S. Army. He has combat deployments to both Iraq and Afghanistan. John's awards and badges include: Silver Star, Bronze Star, Purple Heart, Combat Infantry Badge, Airborne Air Assault and the Special Forces Tab. John participated in numerous battles during his deployments; most famous was the Battle of Shok Valley.\n\n\nTo make a contribution please visit donaldtrumpforvets.com.  A list of organizations benefitting from tonight’s event can be see here: DonaldJTrump.com/MilitaryCharities\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-becomes-the-first-campaign-to-announce-s", "text": "\nGeorgia Operation Solidifies Grassroots Teams in All 159 Counties\n\n\n(New York, NY) January 28th, 2016 - Today, Donald Trump for President Inc. announced that it is the first 2016 Presidential campaign to organize County Managers in all 159 of Georgia’s counties. These committed volunteers consist of veterans of the Tea Party movement, GOP activists, local elected officials and political newcomers energized and inspired by Mr. Trump’s candidacy to get involved in the political process for the first time in decades.\n\n\nMr. Trump said, “We have such tremendous support all over the country, the people of Georgia have been amazing. We are leading in all the polls, with 33% in the most recent Georgia survey. The support from this state is so important to me --- with their help we will Make America Great Again!”\n\n\nThese county-level leaders will form the backbone of the campaign’s grassroots operations in Georgia. They will work with the district and statewide leadership team in turning out Trump supporters for the March 1st primary.\n\n\nThe County Managers and Statewide Leadership Team join the five staffers already on the ground building out a grassroots operation. The Georgia team is led by State Director Brandon Phillips and its headquarters is located at 1000 Circle 75 Parkway, Suite 700, Atlanta, GA 30339.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-south-carolina-lieutenant-governor-henry-mcmast", "text": "\n(New York, NY) January 27th, 2016 - Today Donald J. Trump received South Carolina Lieutenant Governor Henry McMaster’s endorsement. The Lt. Gov. previously served as South Carolina Attorney General, South Carolina Republican Party Chairman, and was the first United States Attorney appointed by President Ronald Reagan. Lt. Gov. McMaster joined Mr. Trump at his rally in Lexington County, South Carolina, where there were thousands in attendance, to voice his support.\n\n\nMr. Trump stated, “Lt. Governor McMaster has a distinguished record of service to the people of South Carolina and the country, and his endorsement is a great honor. I’m proud to have Henry and his wife Peggy, join the team. The people of South Carolina are amazing and I continue to lead all state polls by wide, double digit margins.”\n\n\nLt. Governor McMaster added, “I am delighted to support Donald Trump. He is a man of accomplishment and speaks the truth in words everyone can understand, instills confidence in the people about our country’s bright future, and reflects and believes in the strength and determination necessary for success. These qualities - and his quiet compassion for those in need - are essential to “making America great again.” Now is the time for Donald Trump.”\n\n\nThe Trump Campaign continues to dominate in South Carolina with all recent polls showing Mr. Trump with substantial, double digit leads in all state polls and great momentum as the February 20th primary contest approaches. Today’s event in Lexington County, South Carolina was attended by thousands of people. He will return to South Carolina early next month. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-campaign-statement-on-fox-news-debate", "text": "\n(New York, NY) January 26th, 2016 - As someone who wrote one of the best-selling business books of all time, The Art of the Deal, who has built an incredible company, including some of the most valuable and iconic assets in the world, and as someone who has a personal net worth of many billions of dollars, Mr. Trump knows a bad deal when he sees one. FOX News is making tens of millions of dollars on debates, and setting ratings records (the highest in history), where as in previous years they were low-rated afterthoughts. \n\nUnlike the very stupid, highly incompetent people running our country into the ground, Mr. Trump knows when to walk away. Roger Ailes and FOX News think they can toy with him, but Mr. Trump doesn’t play games. There have already been six debates, and according to all online debate polls including Drudge, Slate, Time Magazine, and many others, Mr. Trump has won all of them, in particular the last one. Whereas he has always been a job creator and not a debater, he nevertheless truly enjoys the debating process - and it has been very good for him, both in polls and popularity. \n\nHe will not be participating in the FOX News debate and will instead host an event in Iowa to raise money for the Veterans and Wounded Warriors, who have been treated so horribly by our all talk, no action politicians. Like running for office as an extremely successful person, this takes guts and it is the kind of mentality our country needs in order to Make America Great Again.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-maricopa-county-arizona-sheriff-joe-arpaio", "text": "(New York, NY) January 26th, 2016 – Today Donald J. Trump received Sheriff Joe Arpaio’s endorsement. The Sheriff is well known for his hard-line stance on illegal immigration. Sheriff Arpaio joined Mr. Trump at his rally in Marshalltown, Iowa to voice his support less than one week before the Iowa Caucus.Mr. Trump stated, “I have great respect for Sheriff Arpaio. We must restore law and order on the border and respect the men and women of our police forces. I thank him for his support of my policies and candidacy for President.” Sheriff Arpaio added, “Donald Trump is a leader. He produces results and is ready to get tough in order to protect American jobs and families. I have fought on the front lines to prevent illegal immigration. I know Donald Trump will stand with me and countless Americans to secure our border. I am proud to support him as the best candidate for President of the United States of America.” Mr. Trump has visited Arizona twice since announcing his campaign in June and Sheriff Arpaio has attended both rallies in Phoenix and Mesa where the Trump campaign hosted record crowds. Mr. Trump has a strong state operation in place and has been endorsed by several community leaders including Arizona State Treasurer Jeff DeWit. Mr. Trump continues to lead all national and state polls with a significant lead in Arizona where the most recent poll out last week shows him with 38% support. He maintains a substantial lead in Iowa with great momentum heading into Monday’s Caucus. Mr. Trump will be in South Carolina on Wednesday before returning to Iowa on Thursday for the seventh Republican Presidential debate in Des Moines, Iowa. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-jerry-falwell-jr", "text": "\n(New York, NY) January 26th, 2016 – Today Donald J. Trump received the endorsement of Jerry Falwell Jr., just one week after Mr. Trump spoke to a record crowd at Falwell’s Liberty University Convocation.\n\n\nMr. Trump said, “It is truly an honor to receive Jerry’s endorsement. Not only is he a high quality person, with a wonderful family, whom I have great respect for – I also consider him a very good friend and his support means so much to me.”\n\n\nThe endorsement, which is personal and not on behalf of the University, comes just days after the campaign released an ad featuring excerpts from Falwell’s glowing introduction of Mr. Trump at the Liberty University event stating, “I see a lot of parallels between my father and Donald Trump. Like Mr. Trump, Dad would speak his mind… Dad explained that when he walked into the voting booth, he wasn't electing a Sunday school teacher, or a pastor, or even a President who shared his theological beliefs. He was electing a President of the United States to lead a nation.”\n\n\nAfter his endorsement Falwell added, “I am proud to offer my endorsement of Donald J. Trump for President of the United States. He is a successful executive and entrepreneur, a wonderful father and a man who I believe can lead our country to greatness again.”\n\n\nUnder Falwell, Jr.’s leadership, Liberty University has grown to become the largest, private non-profit university in the nation, the largest university in Virginia and the largest Christian university in the world, creating an innovative business model for higher education and increasing net assets from $100 million in 2007 to over $1.6 billion today.\n\n\nMr. Trump continues to lead all national and state polls with the latest results from FOX News and CBS showing Mr. Trump gaining momentum with a strong lead in Iowa and substantial, double digit leads in New Hampshire and South Carolina. He also maintains a very strong lead in all national surveys, with the most recent CNN poll showing Mr. Trump with 41% support nationwide. Falwell’s endorsement is expected to carry tremendous weight in Iowa, where Mr. Trump maintains strong support with the evangelical community as we approach the Iowa Caucus on February 1st.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-announces-iowa-caucus-finder", "text": "\nTrump Campaign Encourages Iowans to Vote with New Location Finder and Instructional Video\n\n(New York, NY) January 22nd, 2016 – Today Donald J. Trump for President Inc. announced a new digital tool to help voters find their Iowa Caucus locations on Monday, February 1st.\n\n\nThe campaign stated, “The only way to ensure that Donald J. Trump will be our next President of the United States is to caucus for him on February 1st— the caucus process is very fast and easy, and we are here to help if you have any questions.”\n\n\nThe  Iowa Caucus Finder (also at https://www.donaldjtrump.com/iowa/caucus-finder) will show voters where to go on Caucus night. It also includes an instructional video on how what to do once you arrive at the pre-determined locations.\n\n\nMr. Trump continues to dominate all national and state polls including an 11 point lead in the most recent CNN/ORC poll in Iowa. He will be campaigning across the state for much of the next week and continues to encourage the thousands of Iowans attending each of his rallies to Caucus next Monday night. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-debuts-new-radio-ad-featuring-jerry-falwell-jr", "text": "(New York, NY) January 22nd, 2016 – Today Donald J. Trump debuted the campaign’s most recent radio ad to begin airing in Iowa and South Carolina featuring Jerry Falwell Jr. Mr. Trump was a guest at Liberty University on Monday and was introduced by Falwell who spoke glowingly of Mr. Trump’s success, leadership and character, which he stated reminded him of his late father.Mr. Trump said, “It was a great honor to be introduced by the legendary Jerry Falwell Jr. He has built a tremendous institution and is a really terrific person with a beautiful family. We have always had a wonderful relationship and I am proud to share his kind words with the people of Iowa and South Carolina.” The ad features statements from Falwell’s introduction of Mr. Trump at the Liberty University convocation this week, which was attended by a record crowd of students and supporters. Falwell is a highly respected and influential figure in Evangelical communities. In the ad Mr. Falwell says, “I see a lot of parallels between my father and Donald Trump. Like Mr. Trump, Dad would speak his mind. He would make statements that were politically incorrect. He speaks the truth publicly, even if it is uncomfortable for people to hear it. Dad explained that when he walked into the voting booth, he wasn't electing a Sunday school teacher, or a pastor, or even a President who shared his theological beliefs. He was electing a President of the United States to lead a nation.”Mr. Trump continues to lead all national and state polls with the latest polls from Iowa and New Hampshire showing him with substantial, double digit leads over his nearest rival. The CNN/ORC poll from Iowa shows Mr. Trump with 36% support and an 11 point lead over Senator Ted Cruz and a 20 point lead over Cruz in the WMUR/CNN poll out of New Hampshire. Mr. Trump will return to Iowa this weekend and campaign in all three primary states throughout the week. You can listen to the ad here: http://www.donaldjtrump.com/media/trump-falwell-radio-spot", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-latest-tv-ad-aimed-at-senator-ted-cruz", "text": "\n(New York, NY) January 22nd, 2016 – Today Donald J. Trump unveiled his latest campaign ad aimed at Senator Ted Cruz and focused on illegal immigration, which Mr. Trump has brought to the forefront of this election and made a cornerstone of his campaign. Mr. Trump began his campaign focused on this issue, which has resonated with the American people, and he has maintained his strong stance, releasing detailed policies to address this issue posing a threat to America’s national security and economic growth.\n\n\nMr. Trump stated, “Ted Cruz is a total hypocrite and, until recently, a Canadian citizen who may not even have a legal right to run for President. He didn’t disclose loans, pretending he’s Robin Hood, when he’s just another all talk, no action politician. Had I not brought up the subject of illegal immigration, an issue which Ted Cruz is very weak on, nobody would even be talking about it. I will build a great wall, and Mexico will pay for it.”\n\n\nThe footage captures Senator Cruz in a confused state, unable to answer simple policy questions, as he contemplates his position, advice from his pollsters, donors and the special interests who control him. The only special interest Mr. Trump is beholden to is the American people, and he is the only candidate that will stop illegal immigration and Make America Great Again.\n\n\nThe ad will run on TV in Iowa, New Hampshire and South Carolina. Mr. Trump continues to spend $2 million dollars per week on advertising. Mr. Trump continues to dominate all local and national polls, including in Iowa, where we are less than two weeks away from the Caucuses and the most recent poll from CNN shows Mr. Trump with an 11 point lead.\n\nMr. Trump was in Iowa earlier this week where he received the coveted endorsement of influential conservative Sarah Palin, who previously endorsed Ted Cruz during his Senatorial bid, and attributed his success to her support stating, “She picks winners.” Mr. Trump will return to Iowa over the weekend and several days next week ahead of the Iowa Caucus on February 1st.\n\nYou can view the ad here: http://www.donaldjtrump.com/media/clear-difference-tv-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-willie-robertson", "text": "Mr. Trump Attended the Outdoor Sportsman Awards with Son Don Jr. in Las Vegas and Received Robertson’s Endorsement(New York, NY) January 21st, 2016 – Today Donald J. Trump announced yet another coveted endorsement, with Duck Dynasty star Willie Robertson touting his support for the candidate in Las Vegas. Willie is an extremely popular figure in conservative circles and previously attended a rally in Oklahoma with Mr. Trump where he praised the GOP frontrunner’s brash style and truthful talk in front of 25,000 people. Mr. Trump stated, “I am truly honored to receive Willie’s endorsement. He is a great person, has had tremendous success and a really terrific family. He believes in my message and knows that I am the only one who will Make America Great Again!” Mr. Trump was joined by his son Don Jr. and Willie at the Outdoor Sportsman Awards in Las Vegas Thursday night. Mr. Trump attended several events in Nevada on Thursday including a campaign rally attended by thousands of people. He continues to lead in all national and state polls, including the most recent Nevada poll showing Mr. Trump with a substantial lead just weeks away from the fourth in the nation Primary contest. Willie Robertson added, “Mr. Trump is a real leader. He represents success and strength, two attributes our country needs. Like me, he is a successful businessman and family man and I endorse his candidacy for President of the United States.\"", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-state-treasurer-of-arizona", "text": "\nJeff DeWit and Numerous Arizona Community Leaders Endorse Trump for President as Arizona Campaign Team Expands\n\n\n(New York, NY) January 20th, 2016 – Today Donald J. Trump received the endorsement of Jeff DeWit, State Treasurer of Arizona. DeWit is a well-respected Republican leader in Arizona where he was first elected in 2014. In addition to Mr. DeWit, Mr. Trump received the endorsement of seven other community leaders including the former State Attorney General and NRA President, Bob Corbin, former State Senator, Lori Klein Corbin, former State Senator, Senator President Pro Tempore and House Majority Whip Robert Blendu, former Arizona State Republican Chairman Tom Morrissey, former Maricopa Country Republican Chairman Lyle Tuttle, former National Committeewoman Lori Urban and former State Treasurer of Arizona former Arizona State Senator and former Yavapai County Supervisor, Carol Springer.\n\n\nMr. Trump stated, “Jeff is a terrific guy. He has been supportive of my campaign since the very beginning and it is a honor to receive the endorsement of such an intelligent, high quality individual, committed to my vision to Make America Great Again!”\n\n\nMr. Trump has campaigned in Arizona on two occasions. His first rally in Phoenix, where he spoke about illegal immigration, was attended by thousands and he most recently Mr. Trump visited Mesa, Arizona for a campaign event with more than 12,000 people in attendance. He continues to dominate all Arizona state polls and lead by wide, double digit margins in all national polls.\n\n\nTreasurer DeWit added, “Our country's political elite have forgotten that this country was built with grit and hard work, and don't seem to understand the economic ramifications of the laws they pass. As a businessman, turned State Treasurer, I am a big believer that we cannot rely on politicians to put our country back on the path to prosperity. We need a conservative political outsider with financial savvy and success, who understands what it means to build a business, make payroll, and flourish during tough times. America is fortunate to have this and more in Mr. Donald J. Trump.”\n\n\nDeWit continued, “As someone who has spent one on one time with him, I can tell you that Mr. Trump is one of the smartest and quickest minds of our time. His business success is extraordinary. His passion for America, our veterans, and protecting our freedoms is inspiring. But what may be his most admirable quality is his willingness to give back and serve our country, and fight to see that our children and our grandchildren will have the same opportunities to live, work, and raise a family in the greatest country ever known to man, the USA. I have been proud to stand with Mr. Trump since before his campaign for President was announced and in every step along the way, and I am excited to now serve as his campaign Chairman in Arizona to ensure victory in 2016. Together, let's Make America Great Again!”\n\n\nIn addition to these key endorsements, the Trump campaign has expanded its Arizona operation with new hire Thayer Verschoor, Former State Senator, Senate Majority Leader, Senate Pro Tempore, who will serve as Deputy State Director under Arizona State Director Charles Munoz.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-coveted-endorsement-of-influential-conservative-sa", "text": "\nPalin Praises Trump’s Leadership with Endorsement in Iowa\n\n(New York, NY) January 19th, 2016 – Today Donald J. Trump received the coveted and influential endorsement of former Vice Presidential Candidate and Governor of Alaska, Sarah Palin. Palin praised Trump’s leadership and unparalleled ability to speak the truth and produce real results. A trusted conservative, Palin has a proven record of being fiscally modest, staunchly pro-life and believes in small government that allows businesses to grow and freedom to prosper. Gov. Palin joined Mr. Trump in Ames on Tuesday, just two weeks before the Iowa Caucuses, to announce her endorsement of the GOP frontrunner.\n\n\nMr. Trump stated, “I am greatly honored to receive Sarah’s endorsement. She is a friend, and a high quality person whom I have great respect for. I am proud to have her support.”\n\n\nSarah Palin served as the Governor of Alaska before being selected as Senator John McCain’s Vice Presidential nominee in 2008. As the first ever female Vice Presidential candidate for the Republican party, Palin is a highly influential, decorated public figure having been named as one of the Smithsonian Institute’s 100 Most Influential Americans of All Time, one of TIME magazine’s Most Influential People In The World, Forbes 100 Most Powerful Women and 100 Most Influential Pro-life advocates by Newsmax. In addition to her political accomplishments, Sarah Palin is also a New York Times Best-Selling Author, former FOX News contributor and internationally sought-after speaker.\n\n\nSarah Palin stated, \"I am proud to endorse Donald J. Trump for President of the United States of America.”\n\n\nPalin’s endorsement is amongst the most sought after and influential amongst Republicans. Since 2009 she has supported over 150 conservative candidates, helping to flip over thirty US House seats and 5 US Senate seats to regain historic majorities. She helped launch the careers of several key future leaders of the Republican Party and conservative movement. Senator Ted Cruz notes: “I would not be in the United States Senate were it not for Gov. Sarah Palin… She can pick winners.” Senator Jim Demint noted: “She has done more to change the political landscape in America as anyone since Ronald Reagan.”\n\n\nMr. Trump campaigned in Winterset, Altoona, and Ames, Iowa today and will be in Norwalk, Iowa for an event tomorrow, before traveling to Tulsa, Oklahoma for a rally with thousands expected to attend. Palin will travel with the candidate to both events on Wednesday. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-names-louisiana-state-leadership-team", "text": "\nJenkins, Skrmetta to Serve as State Chairmen\n\n\n\n(New York, NY) January 19th, 2016 – Today Donald J. Trump for President Inc. announced its Louisiana State Leadership Team. The Trump Campaign’s Louisiana operation is being led by State Director Ryan Lambert and today announced Public Service Commissioner Eric Skrmetta and former State Representative Woody Jenkins as the State Chairman and Jeff Crouere and Brian Trascher as state Co-Chairs.\n\n\nMr. Trump says, “I am proud to announce our Leadership Team in Louisiana where we have tremendous grassroots support and a great team in place. I look forward to visiting soon and working with these individuals, whose support is so important, to share my vision to Make America Great Again!”\n\n\nSkrmetta was elected Public Service Commissioner for District 1 in 2008. His district includes 11 parishes and a million consumers in the southeastern part of Louisiana. Skrmetta served as Chairman of the Commission and earned high praise for leading Louisiana to the lowest utility rates in the nation. He also serves as President on the Entergy Regional State Committee. A lifelong Republican, Skrmetta began his dedication to public service on the staff of the former Louisiana Governor Dave Treen, the first Republican Governor of Louisiana since Reconstruction.\n\n\nAlso a lifelong Republican, Jenkins was elected to the Louisiana House of Representatives in 1972 and served for 28 years until 2000. He represented District 66 located in East Baton Rouge parish. As a legislator, over three hundred of the bills he authored became law. While in the legislature, Jenkins formed and served as chairman of the Conservative Caucus in the state house. He also served as chairman of the House Committee on Labor and Industrial Relations and was the 1996 Republican Nominee for Senate. A journalist by trade and an inductee into the LSU Journalism Hall of Fame, Jenkins is the editor of Capital City News, an award-winning community weekly newspaper. Jenkins is the Chairman of the East Baton Rouge Parish Republican Party, the largest in the state.\n\n\nSaid Skrmetta, \"I look forward to sharing the policies of businessman Donald Trump and promoting his candidacy. His confidence and strong convictions have a place in today's politics. His business-savvy and negotiation skills will be valuable assets to our country. I support Mr. Trump's economic policies favoring free enterprise and fewer government regulations.”\n\nRepublicans Jeff Crouere and Brian Trascher, both natives of New Orleans, will add political expertise as State Co-Chairs of the campaign. Jeff Crouere is host of the Louisiana based radio and TV program, “Ringside Politics” and is previous Executive Director & Deputy Chairman for the LAGOP. Brian Trascher is a Senior Partner with New Orleans-based Gulf South Strategies, the firm best known for recruiting the Uber Car Service to Louisiana. Trascher is a veteran political operative with strong, bipartisan relationships throughout Louisiana. Crouere and Trascher join Tim Breaux of Lafayette and Wayne Ryan of Alexandria as Co-Chairs.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-new-radio-ad-in-iowa-and-new-hampshire-featuring-d", "text": "\nIvanka Trump Featured in Latest Radio Spot for Trump Campaign\n\n\n(New York, NY) January 18th, 2016 – Today Donald J. Trump unveiled a new radio ad to begin airing in Iowa and New Hampshire featuring his daughter Ivanka Trump.\n\n\nMr. Trump stated, “My family has been so supportive of me and my candidacy and I am so proud of Ivanka. She is a terrific person, a devoted mother and an exceptional entrepreneur. Ivanka is doing a fantastic job running my company, alongside her brothers, and is building many of my biggest jobs. It is so important to have the support of all of my children and I’m really proud of this ad.”\n\n\nThe ad features Ivanka talking about her father as only a daughter can. She discusses what it was like to grow up learning from the GOP frontrunner, and what he taught her about becoming a great entrepreneur and parent.\n\n\nIvanka added, “My father has experienced unparalleled success in business over many decades and built an amazing company that employs thousands of people. I have witnessed his vision, strength and competence each day of my life. He has been an incredible father to me and my siblings and I love him very much.”\n\n\nMr. Trump continues to lead all national and state polls, with the Iowa Caucus just two weeks away. Last Thursday Mr. Trump participated in the sixth Republican Presidential debate in South Carolina after which he was unanimously declared the winner.\n\n\nYou can listen to the radio ad here:\nhttp://www.donaldjtrump.com/media/ivanka-trump-radio-spot\n\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-tidewater-and-valley-leadership-teams", "text": " Mr. Trump is the Definitive Frontrunner With 9 Point Lead in Recent Virginia Poll \n(New York, NY) January 18th, 2016- Today the Donald J. Trump for President Campaign has announced additional members to its Tidewater Leadership Team consisting of current and former elected officials and party leaders.\n\n\nMr. Trump said “It is such an honor to have the support of so many grassroots leaders across Virginia where we are leading in the polls by substantial margins. The people of Virginia are ready to Make America Great Again!”\n\n\nNew members of the leadership team include Chesapeake County School Board Chairman Christie New Craig, Accomack County Supervisor Wanda Thornton, Former Northampton GOP Chair John Salm, Newport News GOP Chair Cliff Dunn, Former Hampton City Councilman Chris Stuart and Virginia GOP State Central Committee Members Cheryl Hargrove and Roger Miles.\n\n\nIn addition to the newest additions to the Tidewater team the Trump campaign is proud to announce its Valley Leadership team comprising of local elected officials, business leaders and party leaders. The addition to the leadership team builds momentum in Roanoke area and Shenandoah Valley.\n\n\nFormer Republican Party of Virginia Finance Chairman Walter Curt of Harrisonburg will serve as Chairman. Amherst County Board of Supervisors Chairwoman Claudia Tucker will serve as co-chair.\n\n\nOther members of the leadership team include Augusta County businessman Charlie O’Baugh, Shenandoah Tea Party Chairman Ed Long, Sixth Congressional District GOP Vice Chair Chris Green and Botetourt County Supervisor Billy Martin.\n\n\nAlso today, Mr. Trump spoke to thousands of people at Liberty University in Lynchburg, Virginia where he held a campaign rally for students and supporters.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-releases-second-ad-to-begin-airing-in-iowa-and-new-hampshir", "text": "\nTV Spot Called “Our Country” Features Trump Emphasizing his Message to Make America Great Again\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-sue-everhart-former-georgia-republican-party-ch", "text": "\nTrump Campaign Continues to Expand in Georgia with Statewide Leadership Team\n\n(New York, NY) January 14th, 2016 – Today Donald J. Trump announced the expansion of his campaign operation in Georgia with a statewide leadership team led by honorary chair, and former Georgia Republican Party Chair, Sue Everhart. Following a successful campaign headquarters grand opening with a record crowd in Cobb County, the Trump campaign received the endorsement of Sue Everhart and a group of prominent community leaders, including grassroots activists, business executives, veterans, elected officials, former GOP party leaders, former Democrats, and many more.\n\n\n\nGeorgia State-Wide Leadership Committee:\n\nSue Everhart, Honorary State Chair\n\nSenator Burt Jones, State Co-Chair\n\nSenator Michael Williams, State Co-Chair\n\nRayna Casey, State Co-Chair\n\nBruce LeVell, State Co-Chair\n\nTyler Van Landingham, Metro Atlanta Regional Coordinator\n\nCarolyn Roddy, Metro Atlanta Regional Deputy Coordinator\n\nJordan Howard, 1st District Manager\n\nRitch McCutchen, 2nd District Manager\n\nBob Blackburn, 3rd District Manager\n\nAnthony Morris, 8th District Manager\n\nTerry Wellham, 9th District Manager\n\nMitch Mitcheltree, 10th District Manager\n\nLee Burton, 12th District Manager\n\nSeth Owens, 14th District Manager\n\nVivian Childs, GOP Grassroots Liaison\n\nBob Mayzes, Ballot Access Chairman\n\nMitchell Kaye, Local Elected Officials Chair\n\nShawn Hanley, Veterans for Trump Chair\n\nChad Ethridge, Farm Team Chair\n\nJennifer Maloney, Women for Trump Chair\n\nEugene Yu, Asain Americas for Trump Chair\n\nWeston Kirk, Young Professionals for Trump Chair\n\nCody Lautner, Students for Trump Chair\n\nCarmenza Perdomo, Hispanics for Trump Chair\n\nDennis Bell, Law Enforcement for Trump Chair\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-several-community-leaders-in-florida", "text": "\n\nTrump Campaign Stronger Than Ever in Sunshine State Rolling Out Key Endorsements at Massive Pensacola Rally\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-joseph-a.-trillo-as-rhode-island-honorary-chairma", "text": "\n(New York, NY) January 12th, 2016 – Today Donald J. Trump announced State Representative Joseph A. Trillo will serve as the Honorary Chairman of his campaign in the state of Rhode Island.\n\n\nMr. Trump stated, “It is my pleasure to have Joe serve as our Honorary Chairman in the great state of Rhode Island. Securing our border and solving the issue of illegal immigration has become a cornerstone of my campaign and I have great respect for Joe’s passion with regard to solving this problem. With the help of Joe and so many other supporters in Rhode Island, we will Make America Great Again.”\n\n\nState Representative Joseph A. Trillo currently serves as the Minority Whip in the Rhode Island General Assembly, is host of the statewide cable TV show “Trillo Talks” and is a life-long businessman and real estate investor. He has been an outspoken opponent of illegal immigration, having traveled to the Mexican border to see first-hand how serious the problem really is. Trillo has introduced e-verify legislation and supported the prohibition of illegal immigrants obtaining drivers licenses. Trillo previously served as Republican National Committeeman for the state.\n\n\nTrillo added, “As a long-time admirer of Mr. Trump’s business acumen, it is a great honor to now serve as his Honorary Campaign Chairman for Rhode Island, where his vision and messageare clearly resonating. I look forward to helping take that message to even more voters so we can Make America Great Again.”\n\n\nMr. Trump continues to be the definitive front-runner in all national polls. Yesterday day he campaigned in Windham, New Hampshire before traveling to \nIowa, Florida, and South Carolina for multiple visits throughout the week.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-major-granite-state-endorsements-from-prominent-co", "text": "\nTrump Campaign Continues to Dominate in New Hampshire Weeks Before Primary Contest\n\n\n(New York, NY) January 11th, 2016 – Today Donald J. Trump received endorsements from four prominent and highly respected businessmen in New Hampshire: Ben Gamache, Bruce Breton, Arthur Sullivan, and Sam Tamposi Jr. These four individuals are responsible for driving the majority of economic development in the state for the last several years and they recognize Mr. Trump’s unparalleled abilities and leadership as one of the most successful entrepreneurs of all time.\n\n\nMr. Trump stated, “I am honored to receive these important endorsements from such accomplished businessmen in the great state of New Hampshire. Their support, and the support of so many incredible people all over the state means so much to me. It is time to Make America Great Again and with your help, on February 9th, we will do just that.”\n\n\nA strong supporter of the local community, Gamache has served the Manchester Chamber of Commerce, Chairman of the Board for Intown Manchester, and proudly served as Chairman of the Board for Easter Seals New Hampshire from 2007 to 2009. His strong professional reputation, charitable endeavors, and active participation in Manchester city politics have made him a coveted community endorsement and he is proud to support Donald J. Trump as the Republican nominee for President of the United States.\n\n\nBruce Breton served as Chair of Windham GOP in 2015 and is a Selectman in the Town of Windham. Breton, a former Pataki supporter, proudly endorses Donald J. Trump.\n\n\nArthur Sullivan is co-owner of Brady Sullivan properties, which owns some of the most iconic properties in the state of New Hampshire, including City Hall Plaza, Brady Sullivan Plaza, and Brady Sullivan Tower.\n\n\nSam Tamposi Jr. is President of the Tamposi Company, a well-known Republican Party activist, member of the Rivier College Board of Trustees, and Heritage Club Member of the Boys and Girls Club of Greater Nashua. His father, Sam Tamposi Sr., was part owner of the Boston Red Sox.\n\n\nMr. Trump visited New Hampshire again today where he had a capacity crowd at his rally in Windham, New Hampshire and has several more visits planned prior to February 9th. Mr. Trump continues to hold a commanding lead in all New Hampshire state polls as well as nationally, as the first in the nation primary contest approaches. The most recent poll, just released by Monmouth University, shows Mr. Trump with a wide, double digit point lead over his closet rival with 26% support. Also, recently released polls from NBC/WSJ, FOXNews, and NH1 show similar, double digit leads for Mr. Trump who continues to be the definitive front runner for the Republican nomination for President of the United States.  \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-is-first-to-file-to-be-on-the-ballot-in-west-virginia", "text": "Trump Campaign Files a Full Slate of Convention Delegates(New York, NY) January 11th, 2016 – Today Donald J. Trump for President Inc. announced the campaign has officially filed to be on the ballot of the May 10th, 2016 West Virginia Republican Presidential Primary. The Trump campaign also filed a full slate of delegates for the Republican National Convention, which will take place in Cleveland July 18-21, 2016. The Trump campaign filing is the first of any candidate and was submitted weeks ahead of the deadline. Mr. Trump stated, “It is my honor to be on the ballot in West Virginia. We have received tremendous support from so many people in the Mountain State and are leading in all the polls by double digits. In fact, my support in West Virginia is higher than in any other state in the nation. I look forward to visiting soon and sharing more about my message and my plans to Make America Great Again!” Mr. Trump’s campaign also filed a full slate of delegate candidates for the Republican National Convention. The delegate candidates will also appear on the ballot of the May 10 primary. Two of the delegate candidates, State Senator Mark Maynard (Wayne County) and former West Virginia GOP Chairman Mike Stuart (Kanawha County), will serve as co-chairs of the campaign’s leadership team in the state.The slate of delegates committed to Mr. Trump includes current and former state legislators, activists and party leaders from every region of the state.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-expansion-of-georgia-campaign-operation", "text": "\n\nTrump Campaign Hires Four Additional Staffers and Announces Cobb County, GA Grand Opening \n\n(New York, NY) January 7th, 2016 – Today Donald J. Trump for President Inc. announced four new hires and a new office Georgia where Mr. Trump has had tremendous crowds and continues to lead all state polls by double-digits.\n\n\nMr. Trump says, “The people of Georgia are incredible and the response to my message has been amazing. We have built a great team and with their help, we will Make America Great Again!”\n\n\nRyan Caudelle, Deputy Director, oversees the statewide political operation and administration. He has an MBA and previously worked at Barclays and has experience working for Georgia Governor Nathan Deal and Congressman Jack Kingston.\n\n\nCharlice Byrd, Field Coordinator, oversees the North Georgia Field Operations. She is a former State Representative, graduate of the Coverdell Leadership Institute and veteran of several national, state and local campaigns and was selected as one of the Top 25 Most Influential Asians in Georgia by Asian Times Magazine.\n\n\nGary Wisenbaker, Field Coordinator, oversees the South Georgia Field Operations. He has a Juris Doctor and has been active in Georgia politics since his days as Georgia Young Republican Chairman in 1986. He is a former appointee to the Georgia Student Finance Commission by Governor Sonny Perdue and veteran of several state and local campaigns.\n\n\nJeanne Seaver, Grassroots Coordinator, oversees the statewide grassroots operation, volunteer onboarding and coalition outreach. She is the co-founder of the Savannah TEA Party and President of the Georgia Grassroots Coalition and veteran of Republican grassroots activities. She is also a graduate of the Coverdell Leadership Institute, former Chatham County Co-Chair for David Perdue for U.S. Senate and Chair for Herman Cain for President.\n\n\nAdditionally, the campaign has opened a Georgia Headquarters in Cobb County at 1000 Circle 75 Parkway, Suite 700, Atlanta, GA 30339 and will be hosting a Grand Opening, Saturday, January 9th at 10:00 a.m. The Georgia Trump campaign is led by State Director Brandon Phillips.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-campaign-announces-louisiana-leadership-team", "text": "\nTrump Campaign Continues to Build Beyond Early Primary States\n\n\nJay Batt currently serves as Chairman of the Allstate Sugar Bowl and previously served as President of the Sugar Bowl Committee, New Orleans Parish Council Member, owner and operator of multiple businesses nationwide, and deputy chairman of the Republican state central committee, among other accomplishments.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-expansion-of-texas-campaign-operation", "text": "Trump Campaign Hires Four Additional Staffers\n\n(New York, NY) January 6th, 2016 - Donald J. Trump for President Inc. announced four new hires in the state of Texas where Mr. Trump has visited several times and continues to lead in almost all state polls.\n\nMr. Trump stated, “I love the people of Texas and I am proud to have such a strong team in place in this important state as we work together to Make America Great Again!”\n\nJoshua Jones, Deputy Director, oversees the statewide grassroots operation and administration. He has an MBA, is an engineer by trade and a veteran of campaigns at the highest levels including U.S. Senate, Governor and U.S. Congress races.\n\nEric Mahroum, Field Director, oversees Dallas/Fort Worth and north Texas. A former candidate for State Board of Education, Eric, along with his extensive business background, brings strong grassroots organization skills and keen political knowledge, having worked on several campaigns for President, U.S. Senate, Governor and Congress.\n\nKayla Hensley, Field Director, oversees the Houston area and east Texas. She is a social media expert and helped organize grassroots volunteers across the state via one of the first pro-Trump Facebook groups, which led to the campaign tapping her to join the campaign full time.\n\nPaul Janiczek, Field Director, oversees central, south and west Texas. A veteran of the U.S. Navy and graduate of U.S. Naval War College, Paul is a former State Director for Concerned Veterans of America, served in several roles in the U.S. State Department and mobilized veterans for McCain for President in 2008.\n\nThe Trump Campaign’s Texas operation is headquartered in Austin (815-A Brazos Street PMB 403 Austin, TX 78701) and led by State Director Corbin Casteel. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-endorsement-of-andrew-hemingway", "text": "\nTrump Campaign Continues to Expand New Hampshire Team Ahead of February 9th Primary\n\n\n(New York, NY) January 5\nth, 2016 – Today Donald J. Trump announced that he has received the endorsement of former Ted Cruz supporter and respected New Hampshire activist and entrepreneur Andrew Hemingway. Hemingway will play a key role in assisting the campaign as a state co-chair in New Hampshire.\n\n\nMr. Trump stated, “I love the people of New Hampshire and have made many great friends over the years. We have a great team in place, the biggest crowds and continue to lead all the polls. Andrew is a great addition and with his help we will win New Hampshire and Make America Great Again!”\n\n\nHemingway served as the state director for Newt Gingrich’s 2012 presidential campaign, and he is a former chair of the New Hampshire Republican Liberty Caucus. He is currently the CEO of TheMountain.com, a New Hampshire-based business that employs over 200 Granite Staters.\n\n\nHemingway added that, “Mr. Trump built the most robust grassroots network out of all candidates in the race. He has engaged thousands of Granite Staters who had never found a reason to participate in the past. He is earning the support of these voters with the straight-talk they have been seeking for years. Mr. Trump has the business experience and leadership abilities that the other candidates in this race lack. We cannot afford to elect another Washington insider that promises one thing and does another.”\n\n\nTonight Mr. Trump will be in Claremont, New Hampshire for a rally, where Mr. Hemingway will speak during the pre-program, and last night Mr. Trump visited nearby Lowell, Massachusetts where he hosted a record crowd of nearly 10,000 people.  \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-files-to-be-on-the-ballot-in-illinois", "text": "\n(New York, NY) January 4th, 2016 – Today Donald J. Trump for President Inc. announced the campaign has officially filed to be on the ballot of the March 15, 2016 Illinois Republican Presidential Primary. Mr. Trump’s campaign also filed a full slate of delegates for the Republican National Convention which will take place in Cleveland July 18-21, 2016. \n\n\nMr. Trump stated, “It is my honor to be on the ballot in Illinois and to file a full slate of delegates. We have received tremendous support from so many people in Illinois, we are leading in all the polls and have had the largest crowds. With the support of the people of Illinois, and around the country, we will Make America Great Again.”\n\n\nMr. Trump has a definitive lead in all national and state polls where most recently he was leading in Illinois by a wide, double digit margin.\n\n\nTonight, Mr. Trump will campaign in Massachusetts before heading to New Hampshire, Vermont, South Carolina, and Iowa later in the week.\n\n \n", "author": "Trump"}
{"url": "https://berniesanders.com/press-release/spike-lee-endorses-sanders-in-radio-ad/", "text": "NORFOLK, Va. – Bernie Sanders’ presidential campaign on Tuesday released a new radio ad featuring director, producer and activist Spike Lee.“Ninety-nine percent of Americans were hurt by the Great Recession of 2008,” Lee says in the spot. “And many are still recovering. And that’s why I’m officially endorsing my brother Bernie Sanders. Bernie takes no money from corporations. Nada. Which means he’s not on the take! And when Bernie gets into the White House, he will do the right thing!.”“And the months leading up to the election in November will determine which way this country is going to go; forward or backward,” Lee told a crowd in February 2008 when he endorsed then-Sen. Barack Obama. “It’s up to you to do the right thing.”“How can we be sure?” the director and producer says in the spot supporting Sanders. “Bernie was at the March on Washington with Dr. King. He was arrested in Chicago for protesting segregation in public schools. He fought for wealth and education equality throughout his whole career. No flipping, no flopping.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-wins-nevada-latinos-study-shows/", "text": "LAS VEGAS – Bernie Sanders won the Latino vote in Nevada, according to an analysis released on Monday by the widely-respected William C. Velasquez Institute.The institute’s detailed analysis was conducted after Hillary Clinton’s campaign disputed entrance poll numbers by discounting the impact of high turnout by younger Latino voters in Saturday’s Nevada precinct caucuses.“We note that some analysts have said that Secretary Clinton’s victories in heavily Latino precincts proved that she won the Latino vote. However the methodology of using heavily Latino or ‘barrio’ precincts to represent Latino voting behavior has been considered ineffective and discarded for more than 30 years due to non-barrio residential patterns common among Latino voters since the 1980’s,” said Antonio González, the president of the non-partisan organization whose purpose is to conduct research aimed at improving the level of political and economic participation in Latino and other communities.“Simply put there is no relevant statistical inconsistency between Edison’s Entry Poll results for Latinos, Whites, and Blacks and the overall election results. Based on this fact WCVI concludes that there is no statistical basis to question the Latino vote breakdown between Secretary Clinton and Sen. Sanders.”“It is not surprising that we received the support of the Latino community in Nevada, especially since the majority of those that turned out were young Latinos,” said Erika Andiola, a Sanders spokeswoman. “We have consistently seen that the under-35 age group overwhelmingly supports Sen. Sanders, regardless of race, ethnicity or gender. It’s also important to remember that young Latinos live all across Nevada and not just in Clark County.”According to the Census Bureau, the Latino population in Nevada is 10 years younger than the national average.“For months, as Sen. Sanders has traveled across the country, we have seen that the more people get to know him and learn about his consistency and what he stands for, the more people support him. This was certainly the case in Nevada as well where we saw a huge shift in support after he started spending time in the state and staff and volunteers mobilized to amplify his message,” Andiola said.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/spike-lee-endorses-sanders-in-radio-ad/", "text": "NORFOLK, Va. – Bernie Sanders’ presidential campaign on Tuesday released a new radio ad featuring director, producer and activist Spike Lee.“Ninety-nine percent of Americans were hurt by the Great Recession of 2008,” Lee says in the spot. “And many are still recovering. And that’s why I’m officially endorsing my brother Bernie Sanders. Bernie takes no money from corporations. Nada. Which means he’s not on the take! And when Bernie gets into the White House, he will do the right thing!.”“And the months leading up to the election in November will determine which way this country is going to go; forward or backward,” Lee told a crowd in February 2008 when he endorsed then-Sen. Barack Obama. “It’s up to you to do the right thing.”“How can we be sure?” the director and producer says in the spot supporting Sanders. “Bernie was at the March on Washington with Dr. King. He was arrested in Chicago for protesting segregation in public schools. He fought for wealth and education equality throughout his whole career. No flipping, no flopping.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-wins-nevada-latinos-study-shows/", "text": "LAS VEGAS – Bernie Sanders won the Latino vote in Nevada, according to an analysis released on Monday by the widely-respected William C. Velasquez Institute.The institute’s detailed analysis was conducted after Hillary Clinton’s campaign disputed entrance poll numbers by discounting the impact of high turnout by younger Latino voters in Saturday’s Nevada precinct caucuses.“We note that some analysts have said that Secretary Clinton’s victories in heavily Latino precincts proved that she won the Latino vote. However the methodology of using heavily Latino or ‘barrio’ precincts to represent Latino voting behavior has been considered ineffective and discarded for more than 30 years due to non-barrio residential patterns common among Latino voters since the 1980’s,” said Antonio González, the president of the non-partisan organization whose purpose is to conduct research aimed at improving the level of political and economic participation in Latino and other communities.“Simply put there is no relevant statistical inconsistency between Edison’s Entry Poll results for Latinos, Whites, and Blacks and the overall election results. Based on this fact WCVI concludes that there is no statistical basis to question the Latino vote breakdown between Secretary Clinton and Sen. Sanders.”“It is not surprising that we received the support of the Latino community in Nevada, especially since the majority of those that turned out were young Latinos,” said Erika Andiola, a Sanders spokeswoman. “We have consistently seen that the under-35 age group overwhelmingly supports Sen. Sanders, regardless of race, ethnicity or gender. It’s also important to remember that young Latinos live all across Nevada and not just in Clark County.”According to the Census Bureau, the Latino population in Nevada is 10 years younger than the national average.“For months, as Sen. Sanders has traveled across the country, we have seen that the more people get to know him and learn about his consistency and what he stands for, the more people support him. This was certainly the case in Nevada as well where we saw a huge shift in support after he started spending time in the state and staff and volunteers mobilized to amplify his message,” Andiola said.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/spike-lee-endorses-sanders-in-radio-ad/", "text": "NORFOLK, Va. – Bernie Sanders’ presidential campaign on Tuesday released a new radio ad featuring director, producer and activist Spike Lee.“Ninety-nine percent of Americans were hurt by the Great Recession of 2008,” Lee says in the spot. “And many are still recovering. And that’s why I’m officially endorsing my brother Bernie Sanders. Bernie takes no money from corporations. Nada. Which means he’s not on the take! And when Bernie gets into the White House, he will do the right thing!.”“And the months leading up to the election in November will determine which way this country is going to go; forward or backward,” Lee told a crowd in February 2008 when he endorsed then-Sen. Barack Obama. “It’s up to you to do the right thing.”“How can we be sure?” the director and producer says in the spot supporting Sanders. “Bernie was at the March on Washington with Dr. King. He was arrested in Chicago for protesting segregation in public schools. He fought for wealth and education equality throughout his whole career. No flipping, no flopping.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-wins-nevada-latinos-study-shows/", "text": "LAS VEGAS – Bernie Sanders won the Latino vote in Nevada, according to an analysis released on Monday by the widely-respected William C. Velasquez Institute.The institute’s detailed analysis was conducted after Hillary Clinton’s campaign disputed entrance poll numbers by discounting the impact of high turnout by younger Latino voters in Saturday’s Nevada precinct caucuses.“We note that some analysts have said that Secretary Clinton’s victories in heavily Latino precincts proved that she won the Latino vote. However the methodology of using heavily Latino or ‘barrio’ precincts to represent Latino voting behavior has been considered ineffective and discarded for more than 30 years due to non-barrio residential patterns common among Latino voters since the 1980’s,” said Antonio González, the president of the non-partisan organization whose purpose is to conduct research aimed at improving the level of political and economic participation in Latino and other communities.“Simply put there is no relevant statistical inconsistency between Edison’s Entry Poll results for Latinos, Whites, and Blacks and the overall election results. Based on this fact WCVI concludes that there is no statistical basis to question the Latino vote breakdown between Secretary Clinton and Sen. Sanders.”“It is not surprising that we received the support of the Latino community in Nevada, especially since the majority of those that turned out were young Latinos,” said Erika Andiola, a Sanders spokeswoman. “We have consistently seen that the under-35 age group overwhelmingly supports Sen. Sanders, regardless of race, ethnicity or gender. It’s also important to remember that young Latinos live all across Nevada and not just in Clark County.”According to the Census Bureau, the Latino population in Nevada is 10 years younger than the national average.“For months, as Sen. Sanders has traveled across the country, we have seen that the more people get to know him and learn about his consistency and what he stands for, the more people support him. This was certainly the case in Nevada as well where we saw a huge shift in support after he started spending time in the state and staff and volunteers mobilized to amplify his message,” Andiola said.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-record-vs-clintons-rhetoric/", "text": "SOUTH BOSTON, Mass. – Contrasting his record and her rhetoric, U.S. Sen. Bernie Sanders on Monday laid out key differences with Hillary Clinton in their contest for the Democratic Party presidential nomination.“People need to know the difference between hastily-adopted campaign rhetoric and the real record and long-held ideas of the candidates,” Sanders said during a news conference at a labor union hall. He spelled out differences with Clinton on trade policy and talked about the difference between his people-powered campaign and her Wall Street-bankrolled Super PAC.He called for overturning the Supreme Court ruling in Citizens United. The disastrous 2010 decision led to creation of super PACs, like Clinton’s Priorities USA, which take unlimited sums from millionaires and billionaires. There is what Sanders called “a very profound difference” between his campaign – funded by more than 4 million individual donations averaging $27 apiece – and Clinton’s super PAC, which in the last half of 2015 raised $25 million from powerful special interests including $15 million from Wall Street.“Now I know that every candidate who has ever received special-interest money always says that the millions of dollars they receive will never influence them. Never, never, never. Well, Americans need to ask a simple question. If these contributions from powerful special interests have no influence over the candidates, why are they making huge campaign contributions?” Sanders asked.On trade, Sanders welcomed Clinton’s new-found resistance to a proposed Pacific Rim trade deal but noted that she was sympathetic to it in the past and favored other bad trade deals like the North American Free Trade Agreement. The trade pacts promoted by multi-national corporations have contributed to the shutdown of 60,000 U.S. factories and resulted in the loss of good-paying jobs in the United States. While Clinton may have shifted stands recently, Sanders noted that Thomas Donahue, the head of the U.S. Chamber of Commerce, predicted she would do another about-face and support the business-backed deal if she wins the White House.At the same news conference, Sanders was endorsed by People’s Politics, a grassroots group that fights for racial and economic justice.“I hold many identities within me,” Maria Elena Letona, executive director of Neighbor to Neighbor Massachusetts Action, said. “I am an Afro-Latina, immigrant, woman. Like me, no one in our country is simply one thing. The crisis we face today is complex. We need a leader who won’t separate economic inequality from the fight to end racism. We need a leader who represents us as a whole people. The promise of Bernie Sanders’ campaign is that the political revolution is big enough for all of us.”The members of People’s Politics endorsing Sanders today include Neighbor to Neighbor Massachusetts Action, Maine People’s Alliance, Vocal-N.Y. Action Fund, Community Voices Heard Power of New York and SouthWest Organizing Project Action of New Mexico. Several members of People’s Politics, The Reclaim Campaign/The People’s Lobby of Illinois, Rights and Democracy of Vermont and New Hampshire and Iowa Citizens for Community Improvement Action, have already endorsed Sanders bid for the White House.Sanders flew to Massachusetts for the news conference here and a rally in Amherst after campaigning in South Carolina, where Democrats vote on Saturday. Voters in Massachusetts and 11 other states hold caucuses or go to the polls in one week on Super Tuesday.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-on-trump-bring-him-on/", "text": "GREENVILLE, S.C. – Bernie Sanders told more than 5,200 supporters at a rally on Sunday that he would relish the chance to run against Donald Trump, the Republican front-runner who trails Sanders in national polls but notched a win in his party’s primary fight here on Saturday.“This is a campaign that has the momentum not only in the Democratic Party primary process but if you want a candidate who is going to defeat Donald Trump, you’re looking at him,” Sanders said. “There would be nothing that would give me greater pleasure than in fact beating Donald Trump.”American voters back Sanders over Republican White House hopefuls by as much as 10 percentage points, according to a Quinnipiac University national poll released last Thursday. Sanders led Trump by six points. Hillary Clinton, in sharp contrast, trails or ties leading Republicans. The Quinnipiac poll found Clinton edged Trump by only 1 percent.“It’s certainly Sen. Bernie Sanders’ moment. The Vermont firebrand leads all potential GOP rivals in raw numbers and raw emotion with the best scores for favorability and several key character traits,” Tim Malloy, assistant director of the Quinnipiac University Poll, said in a news release. The independent pollster said Sanders has the highest favorability rating of any candidate and the highest scores for honesty and integrity, for caring about voters’ needs and  problems and for sharing voters’ values.At the biggest South Carolina rally ever for Sanders, he also talked about how he overcame long odds to tie Clinton in Iowa on Feb. 1, defeat her by 22 points in New Hampshire on Feb. 9 and finish much closer than expected in Saturday’s Nevada caucuses. “A lot has changed in the last nine months,” Sanders said.The growing momentum for his campaign also has been reflected in growing financial support. “One of the most amazing things that has happened in a very long time in American politics is that over the past nine months what we have seen is that our campaign has received 4 million individual campaign contributions. That is more campaign contributions than any campaign in the history of America at this point,” Sanders said.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-speaks-at-brookland-baptist-church/", "text": "COLUMBIA, S.C. – U.S. Sen. Bernie Sanders was the guest of the Rev. Charles Jackson at a lunch with Brookland Baptist Church members on Sunday.“Sen. Sanders, we are so appreciative of you stopping by to see us today,” the pastor said before introducing the senator.With Democratic voters headed to the polls here in just six days, Sanders told the congregation that “the country will be looking at South Carolina,” and added, “I’m here to ask your help to help lead this country to a political revolution in which ordinary people will be represented in Washington, not just a handful of wealthy campaign contributors.”During brief remarks, Sanders touched on the economy and criminal justice reform.Turning to civil rights and criminal justice, Sanders said the United States leads the world in the number of inmates behind bars. “We have in America today a broken criminal justice system. We should not be having more people in jail, largely African-American and Latino, than any other country on earth. We are going to invest in education and jobs, not more jails,” he said. Sanders’ criminal justice reform proposals include ensuring that police forces reflect the diversity of their communities, eliminating for-profit prisons, ending mandatory minimum sentencing and giving judges more leeway in sentencing.Sanders was joined at the church by Rep. Terry Alexander from Florence, South Carolina. Alexander was among the earliest Sanders supporters in the Palmetto State. Also accompanying Sanders at the church was Ben Jealous, the former president of the NAACP and a prominent Sanders supporter.Watch the remarks:\n", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-wins-latino-vote-in-nevada/", "text": "LAS VEGAS – After trailing by as many as 50 points in Nevada, U.S. Sen. Bernie Sanders pulled within 4 points of former Secretary Hillary Clinton in the Nevada caucuses.A key factor in Sanders making up so much ground in Nevada was his strong showing with Latino voters. According to entrance polls Sanders won among Latino voters by 8 points.“What we learned today is Hillary Clinton’s firewall with Latino voters is a myth,” Arturo Carmona, deputy political director for Bernie 2016, said. “The Latino community responded strongly to Bernie Sanders’ message of immigration reform and creating an economy that works for all families. This is critically important as we move ahead to states like Colorado, Arizona, Texas and California.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-grassroots-campaign-passes-4-million-milestone/", "text": "\nHENDERSON, Nev. – U.S. Sen. Bernie Sanders’ presidential campaign raised almost $21.3 million in January from small donors who contributed about $27 apiece on average, according to a report filed on Saturday with the Federal Election Commission.Through Jan. 31, Sanders had raised $94.8 million since the campaign was launched last April 30.Altogether, Sanders’ grassroots campaign to date has received more than 4 million contributions.Sanders spoke about campaign finances in a speech to some 600 supporters after Nevada’s precinct caucuses on Saturday.“What this entire campaign has been about has been the issue of momentum and bringing more and more people into the political process,” he said. Speaking about “a corrupt campaign finance system which has undermined American democracy,” Sanders declared that “we will not allow billionaires and their super PACs to continue to buy elections in the United States of America.”Unlike other candidates who are bankrolled by wealthy donors, only 3 percent of the total money Sanders has raised comes from supporters who have contributed the maximum $2,700 that an individual may give to a candidate running in primaries and caucuses.“Our campaign is a strong grassroots movement supported by middle-class Americans from working families, not billionaires trying to buy elections,” said Jeff Weaver, Sanders’ campaign manager. “This campaign is built for the long haul and is drawing millions of new people into the process.”To read the FEC report, click here.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-statement-on-nevada/", "text": "LAS VEGAS – Bernie Sanders on Saturday congratulated Hillary Clinton on her victory in Nevada’s closely-contested caucuses and looked ahead to carrying his campaign for the White House to primaries and caucuses across the country.“I just spoke to Secretary Clinton and congratulated her on her victory here in Nevada. I am very proud of the campaign we ran. Five weeks ago we were 25 points behind and we ended up in a very close election. And we probably will leave Nevada with a solid share of the delegates,” Sanders said.“I am also proud of the fact that we have brought many working people and young people into the political process and believe that we have the wind at our back as we head toward Super Tuesday. I want to thank the people of Nevada for their support that they have given us and the boost that their support will give us as we go forward,” Sanders added.The contest moves next to South Carolina, where Democrats vote on Feb. 27, and then to states across the country.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-accepts-clintons-challenge-on-wall-street-speeches/", "text": "ELKO, Nev. – U.S. Sen. Bernie Sanders’ campaign on Friday urged Hillary Clinton to keep her word and release the transcripts of speeches she gave to Wall Street firms “when everybody else does.”“Sen. Sanders accepts Clinton’s challenge. He will release all of the transcripts of all of his Wall Street speeches. That’s easy. The fact is, there weren’t any. Bernie gave no speeches to Wall Street firms. He wasn’t paid anything while Secretary Clinton made millions, including $675,000 for three paid speeches to Goldman Sachs,” said Sanders’ spokesman Michael Briggs.“So now we hope Secretary Clinton keeps her word and releases the transcripts of her speeches. We hope she agrees that the American people deserve to know what she told Wall Street behind closed doors,” Briggs added.Clinton was paid $21.7 million in fees for speeches to groups including Wall Street firms, big corporations and trade associations for 92 talks she delivered from 2013 through last April in the run-up to formally launching her second presidential bid.A question about what she said in those speeches was raised on Thursday during an MSNBC-Telemundo town hall in Las Vegas. A questioner in the audience asked her about why she won’t release the transcripts. Clinton said she would hand over her speech transcripts if other public officials did the same. “I’m happy to release anything I have when everybody else does the same,” Clinton said. Sanders is “everybody else” in the Democratic presidential field of candidates.During a Feb. 4 Democratic presidential debate, Clinton was asked if she would release the transcripts of all her paid speeches. “I will look into it. I don’t know the status, but I will certainly look into it,” she said at the time.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/clark-county-black-caucus-endorses-bernie-sanders-for-president/", "text": "LAS VEGAS – U.S. Sen. Bernie Sanders’ Nevada campaign on Friday welcomed the endorsement of the Clark County Black Caucus. Clark County is the biggest county in Nevada with over 2 million people, approximately 12 percent of whom are African-American. The group noted Sen. Sanders’ lifelong commitment to civil rights, racial and social justice, ending mass incarceration and addressing economic inequality in the country.“We are proud to endorse Bernie Sanders for president. He has the audacity to speak truth to power and fight for the needs of our community,” said Yvette Williams, Clark County Black Caucus chair. “He understands that when everyone is treated equally, this country thrives.”The Clark County Black Caucus has pioneered several legislative advancements addressing issues that confront the state’s African-American community. The organization serves as a vibrant example of an institution that is able to transcend the partisan gridlock of the Silver State’s political institutions.“We know that Sen. Sanders’ plans will address the institutional racism that plagues our nation and leaves millions of young African-Americans jobless, incarcerated, and hopeless,” said Steve Munford, Clark County Black Caucus executive board member. “Bernie Sanders has stood with our community since the civil rights movement and continues to stand with us today. We will caucus for him and continue working with him to bring about a political revolution.”“We are honored to receive the support of an organization that was created on the heels of one of the most exciting moments in American history—the election of our country’s first African-American president, Barack Obama,” said Joan Kato, Sanders’ Nevada state director. “They are one of Nevada’s most influential advocacy organizations, and we are so proud to have their support.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-odds-in-nevada-looking-up/", "text": "\nLAS VEGAS – Liking his chances here, Bernie Sanders returned to Nevada on Thursday saying that he thinks the outcome of Saturday’s caucuses will be “very close.”Said Sanders: “We’re working very hard to get a large voter turnout and if we do I feel confident we can win.”The first western state contest in the Democratic presidential nominating process comes after Sanders’ victory over Hillary Clinton on Feb. 9 in New Hampshire and a come-from-behind virtual tie with the one-time Democratic Party front-runner on Feb. 1 in Iowa.“Our campaign has the momentum,” Sanders told reporters during a cross-country flight to Las Vegas. “The American people are catching on,” that the “real issues facing this country” are a corrupt campaign finance system, a broken criminal justice system and a rigged economy.“No state more than Nevada understands the impact of Wall Street’s greed and illegal behavior. Thousands of Nevadans lost their jobs, their homes and their life savings,” the U.S. senator saidSanders, who helped lead the effort against the deregulation of Wall Street before the recession, wants to reinstate the 1933 Glass–Steagall Act, which separated commercial and investment banks. He also has called for breaking up the biggest banks on Wall Street that hold a grip on credit cards and home mortgage lending.Unlike Clinton, whose super PAC has collected millions of dollars from Wall Street, Sanders does not have a super PAC and his campaign has been funded by more than 3.7 million individual contributions recently averaging about $27 apiece.Sanders enjoys especially strong support in Nevada and elsewhere among working families and young people, including growing numbers of Latinos and African-Americans. “This is the future of the Democratic Party,” he said.Earlier Thursday, Sanders met in Washington, D.C., with leaders of nine of the nation’s major civil rights organizations. His campaign dismissed attacks by Clinton campaign surrogates on his record. “Clearly, the Clinton campaign, once anointed by the establishment as the inevitable winner of the Democratic nomination, is now getting very nervous and is making increasingly reckless attacks,” said spokesman Michael Briggs.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/i-believe-in-bernie-sanders-because-he-believes-in-us/", "text": "LAS VEGAS – Bernie Sanders’ presidential campaign on Thursday released a powerful new digital ad focused on the Americans hit hardest by the foreclosure crisis.“Having a home means keeping my family together,” Magdaleno Padilla says in Spanish as the spot opens. “For me and my wife, it’s everything because I worked for it.”“We felt secure,” Jessica Kinnaman says. “We had a sense of owning something – having a part of the American dream. Our home meant everything to us. It was our savings. It was our children’s future.”In June of 2010, 65 percent of all homeowners with a mortgage in the state of Nevada owed more than their homes were worth. While the economy is better today than it was during the recession, Nevada still has one of the highest unemployment and foreclosure rates and far too many homeowners are still underwater on their mortgages. Las Vegas has the largest share of underwater homeowners of any major market in the country.“Millions of homeowners losing their property, their marriage gets destroyed, breaking families,” Nynoska Briceño says. “Enough is enough.”“I believe in Bernie Sanders because he believes in us,” Jessica Kinnaman says as the ad closes.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/are-wall-street-donors-managing-clintons-campaign/", "text": "LAS VEGAS – The New York Times reported yesterday that in a meeting held in a large Wall Street investor’s office, big-money donors instructed Secretary Hillary Clinton’s campaign manager Robby Mook to go after Sen. Bernie Sanders for offering so-called “unrealistic proposals” and by claiming that all his solutions are related back to “millionaires and billionaires.”Not surprisingly those are exactly the attacks that the Clinton campaign is now dutifully lobbing.“One of the biggest differences between our campaigns is that Bernie’s campaign does not take its marching orders from Wall Street and big-money donors,” Jeff Weaver, Sanders’ campaign manager, said. “It’s shameful that the Clinton campaign is parroting attacks at Sen. Sanders that The New York Times has documented come right from her big-money backers. Now we are beginning to get a glimpse into what goes on in all those closed door meetings with Wall Street interests.”The mega-donors also asked Mook to highlight the Clinton campaign’s support from small donors. But just 17 percent of her individual contributions last year came from small-dollar donors, compared to 74 percent for Sanders. Nearly 60 percent of her campaign committee’s money came from donors who gave the legal limit to her campaign.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-campaigns-in-south-carolina-criminal-justice-and-civil-rights-tv-ad-set-to-air/", "text": " CHARLESTON, S.C. – U.S. Sen. Bernie Sanders brought his White House campaign back to South Carolina on Tuesday with two morning stops in Columbia and an afternoon town meeting here where he predicted his come-from-behind campaign will surprise pundits when Palmetto State Democrats go to the polls on Feb. 27.“On Election Day, I think folks here in South Carolina are going to wake up the next morning and find a very big surprise,” Sanders said to cheers from supporters at the historic Memminger Auditorium.Earlier Tuesday, Sanders spoke at a prayer breakfast at the historically black Allen University about his proposals on a range of issues from reforming the criminal justice system to creating jobs and raising wages.Speaking to a mostly-student audience at the University of South Carolina, Sanders detailed proposals for tuition-free public colleges and universities. He also detailed plans to rebuild crumbling roads and bridges with a five-year, $1 trillion investment in infrastructure improvements.Sanders was introduced at the university by Erica Garner, whose father died when he was choked to death during an arrest two years by New York City police officers. She called Sanders a “fearless public servant that is not afraid to stand against the establishment for the people.”Erica Garner is featured in a new television ad set to air here in a six-figure ad buy on stations in South Carolina and on national television beginning Wednesday.The campaign day in South Carolina followed Sanders’ 22-point victory one week ago in New Hampshire and a tie in the Feb. 1 Iowa precinct caucuses.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-applauds-minneapolis-fed-presidents-call-to-break-up-too-big-to-fail-banks/", "text": "CHARLESTON, S.C. — U.S. Sen. Bernie Sanders issued the following statement after Minneapolis Federal Reserve Bank President Neel Kashkari, a former Goldman Sachs banker and manager of the government’s Troubled Asset Relief Program, gave a speech calling for “breaking up large banks into smaller, less connected, less important entities”:“I am delighted that the new president of the Minneapolis Federal Reserve believes that we need to break up too big to fail banks.“If a bank is too big to fail, it is too big to exist. When it comes to Wall Street reform that must be our bottom line. The risk of another bailout is too great, and the economic and political power of a handful of huge financial institutions is simply too large.“We need a banking system that is part of the productive economy – making loans at affordable rates to small- and medium-sized businesses so that we can create decent-paying jobs. Wall Street cannot continue to be an island unto itself, gambling trillions in risky financial instruments, making huge profits, assured that, if their schemes fail, the taxpayers will be there to bail them out.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/incredible-turnout-at-rally-in-michigan-sanders-meets-flint-families/", "text": "YPSILANTI, Mich. – Bernie Sanders received a rousing ovation on Monday from a capacity crowd of about 9,400 supporters at Eastern Michigan University’s Convocation Center. “What an incredible turnout,” Sanders said.The Democratic Party presidential candidate laid out detailed proposals to create jobs, make college affordable, reform the country’s criminal justice system and address climate change.He also spoke about the need to repair the nation’s crumbling roads, bridges, railroads and public water systems. He has introduced legislation in the U.S. Senate to invest $1 trillion in infrastructure upgrades.Sanders addressed the rally after a private meeting with families from Flint, Michigan, which is reeling from a public health emergency resulting from lead-tainted tap water.Sanders recently called for the resignation of Michigan Gov. Rick Snyder for the state’s inadequate response to the public health troubles which have been traced to a 2014 decision to switch the source of the city’s tap water supply to the Flint River. After repeated assurances that the water was safe, Flint residents were warned last fall about lead poisoning concerns.Sanders and Erin Brockovich wrote a column in Sunday’s Detroit Free Press which called Flint “a wake-up call” to problems affecting public water supplies nationwide. “The situation in Flint is what happens when public officials who, in their reckless zeal to slash government spending, jeopardize the health and well-being of the residents they are entrusted with keeping safe,” they wrote.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-campaigns-sunday-in-nevada-at-church-and-rally/", "text": "LAS VEGAS – Speaking at a church service and to an overflow crowd at a rally, U.S. Sen. Bernie Sanders on Sunday brought his White House campaign back to Nevada where next Saturday’s precinct caucuses are the next milestone in the contest for the Democratic Party presidential nomination.At Bonanza High School, Sanders spoke into a bullhorn to some 300 people outside before taking the stage in a gymnasium filled to capacity with 1,700 supporters.The rally was held after Sanders and Hillary Clinton attended Sunday service at the Victory Missionary Baptist Church. The Rev. Robert E. Fowler Sr. welcomed both presidential candidates to his church. “I’m excited that they are here and I am encouraged that they are willing to sit at the same church, at the same service, at the same time,” the pastor said.“Some of us believe that what God teaches us and what this world is about is that we do not turn our backs on our brothers and our sisters, that essentially we are in this together.” Sanders said. “I have four beautiful kids and seven grandchildren. I want you to worry about my kids and I have got to worry about your children and your grandchildren. That’s what this church is about and that’s what our existence is about.” Sanders campaigned in Las Vegas one week before Nevada’s caucuses with the political winds at his back after a 22-point landslide win last Tuesday in New Hampshire built on a come-from-way-behind tie in the Feb. 1 Iowa caucuses.“The Sanders surge is real,” Nevada political analyst John Ralston wrote in the Reno Gazette-Journal. “The enthusiasm is as real here as it is anywhere, judging from his rallies and from what I hear from folks in the field. And momentum in politics is very difficult to blunt, much less turn around.”Earlier Sunday in Denver, Colorado, Sanders told CBS News’ “Face the Nation” that the latest sign the Clinton campaign is getting nervous was a report that a super PAC supporting the former secretary of state plans to spend half a million dollars on television ads in South Carolina. Clinton had previously claimed that the Wall Street-bankrolled super PAC Priorities USA would hold its financial power until the general election campaign against Republicans.“You can get a sense of the nervousness within the Clinton campaign by seeing that they are now using their super PAC money, funded largely by Wall Street, against me,” Sanders said. “So I think they understand that in this campaign we have the momentum.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/clintons-super-pac-spending-proves-sanders-momentum/", "text": "       <img class=\"lazyload\" data-srcset=\"https://berniesanders.com/wp-content/uploads/2016/02/Screen-Shot-2016-02-14-at-1.05.36-PM.png\" alt=\"\">\nDENVER — Bernie Sanders on Sunday said that spending by a super PAC supporting Hillary Clinton shows his campaign is gaining ground against the former secretary of state.“You can get a sense of the nervousness within the Clinton campaign by seeing that they are now using their super PAC money, funded largely by Wall Street, against me,” Sanders told CBS’ John Dickerson during an appearance on Face the Nation. “So I think they understand that in this campaign we have the momentum.”Hillary Clinton’s super PAC, Priorities USA Action, will reportedly spend at least half a million dollars in paid advertising in the South Carolina Democratic primary, which is the first time one of the pro-Clinton super PACs has purchased paid broadcast advertising. In the most recent filing period, Priorities USA Action reported that it received $15 million in donations from financial industry interests.But the Priorities USA Action spending goes against what Secretary Clinton told PBS’ Judy Woodruff in October of last year. “I’ve said I want anybody supporting me to go after Republicans because whatever differences we might have on the Democratic side, they pale in comparison to the really substantive differences we have with the Republicans,” she said at the time. “So whoever is supporting me — individuals, super PACs, whomever — I want them to be focused on Republicans. That’s where the real political difference is.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/huge-turnout-in-denver/", "text": "​\n.photoRight{margin:25px 0!important;}@media (min-width: 800px) {.photoRight{margin:25px 0 25px 3%!important;float:right!important;width:45%!important;}.pre-fold-text{width:50%!important;float:left!important;}}\nDENVER – More than 18,000 stoked Bernie Sanders supporters crowded into the Colorado Convention Center on Saturday to rally for the Democratic Party presidential candidate fresh off a big win in New Hampshire and a photo-finish in Iowa.“This looks to me like a group of people who are prepared to make a political revolution,” Sanders told the cheering throng surrounding him in the cavernous convention hall and in overflow areas outside.Sanders took his campaign here after a remarkable come-from-behind finish on Feb. 1 in Iowa, where he and Hillary Clinton fought to a draw in precinct caucuses, and days after Sanders racked up a 22-point landslide victory last Tuesday in New Hampshire.“A lot has happened in nine months. We started off in Iowa 40 or 50 points behind. The results ended up a little different than that. We started out in New Hampshire 30 points down. The results came out a little different than that. We started out way behind in Nevada and South Carolina. We have a real shot at winning both of those states,” Sanders said. “And here in Colorado, with your enthusiasm, on March 1 we are going to win.”Colorado Democrats will hold precinct caucuses on Super Tuesday in the first step of a process for nominating candidates and selecting delegates to this summer’s Democratic National Convention in Philadelphia.In a stirring speech fueled by the excited crowd, Sanders spoke about ending a corrupt campaign finance system that props up a rigged economy. He also said no president could take on those forces without a grassroots uprising that would upend Washington.“The powers that run this country – corporate America, Wall Street, large campaign donors – are so powerful that no candidate alone can bring about the transformation that working families and the middle class need,” Sanders said. “What we are saying is that millions of people have to stand up, have to fight back and make it clear that the government of the United States belongs to all of us …” he said as cheers of “Bernie, Bernie, Bernie” drowned him out.The rally preceded a dinner hosted by Colorado Democrats featuring Sanders and Hillary Clinton.\nWatch the video:\n", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/statement-on-justice-scalia/", "text": "DENVER – U.S. Sen. Bernie Sanders issued the following statement on Saturday on the passing of U.S. Supreme Court Justice Antonin Scalia:“While I differed with Justice Scalia’s views and jurisprudence, he was a brilliant, colorful and outspoken member of the Supreme Court. My thoughts and prayers are with his family and his colleagues on the court who mourn his passing.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/flashback-sanders-endorses-jesse-jackson-for-president-in-88/", "text": "RENO, Nev. — Bernie Sanders’ presidential campaign released a new video today featuring the then-mayor of Burlington endorsing Rev. Jesse Jackson for president in 1988.“Tonight many of us are going to give our support to a candidate for president who has done more than any other candidate in living memory to bring together the disenfranchised, the hungry, the poor, the workers who are being thrown out of their decent-paying jobs and the farmers who are being thrown off of their land,” Sanders said as he began his speech in support of Jackson.Jackson would go on to win the Vermont caucuses in 1988, one of the more than 10 nominating contests he won that year. Sanders also endorsed Jackson in 1984.“Ladies and gentlemen, I would like to place for nomination this evening the name of one of the great leaders of our time and a man who has waged the most courageous and exciting political campaigns in the modern history of this nation,” Sanders said at the conclusion of his nominating speech. “I place for nomination, with a great deal of personal pride, the name of Jesse Jackson.”To see a flyer written by Sanders in support of Jackson, click here.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/wheels-of-inevitability/", "text": "COLUMBIA, S.C. — Bernie Sanders’ presidential campaign on Saturday released a new television ad that will play in South Carolina ahead of the first-in-the-South primary.“There is no president who will fight harder to end institutional racism,” Sanders says in the spot, which opens with a famous quotation from the Rev. Martin Luther King Jr. “Change does not roll in on the wheels of inevitability, but comes through continuous struggle.”Then the narrator recites examples of Sanders’ long record on civil rights. “He was there when Dr. King marched on Washington,” the narrator says of Sanders. “Unafraid to challenge the status quo to end racial profiling, take on police misconduct and take down a system that profits from mass imprisonment.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/clinton-wall-street-funded-super-pac-enters-democratic-primary-against-sanders/", "text": "MINNEAPOLIS — As reported in the Washington Post today, Hillary Clinton’s super PAC, Priorities USA Action, will be spending at least half a million dollars in paid advertising in the South Carolina Democratic primary. In the latest reporting period, Priorities USA Action reported that it received $15 million in donations (equating to 60 percent of all donations) from financial industry interests.This represents the first time one of the pro-Clinton super PACs has purchased paid broadcast advertising.The super PAC previously said it would only deploy its millions for the general election against Republicans.Sanders campaign manager Jeff Weaver said, “It is truly unfortunate that the largest pro-Clinton super PAC has decided to infect the democratic primary process with its haul of Wall Street cash. Democratic voters expect more. Doesn’t the Clinton campaign have the funds to run its own ads without resorting to its super PAC, which is funded by the very people Secretary Clinton has promised to take on?”On Tuesday, Senator Sanders won the New Hampshire primary by over 20 points. His campaign is funded by over 3.5 million individual contributions averaging about $27 each.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-campaign-statement-on-clintons-immigration-comments/", "text": "LAS VEGAS — Bernie Sanders’ National Latino Outreach Director Arturo Carmona on Friday issued the following statement on Secretary Hillary Clinton’s comments on unaccompanied minors at last night’s Democratic debate:“Secretary Clinton is wrong. We should never put children back into harm’s way to ‘send a message’ to anyone. That’s why Sen. Sanders has put forward a serious immigration plan that focuses on protecting kids and keeping families together. It is time for Secretary Clinton to do the same.“Sen. Sanders believes we must end inhumane deportations and strongly opposes the summary expulsion of Central American immigrant children. He will expand access to health care for aspiring Americans and will strengthen the rights of immigrant workers. He’s the best choice for Democrats who believe our immigration policies must put families first.”To read Sen. Sanders’ immigration plan, click here.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/civil-rights-activist-erica-garner-thats-why-im-for-bernie/", "text": "MILWAUKEE — Bernie Sanders’ presidential campaign on Thursday released a powerful video featuring civil rights activist Erica Garner, the eldest daughter of Eric Garner who died in 2014 during his arrest by New York City police.In the video, Erica discusses the impact of her father’s death on her family. “I’m just trying to get the truth out there to tell his side of the story,” Garner says. “He was being the loving, caring man that he was and he was murdered.”Eric Garner died on July 17, 2014, after a police officer put him in a chokehold outside of a convenience store on Staten Island.“I feel like a representative for people throughout this whole nation because I’m doing this — I’m speaking out,” Erica says of her work after her father’s death. “I’m never giving up. I’m never going to forget and I don’t want the world to forget what happened to my dad.”“I’m behind anyone who’s going to listen and speak up for us, and I think we need to believe in a leader like Bernie Sanders,” Garner says. “That’s why I’m for Bernie.”To read Erica’s opinion piece in The Washington Post endorsing Sanders, click here.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-breaks-fundraising-records-historic-win/", "text": "NEW YORK — Bernie Sanders’ presidential campaign on Wednesday announced a record-breaking fundraising period following his landslide victory in the New Hampshire primary.“I’m going to hold a fundraiser right here, right now, across America,” Sanders told the crowd gathered at his victory speech in Concord last night. “My request is please go to BernieSanders.com and contribute. Please help us raise the funds we need, whether it’s $10 bucks, $20 bucks, or $50 bucks. Help up us raise the money we need to take the fight to Nevada, South Carolina, and the states on Super Tuesday.”In the 18 hours since the polls closed in the Granite State, his campaign has raised more than $5.2 million, shattering the campaign’s previous record for money raised in less than a day. The average donation since Sanders’ speech is $34.With nearly all precincts in New Hampshire reporting, Sanders holds a 22-point advantage over Clinton, one of the largest margins of victory in the history of the first-in-the-nation primary.Watch the clip:\n", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-wins-big-in-new-hampshire-presidential-primary/", "text": "CONCORD, N.H. – Bernie Sanders won Tuesday’s New Hampshire Democratic Party presidential primary in a double-digit landslide over Hillary Clinton.“Together, we have sent a message that will echo from Wall Street to Washington and from Maine to California that the government of this great nation belongs to all of the people and not just a handful of wealthy campaign contributors and their super PACs,” Sanders told supporters crowded into a high school gymnasium.Sanders’ big victory in the first state to hold a presidential primary defied pundits’ predictions last summer of a Clinton coronation. “Nine months ago, we began our campaign here in the Granite State,” Sanders said. “We had no campaign organization and we had no money. And we were taking on the most powerful political organization in the United States of America, a team that defeated Barack Obama here in the Democratic primary in 2008.“And tonight, through a record-breaking voter turnout, we won because we harnessed the energy and the excitement that the Democratic Party will need to succeed in November.”The New Hampshire primary results came eight days after another come-from-behind finish for Sanders in precinct caucuses in Iowa, where the one-time distant underdog fought Clinton to a virtual tie.“Tonight,” Sanders said at Concord High School, “we served notice to the political and economic establishment of this country that the American people will not continue to accept a corrupt campaign finance system that is undermining American democracy and a rigged economy in which ordinary Americans work longer hours for lower wages while almost all new income and wealth goes to the top 1 percent.”Before speaking to supporters, Sanders and his wife, Jane, watched the returns on television sets set up in the corners of a school gymnasium. While he was waiting to deliver his speech, the senator also played basketball with his children and grandchildren.Watch the speech:\n", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-campaign-statement-on-clinton-falsehoods/", "text": "MANCHESTER, N.H. – Bernie Sanders’ campaign manager, Jeff Weaver, issued the following statement in response to false claims by the Clinton campaign:“It is very disturbing that, as the Clinton campaign struggles through Iowa and New Hampshire, they have become increasingly negative and dishonest. No, Bernie Sanders will not dismantle health care programs in America. He believes in health care for all. No, Bernie Sanders is not ‘attacking’ Planned Parenthood. He believes Planned Parenthood is an outstanding organization and wants to increase its funding. No, Bernie Sanders is not ‘protecting’ the gun lobby. He has a D- record from the NRA.“Today’s attack from Secretary Clinton, whose super PAC received $15 million from Wall Street, is even more absurd. Bernie Sanders, who has never accepted corporate PAC money in his life, is now accused by Secretary Clinton of taking ‘about $200,000 from Wall Street firms.’ How do they reach that false and absurd conclusion? They assume that every nickel Bernie Sanders received from the Democratic Senatorial Campaign Committee for his Senate campaign came from Wall Street. That is obviously preposterous.“Bernie appreciates the help he has gotten from the DSCC, whose funds come from millions of Americans’ individual contributions, labor organizations, environmental groups, women’s organizations and others. To say that every nickel that Bernie received came from Wall Street is beyond preposterous. It is laughable and suggests the kind of disarray that the Clinton campaign finds itself in today.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/1220-rally-for-a-political-revolution-in-portsmouth/", "text": "PORTSMOUTH, N.H. – U.S. Sen. Bernie Sanders on Sunday brought his presidential campaign to a college gymnasium here where more than 1,200 loud and boisterous supporters cheered his rallying cry for a political revolution.Sanders said a growing grassroots movement in New Hampshire and across the United States is taking on Wall Street, corporate America and the corporate media. “Our most important task is to revitalize American democracy,” Sanders said at the Great Bay Community College, “and when we do that we change America.”Speaking from a podium surrounded by the crowd, Sanders delivered a succinct message. “You are dealing with a corrupt campaign finance system which is enabling billionaires to buy elections,” he said. “You are dealing with a rigged economy in which people are working longer hours for lower wages and almost all of the income goes to the top 1 percent.”Sanders detailed a list of proposals which include closing tax loopholes exploited by profitable corporations and wealthy individuals to finance a massive program to rebuild crumbling roads and bridges. He said he would enact a tax on Wall Street speculators to pay for tuition-free public colleges and universities.He called for pay equity for women, raising the minimum wage to $15 an hour by 2020, moving to a Medicare-for-all health care system and strengthening Social Security. He outlined bold steps to combat climate change. He advocated reforms in the criminal justice system and spoke out for immigration reform.On foreign policy, Sanders said he had been “lectured” by critics in recent days about his relative experience compared to the former secretary of state. He drew perhaps the loudest applause of the day when he cited his vote against invading Iraq. “I was right and Hillary Clinton was wrong,” he said to cheers.In the final days on the campaign trail before Tuesday’s first-in-the-nation presidential primary, Sanders noted that he had climbed from far behind in New Hampshire polls last spring and is now ahead of Clinton in the state where she defeated then Illinois Sen. Barack Obama in 2008.He had stressed in an interview earlier Sunday on WMUR-TV in Manchester, New Hampshire, that he believes the results on Election Day will be tight. “We think it’s going to be a close election, we’re working really hard,” Sanders told Jake Tapper in an interview broadcast Sunday on CNN’s “State of the Union.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-statement-on-detrimental-effect-flint-humanitarian-crisis-is-having-on-aspiring-americans/", "text": "MANCHESTER, N.H. – U.S. Sen. Bernie Sanders on Saturday released the following statement after it was reported that undocumented immigrants in Flint cannot obtain clean water because of their immigration status:“It is outrageous and totally unacceptable that aspiring Americans and others in Flint cannot get the clean drinking water they desperately need because they don’t have the proper identification. This is a humanitarian crisis. No one should live in fear of being deported for getting a bottle of water for their family. All people, including immigrants, should have access to clean and drinkable water, regardless of immigration status or lack of identification.“The state of Michigan and the National Guard should provide all emergency services to the approximately 1,000 aspiring Americans that reside in Flint and provide comprehensive bilingual information on the dangers of drinking this poisonous water.“The federal government must also halt all immigration raids immediately. These inhumane raids are having a chilling effect across the country, especially in Flint, preventing some of the most vulnerable people in this country from stepping out of their homes, let alone seeking clean water for their families.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-statement-on-clinton-and-social-security/", "text": "MANCHESTER, N.H. – Bernie Sanders on Friday welcomed Hillary Clinton’s assertion that she supports expanding Social Security, but pressed her to clarify her new stand.“We’re glad that, for the first time, Secretary Clinton has indicated that she will join me in expanding Social Security benefits,” Sanders said. “But we need more clarity,” he added.“Is she prepared to scrap the cap on payroll taxes? Is she prepared to support legislation that I have offered that would both expand Social Security benefits and extend the solvency of Social Security for the next 58 years as a result of lifting the cap on taxable income on people who earn more than $250,000 a year? I hope so but we’re still not sure,” Sanders said.Sanders asked Clinton to plainly say that she supports making the wealthy pay their fair share into the retirement program. He also called on her to explicitly oppose cutting benefits by raising the retirement age.As recently as Oct. 28, Clinton had left open the possibility that she would support raising the retirement age at which seniors become eligible for Social Security. “I would consider it,” she told a town meeting in New Hampshire.Back in April of 2008, Clinton falsely claimed that Obama’s plan to scrap the cap would increase taxes on the middle class. “I’m certainly against one of Senator Obama’s ideas, which is to lift the cap on the payroll tax, because that would impose additional taxes on people who are educators, police officers, firefighters and the like.”FactCheck.org ruled that Clinton’s claim was false. “Clinton exaggerated when she said that lifting the cap on wages that are subject to the Social Security tax ‘would impose additional taxes on people who are, you know, educators here in the Philadelphia area or in the suburbs, police officers, firefighters and the like.’ In fact, only individuals earning more than $102,000 a year would be affected, and few cops or teachers earn that much.”In a Friday night tweet, Clinton asserted, “I won’t cut Social Security. As always, I’ll defend it, I’ll expand it.” Her statement came hours after Sanders, during a speech in Exeter, New Hampshire, urged Clinton to “join me in saying it is imperative to increase and expand benefits for seniors on Social Security by lifting the cap on taxable income.”Sanders has introduced legislation to make the wealthiest Americans who make more than $250,000 a year pay the same share of their income into the retirement system as everyone else. Current law now caps the amount of income subject to payroll taxes at $118,500.Under Sanders’ plan, a senior making less than $16,000 a year would see income go up by more than $1,300 a year.The proposal to lift the cap would raise taxes only on the wealthiest 1.5 percent of Americans. Sanders’ plan is similar to a proposal to scrap the cap first brought forward by President Barack Obama in 2008.According to new estimates from the Social Security Administration, the Sanders plan would extend the solvency of Social Security until the year 2074.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/former-naacp-president-and-ceo-ben-jealous-endorses-sanders/", "text": "MANCHESTER, N.H. – U.S. Sen. Bernie Sanders Friday picked up the endorsement of former NAACP President and CEO Ben Jealous.“Bernie Sanders has been principled, courageous and consistent in fighting the evils that Dr. King referred to as the ‘giant triplets’ of racism, militarism and greed,” Jealous said. “Bernie Sanders has the courage to confront the institutionalized bias that stains our nation. Bernie Sanders is the type of leader we can trust to fight for the future of all our nation’s children as if they were his very own. It is for all these reasons that I am proud to endorse Bernie Sanders for president of these United States.”Jealous was the youngest-ever president of the century-old NAACP, serving from 2008 to 2013. He’s credited with leading the storied civil rights group back to prominence.“I think the proposals that we have brought forth in this campaign are proposals that will go a very, very long way to improving the lives of people of color in this nation,” Sanders said. The senator cited raising the minimum wage, ensuring pay equity for women, creating millions of decent paying jobs, Medicare for all and tuition-free public colleges and universities among the plans he’s put forward that would directly impact communities of color.Jealous will travel to South Carolina on Saturday for a series of campaign stops and events throughout the Palmetto State.To hear a recording of the conference call, click here.\nTo read Ben Jealous’ prepared remarks, click here.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-statement-on-new-flint-revelations/", "text": "EXETER, N.H. — U.S. Sen. Bernie Sanders issued the following statement on Friday after it was reported that Michigan Gov. Rick Snyder’s administration knew a recent outbreak of Legionnaires’ disease was potentially connected to the water crisis in Flint:“The latest revelation about the public health crisis in Flint is horrifying. It is unacceptable that anyone on Gov. Snyder’s team would not act swiftly at even the slightest chance that residents were becoming seriously ill from the drinking water in Flint. Because of the conduct by Gov. Snyder’s administration and his refusal to take responsibility, families will suffer from lead poisoning for the rest of their lives. Children in Flint will be plagued with brain damage and other health problems.“Not only should Gov. Snyder resign immediately, the Justice Department must hold everyone accountable who knew about this crisis and did nothing. The federal government needs to take every possible measure to ensure that the people of Flint get clean drinking water as soon as possible.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-challenges-clinton-on-social-security-new-national-poll-shows-contest-tightening/", "text": "EXETER, N.H. – On a postcard-perfect snowy Friday in New Hampshire, Bernie Sanders brought his presidential campaign to a historic town hall here and challenged Hillary Clinton to back a plan to strengthen Social Security and to reject any cuts to Social Security.Sanders also urged Clinton to “join me in saying it is imperative to increase and expand benefits for seniors on Social Security by lifting the cap on taxable income and to make it clear to the American people that Social Security benefits must not be cut.”Clinton has left open the possibility that she would support raising the retirement age at which seniors become eligible for Social Security. “I would consider it,” she told a town meeting in New Hampshire last Oct. 28.Sanders has introduced legislation to make the wealthiest Americans who make more than $250,000 a year pay the same share of their income into the retirement system as everyone else. Current law now caps the amount of income subject to payroll taxes at $118,500.Under Sanders’ plan, a senior making less than $16,000 a year would see income go up by more than $1,300 a year.The measure also would increase cost-of-living adjustments. This year, for only the third time in four decades, seniors on Social Security did not receive a cost-of-living increase. Sanders’ legislation would increase COLAs by accurately measuring the spending patterns of seniors. Under current law, the consumer price index used to calculate annual benefit adjustments does not accurately reflect how inflation in health care costs and prescription drug prices impact seniors.The proposal to lift the cap would raise taxes only on the wealthiest 1.5 percent of Americans. Sanders’ plan is patterned after a proposal to scrap the cap first brought forward by President Barack Obama in 2008.According to new estimates from the Social Security Administration, the Sanders plan would extend the solvency of Social Security until the year 2074.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-vows-to-reject-job-killing-trade-deal/", "text": "CONCORD, N.H. – As the Trans-Pacific Partnership trade pact was signed by the United States and 11 other countries, Bernie Sanders promised to “fundamentally rewrite our trade policies to benefit working families, not just the CEOs of large, multinational corporations.”Sanders has opposed the Pacific trade deal, the North American Free Trade Agreement and permanent normal trade relations with China since day one. The North American Free Trade Agreement led to the loss of 700,000 jobs. The trade deal with China led to the loss of 3.2 million jobs. And since 2001, nearly 60,000 manufacturing plants have been shut down and 4.7 million jobs have been lost.“Trade is a good thing. But trade has got to be fair. And the TPP is anything but fair,” Sanders said.In addition to shipping thousands of jobs overseas, the Trans-Pacific Partnership would increase already skyrocketing drug prices and threaten American laws that protect the environment, workers and consumers.“As your president, not only will I make sure that the TPP does not get implemented, I will not send any trade deal to Congress that will make it easier for corporations to outsource American jobs overseas,” Sanders said.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-campaign-statement-on-clinton-campaigns-new-hampshire-insults/", "text": "MANCHESTER, N.H. — Bernie Sanders’ New Hampshire State Director Julia Barnes issued the following statement Wednesday after the Clinton campaign suggested that Granite Staters were only supporting Sanders because he’s from neighboring Vermont:“The people of New Hampshire are serious about their role in the nominating process. I know that because our organizers are talking to voters every single day about the issues that matter to them. Whether it’s equal pay, more secure retirement or affordable health care, the people of New Hampshire will go to the polls Tuesday and vote for the candidate they believe will fight for them. To repeatedly suggest otherwise is an insult to voters in the Granite State.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/hillary-clinton-to-new-york-city-no/", "text": "KEENE, N.H. — Jeff Weaver, Bernie Sanders’ campaign manager, issued the following statement Tuesday after Secretary Hillary Clinton refused to participate in a proposed debate in New York City:“We are incredibly disappointed that Secretary Clinton refuses to do a debate in New York City. Why does the Clinton campaign object to a debate in New York City? Wasn’t Secretary Clinton the senator from New York? Why is her campaign dissing the Big Apple?”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/small-donors-fuel-sanders-campaign-clinton-bankrolled-wealthy/", "text": "​\nKEENE, N.H. – Bernie Sanders’ presidential campaign is funded by small donors who gave an average of about $29 each in the past year while Hillary Clinton has relied on the wealthy to bankroll her presidential bid, new financial disclosure reports reveal.The latest round of campaign finance reports filed over the weekend with the Federal Election Commission show the stark differences between the two campaigns.In perhaps the major contrast, the disclosure forms show that only 649 of Sanders’ more than 1.3 million backers have donated the $2,700 maximum that an individual may give to a candidate to help fund campaigns in primary elections and caucus states. Only 2.3 percent of Sanders’ total money raised comes from maxed-out donors. With far fewer total donors, Clinton has tapped out more than 23,000 of her donors who have given to her campaign committee all that the law allows for the primary election and may donate no more. Her maxed-out donors provided nearly 60 percent of the primary money raised for her campaign committee.Another way to gauge support is to examine donations of $200 or more, the legal threshold for which donations must be itemized in FEC reports. In Clinton’s case, 83 percent of her money came from donors who gave more than $200. In contrast, only 26 percent of the money raised for Sanders came from donors above the $200 threshold.Tallying contributions from small donors is another yardstick that campaign finance analysts examine. Sanders reported more than $23.4 million in fourth quarter donations of less than $200. That’s out of a total $33.6 million raised in the last quarter of the year. Despite an aggressive online campaign designed to jack up the number of her small donors, Clinton’s total take for her campaign committee in the last three months of 2015 in un-itemized donations totaled only $5.7 million of her more than $38 million total haul for the quarter.Sanders’ small-dollar donors continue to be the financial backbone of his campaign. Last month alone, nearly $21 million was donated to him. The money came in the form of 812,012 separate contributions averaging only $26 apiece. That brought the total number of donations since Sanders launched his campaign last April 30 to more than 3.3 million, a record for any presidential candidate at that point in a campaign.Clinton has been criticized for her heavy reliance on donations from Wall Street and other special interests. For example, she left the campaign trail in Iowa one day last week to hold a fundraiser in Philadelphia sponsored by leading executives of a large investment firm. And The Wall Street Journal reported on Monday that the super PAC backing Clinton amassed $15 million of the $25 million it raised in the second half of last year from Wall Street sources.To read Sanders’ FEC report, click here.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-and-clinton-fight-to-draw-in-iowa/", "text": "DES MOINES, Iowa – In a come-from-behind campaign for the history books, Bernie Sanders on Monday fought to a virtual draw with Hillary Clinton in Iowa’s precinct caucuses.“Nine months ago we had no political organization, we had no money, we had no name recognition and we were taking on the most powerful political organization in the country,” Sanders said. “Tonight, while the results are still not known, it looks like we are in a virtual tie,” he added. “It looks like we’ll have about half of the Iowa delegates.”Sanders was headed overnight to New Hampshire, where polls published on Sunday put the U.S. senator from Vermont up by 20 points or more over the former secretary of state.The Iowa caucuses came nine months after he launched his White House campaign as a 41-point underdog in Iowa to Clinton, who had been all but coronated by pundits and the party establishment.Earlier Monday, Sanders thanked volunteers at his Iowa campaign headquarters. “This is a national campaign. We are in this to win at the convention. We’re taking this all of the way,” he told reporters gathered outside a red-white-and-blue campaign bus that he used to travel across the Hawkeye State.Sanders message combined exhortations about the country’s corrupt campaign finance system and rigged economy. “I’m very proud to tell you that we are the only candidate on the Democratic side without a super PAC,” he said.Sanders credited his success in Iowa to some 15,000 volunteers who helped bring out young people, working-class supporters and disaffected voters who were drawn to his campaign in large numbers and defied pundits’ predictions that they would not turn out at the caucuses.Sanders’ message combined exhortations about the country’s rigged economy propped up by a corrupt campaign finance system and a long list of detailed policy proposals.He called for universal health care and tuition-free public colleges and universities. He wants to break up big Wall Street banks, put millions of Americans to work rebuilding crumbling roads and bridges and strengthen Social Security. He wants to implement a fair and humane immigration policy that will bring millions of aspiring Americans out of the shadows and keep families together. He opposes trade deals that have shuttered factories and thrown millions of Americans out of work. He has the boldest plan to combat the planetary crisis of climate change. He vowed to protect a woman’s right to choose and ensure equal pay for equal work. And he detailed a comprehensive criminal justice reform package as part of a plan to combat institutional racism.Watch the speech:\n", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-to-visit-new-hampshire-feb2/", "text": "​\n.photoRight{margin:25px 0!important;}@media (min-width: 800px) {.photoRight{margin:25px 0 25px 3%!important;float:right!important;width:45%!important;}.pre-fold-text{width:50%!important;float:left!important;}}\n​\nMANCHESTER, N.H. – U.S. Sen. Bernie Sanders returns to New Hampshire on Tuesday for one week of campaigning before the first-in-the-nation primary. The Democratic Party presidential candidate will rally supporters and urge them to vote by discussing his plans to take on a rigged economy held in place by a corrupt campaign finance system.Here is the itinerary:Tuesday, February 2\n3 p.m. Get Out the Vote Rally, The Colonial Theater, 95 Main Street, Keene\nInformation for the public: Doors open at 2 p.m. This event is free and open to the public, but RSVPs are strongly encouraged.\n6 p.m. Get Out the Vote Rally, Claremont Opera House, 58 Opera House Square, Claremont\nInformation for the public: Doors open at 5 p.m. This event is free and open to the public, but RSVPs are strongly encouraged.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-campaign-raises-20-million-in-january-fec-report-showcases-small-dollar-fundraising-power/", "text": "​\nCEDAR RAPIDS, Iowa – More than $20 million – almost all from online contributions averaging about $27 apiece – was donated to Bernie Sanders’ presidential campaign in January during the run-up to Monday’s Iowa caucuses.In another powerful demonstration of Sanders’ growing grassroots backing, the more than 770,000 individual contributions in January pushed the total number of donations for his entire campaign past the 3.25 million mark. That’s a record at this point in the campaign for any White House candidate.Unlike other campaigns which rely heavily on wealthy donors who give the maximum allowed by law, more than 99.9 percent of Sanders’ donors can give again. In sharp contrast, Federal Election Commission reports indicate that more than 3 in 5 dollars given to Hillary Clinton come from donors who already have given her the maximum allowed by law.“The numbers we’ve seen since Jan. 1 put our campaign on pace to beat Secretary Clinton’s goal of $50 million in the first quarter of 2016,” said Jeff Weaver, Sanders’ campaign manager. “Working Americans chipping in a few dollars each month are not only challenging but beating the greatest fundraising machine ever assembled.”While the Sanders campaign is supported by millions of small-dollar contributions, Clinton left the campaign trail in Iowa one day last week to hold a fundraiser in Philadelphia sponsored by leading executives of a large investment firm. It’s not yet known how much she added at that event to her reported $17 million in campaign contributions over the years from Wall Street and financial services interests.Sanders also has refused to coordinate with a super PAC which Clinton and other candidates have used to take unlimited contributions from millionaires and billionaires. For example, Priorities USA Action, a super PAC backing Clinton, claimed on Friday to have nearly $45 million cash on hand. Donors have pledged at least $42 million in additional contributions that would give her a bigger super PAC war chest than any Democratic fund ever before.“As Secretary Clinton holds high-dollar fundraisers with the nation’s financial elite, our supporters have stepped up in a way that allows Bernie to spend the critical days before the caucuses talking to Iowans about his plans to fix a rigged economy and end a corrupt system of campaign finance,” Weaver said. “Bernie’s campaign is built for the long haul and we look forward to bringing his message to voters all across the nation, and to drawing millions of new people into the Democratic Party primary process,” he added.Sanders’ campaign on Sunday will file a year-end Federal Election Commission report showing that almost $33.6 million was raised in the fourth quarter of 2015. Seventy percent came from contributors giving $200 or less. Only 1.3 percent of the campaign’s fourth quarter donations came from maxed-out contributors.While the Clinton campaign has not released information about the breakdown of its campaign contributions, its most recent report indicated that only 17.4 percent of the money raised came from small-dollar, un-itemized contributions. Her third quarter report indicated that about 60 percent of her money came from donors who already have contributed the maximum allowed by law and may not give again to her primary campaign.To read the report, click here.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/bernie-rocks-iowa-city/", "text": "IOWA CITY, Iowa – A blast-the-rafters concert and rally for nearly 5,000 fired-up Bernie Sanders backers capped a day of campaigning across Iowa on Saturday with just 48 hours to go before Iowa’s first-in-the-nation precinct caucuses kick off the process of picking a Democratic Party presidential nominee.The concert – Sanders biggest crowd ever in Iowa – featured Vampire Weekend, Foster the People and other musical acts. Before, Sanders spoke to the University of Iowa audience about income and wealth inequality, the planetary crisis of global warming, making public colleges and universities tuition-free and other issues.A new poll released on Saturday by The Des Moines Register and Bloomberg Politics showed Sanders’ come-from-nowhere candidacy had turned into a too-close-to call contest with Hillary Clinton, once the pundits’ presumptive nominee. The poll showed Clinton and Sanders in a virtual tie, a far cry from her 41-point lead when Sanders began his campaign eight months ago.Earlier Saturday, Sanders said his record was being distorted by Clinton’s campaign. Speaking to a group of supporters in Charles City, Iowa, Sanders said he was disappointed in “a lot of inaccurate statements regarding what I believe.”“The new poll results reflect the remarkable grassroots excitement and energy that are the driving force behind Bernie’s campaign to fix a rigged economy and the corrupt campaign finance system that props it up,” said Robert Becker, Sanders’ Iowa campaign state director.A Clinton television ad insinuated, for example, that Sanders somehow had attacked Planned Parenthood when, in fact, he has a “100 percent lifetime voting record for Planned Parenthood.” He also said Clinton had tried to falsely brand him as a friend of the National Rifle Association when, in fact, he has a D-minus grade from the NRA. “So don’t tell me that I’m defending or protecting the gun lobby,” he said.“Those are inaccuracies, and we can do better than that. Secretary Clinton and I have differences of opinion. Let’s debate those differences of opinion, but let’s not go around distorting a record that I am very proud of.”Watch Sen. Sanders sing along to “This Land is Your Land”:\n", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-has-momentum-in-iowa-new-registerbloomberg-poll-shows/", "text": "DES MOINES, Iowa – Bernie Sanders and Hillary Clinton are locked in a tight contest going into Monday’s Iowa precinct caucuses according to a new poll by The Des Moines Register and Bloomberg Politics showing her with a narrow 3-point edge within the survey’s 4 percent margin of error.When caucus-goers were asked who cares about them most, 51 percent say Sanders. “Bernie Sanders has very successfully positioned himself as the guy who is going to go to bat for you,” said Ann Selzer, who conducted the survey.“Our campaign has come a very long way in eight months. In late May, according to the Register/Bloomberg poll, we were down by 41 points. Today we are virtually tied. The momentum is with us,” said Jeff Weaver, Sanders’ campaign manager.“Turnout will be the key to Bernie’s success on caucus night. From now until Monday night we will be working as hard as possible to knock on as many doors and call as many Bernie supporters as possible,” said Pete D’Alessandro, Sanders’ top Iowa strategist.“The new poll results reflect the remarkable grassroots excitement and energy that are the driving force behind Bernie’s campaign to fix a rigged economy and the corrupt campaign finance system that props it up,” said Robert Becker, Sanders’ Iowa campaign state director.The latest findings are a remarkable contrast to the same poll’s results eight months ago when Sanders launched his campaign. Clinton then held a commanding 41-point lead.When the campaign began, 41 percent of Iowans could not identify Sanders. Today, he enjoys an 82 percent approval rating among Iowa Democrats.", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-campaign-statement-on-debates/", "text": "DES MOINES, Iowa – Bernie Sanders’ campaign manager, Jeff Weaver, issued the following statement Saturday on negotiations over additional debates:“After refusing for months to participate in more debates, Secretary Clinton requested that the Democratic National Committee rules be changed and that a new debate take place in New Hampshire next week. We agreed pending an agreement on three future debates in March, April and May. Unfortunately, the Clinton campaign has not accepted debates we proposed on March 3 in Michigan and April 14 in New York. They apparently agreed to May 24 in California. The Clinton campaign, after not accepting Michigan, now says they want it. We are pleased to do it on March 3 before the Michigan primary provided the Clinton campaign will agree to Brooklyn, New York, on April 14. Why won’t they debate in Brooklyn? What’s the matter with Brooklyn?”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/big-crowds-back-bernie-in-iowa-nearly-63000-see-sanders-since-campaign-kickoff/", "text": "DUBUQUE, Iowa – Barnstorming through eastern Iowa, Bernie Sanders drew 1,300 supporters to a Friday night rally at the Grand River Event Center here where he delivered an impassioned message about how to cure the country’s rigged economy propped up by a corrupt campaign finance system.Sanders’ Friday began with a pep talk for volunteers in Mount Pleasant and included stops in Washington, Muscatine and Davenport as part of a weekend flurry of meetings ahead of Monday’s precinct caucuses.“Are you ready for a radical idea?” Sanders asked the Dubuque audience. “Together we are going to create an economy that works for working families, not just the 1 percent.”The crowds on Friday pushed to 62,866 the total turnout at Sanders’ rallies and town meetings in Iowa since his bid for the White House officially began last April 30.Across the United States – from the Trailblazers arena in Portland, Oregon, to small house parties in New Hampshire – more than 507,100 people have packed into events hosted by the Sanders campaign.“We are running a simple, straightforward grassroots campaign. We are discussing the major issues facing our country and hearing what Iowans have to say,” Sanders said. “We sense growing momentum here in Iowa and we think we have a great opportunity to win.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/sanders-statement-on-top-secret-clinton-emails/", "text": "DAVENPORT, Iowa – U.S. Sen. Bernie Sanders on Friday issued the following statement after the State Department revealed that 22 emails sent through Hillary Clinton’s personal home computer server contained “top secret” information that may not be made public:“As I said at the first Democratic debate, there is a legal process in place which should proceed and not be politicized. The voters of Iowa and this nation deserve a serious discussion of the issues facing them.”", "author": "Bernie"}
{"url": "https://berniesanders.com/press-release/breaking-sanders-super-pac-haul/", "text": "\nDAVENPORT, Iowa – Bernie Sanders raised no money last year for a super PAC, his campaign announced on Friday.He won’t raise any money for a super PAC this year either, a spokesman added.“Bernie doesn’t want billionaires’ money. He doesn’t have a super PAC. He believes you can’t fix a rigged economy by taking part in the corrupt campaign finance system in which politicians take unlimited sums of money from Wall Street and other powerful special interests and then pretend it doesn’t influence them,” said spokesman Michael Briggs.Sanders instead has made American political history by running a presidential campaign supported by just short of 3 million donations from more than 1 million individuals averaging about $27 apiece.The announcement by Sanders’ campaign that he raised no money for a super PAC came as reports began to emerge on the colossal cash hordes amassed by other candidate’s super PACs.A committee backing Hillary Clinton, for example, claimed to have nearly $45 million cash in the bank. It boasted on Friday that it raised more than $25 million during the last half of last year plus another $10 million this month alone. That big haul would give Priorities USA Action a bigger war chest than any Democratic super PAC ever before.", "author": "Bernie"}
