{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-response-to-the-pope", "text": "\nIf and when the Vatican is attacked by ISIS, which as everyone knows is ISIS’s ultimate trophy, I can promise you that the Pope would have only wished and prayed that Donald Trump would have been President because this would not have happened. ISIS would have been eradicated unlike what is happening now with our all talk, no action politicians.\n\n\nThe Mexican government and its leadership has made many disparaging remarks about me to the Pope, because they want to continue to rip off the United States, both on trade and at the border, and they understand I am totally wise to them. The Pope only heard one side of the story - he didn’t see the crime, the drug trafficking and the negative economic impact the current policies have on the United States. He doesn’t see how Mexican leadership is outsmarting President Obama and our leadership in every aspect of negotiation.\n\n\nFor a religious leader to question a person’s faith is disgraceful. I am proud to be a Christian and as President I will not allow Christianity to be consistently attacked and weakened, unlike what is happening now, with our current President. No leader, especially a religious leader, should have the right to question another man’s religion or faith. They are using the Pope as a pawn and they should be ashamed of themselves for doing so, especially when so many lives are involved and when illegal immigration is so rampant.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-is-pro-life", "text": "Despite Senator Ted Cruz attempting to smear me and totally lie about my beliefs and positions on almost all of the issues, I am a conservative person and I believe in conservative values. Like Ronald Reagan, on many issues, I have evolved. I am pro-life and have been for a long time. https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-oped-the-culture-of-life", "text": "Let me be clear—I am pro-life. I support that position with exceptions allowed for rape, incest or the life of the mother being at risk. I did not always hold this position, but I had a significant personal experience that brought the precious gift of life into perspective for me. My story is well documented, so I will not retell it here. However, what I will do with the remaining space is express my feelings about life, and the culture of life, as we approach the 43nd anniversary of the Roe v. Wade.I build things. There is a process involved in building things. We tap into a lot of disciplines with engineering being one of the most important. The rules for putting structures together are as strict as are the rules of physics. These rules have stood the test of time and have become the path to putting together structures that endure and are beautiful. America, when it is at its best, follows a set of rules that have worked since our founding. One of those rules is that we, as Americans, revere life and have done so since our Founders made it the first, and most important, of our “unalienable” rights.Over time, our culture of life in this country has started sliding toward a culture of death. Perhaps the most significant piece of evidence to support this assertion is that since Roe v. Wade was decided by the Supreme Count 43 years ago over 50 million Americans never had the chance to enjoy the opportunities offered by this country. They never had the chance to become doctors, musicians, farmers, teachers, husbands, fathers, sons or daughters. They never had the chance to enrich the culture of this nation or to bring their skills, lives, loves or passions into the fabric of country. They are missing, and they are missed.The Supreme Court in 1973 based their decision on imagining rights and liberties in the Constitution that are nowhere to be found. Even if we take the court at its word, that abortion is a matter of privacy, we should then extend the argument to the logical conclusion that private funds, then, should subsidize this choice rather than the half billion dollars given to abortion providers every year by Congress. Public funding of abortion providers is an insult to people of conscience at the least and an affront to good governance at best.If using taxpayer money to facilitate our slide to a culture of death was not enough, the 1973 decision became a landmark decision demonstrating the utter contempt the court had for federalism and the 10th Amendment. Roe v. Wade gave the court an excuse to dismantle the decisions of state legislatures and the votes of the people. This is a pattern that the court has repeated over and over again since that decision. Perhaps Roe v. Wade became yet another incidence of disconnect between the people and their government.We are in the middle of a presidential political cycle and votes will be cast in just days. The citizens of this nation will have the chance to vote for candidates that are aligned with their individual worldviews. It is my hope that they will choose the builder, the man who has the ability to imagine the greatness of this nation. The next President must follow those principles that work best and that reinforce the reverence Americans hold for life. A culture of life is too important to let slip away for convenience or political correctness. It is by preserving our culture of life that we will Make America Great Again. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-responds-to-senator-cruz-lies-and-warns-of-legal-action", "text": "\nTed Cruz is a totally unstable individual. He is the single biggest liar I’ve ever come across, in politics or otherwise, and I have seen some of the best of them. His statements are totally untrue and completely outrageous. It is hard to believe a person who proclaims to be a Christian could be so dishonest and lie so much.\n\n\nCruz said I would be appointing a liberal judge when in fact I will appoint a great conservative and I am the only candidate who has gone so far, at the debate, as to suggest two individuals I feel would best represent the conservative values we need to protect: William “Bill” Pryor Jr. and Diane Sykes.\n\n\nCruz says I am pro-choice, when in fact I am staunchly pro-life and have been for a long time. Like Ronald Reagan, on many issues, I have evolved.\n\n\nCruz says I am in favor of ObamaCare, when in fact I have spoken about repealing and replacing this disaster of a system at every speech throughout my campaign and since it’s inception. Meanwhile, Cruz was responsible for getting Bush to put in the judge that failed to vote against ObamaCare twice.\n\n\nCruz says I will try to take away your second amendment rights, when I am one of the strongest proponents of the right to bear arms and I say so in every speech that I have made for years. I am a proud member of the NRA and so are my sons.\n\n\nCruz has become unhinged and is lying with the hopes that his statements will go unchecked until after the election and he will save his failing campaign.\n\n\nIn Iowa, Cruz told thousands of Ben Carson voters that Dr. Carson had left the race and to instead vote for Ted Cruz. He apologized when the race was over. Likewise, his fraudulent voter violation form sent to Iowa voters. If Ted is going to continue to lie with such desperation, I have no choice but to fight back.\n\n\nOne of the ways I can fight back is to bring a lawsuit against him relative to the fact that he was born in Canada and therefore cannot be President. If he doesn’t take down his false ads and retract his lies, I will do so immediately. Additionally, the RNC should intervene and if they don’t they are in default of their pledge to me.\n\n\nI am the strongest on the borders and I will build a wall, and it will be a real wall. I am strongest on illegal immigration, strongest on ISIS, strongest on the military and I will take care of our Vets. I will end common core and preserve the second amendment. I will renegotiate our trade deals and bring our jobs back to our country. I am the only person who will Make America Great Again. \n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-justice-scalia", "text": "I would like to offer my sincerest condolences to the Scalia family after the passing of Justice Scalia. Justice Scalia was a remarkable person and a brilliant Supreme Court Justice, one of the best of all time. His career was defined by his reverence for the Constitution and his legacy of protecting Americans’ most cherished freedoms. He was a Justice who did not believe in legislating from the bench and he is a person whom I held in the highest regard and will always greatly respect his intelligence and conviction to uphold the Constitution of our country. My thoughts and prayers are with his family during this time. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-unauthorized-rnc-fundraising-notice", "text": "The RNC, which is probably not on my side, just illegally put out a fundraising notice saying ‘Trump wants you to contribute to the RNC.' The RNC does not treat me well and then they use my name, without my knowledge, to raise money for themselves. At my insistence, they have withdrawn their request. I am self-funding my campaign and this totally unauthorized notice is yet another example of deceptive Washington tricks used to take advantage of the voters and get money from the hard-working people the politicians have failed. I will not stand for it and neither should you.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-begins-airing-new-ad-in-south-carolina-focused-on-illegal-i", "text": "\n(New York, NY) February 12th, 2016 – Today Donald J. Trump began airing a new ad in South Carolina focused on illegal immigration featuring Jamiel Shaw, whose son was brutally murdered by an illegal immigrant. \n\n\nMr. Trump says, “People wouldn’t be talking about illegal immigration had I not brought it up when I announced I was running for President. It is a massive problem in our country and now everybody agrees with me --- bad for crime and the economy. A wonderful young man, Jamiel Shaw Jr., whose father has become a friend of mine, was shot in the face for no reason by an illegal immigrant. He was getting ready to go to college on a football scholarship and his sole fault was walking home to see his father. Because of the relationship I have established with his father, Jamiel’s death is very personal to me. We must stop illegal immigration.”\n\n\nJamiel Shaw added, “Donald Trump is the only person fighting to put American families first. He will protect our children and put an end to these senseless acts of violence that are caused by our failed policies and broken immigration system. Donald Trump has made it clear he, like most Americans, wants to return the rule of law to the people of this country. Without strong borders we don’t have a country. Strong border enforcement is the first step to preventing future tragedies. We must secure our borders and return those who came here illegally to their native lands. Donald Trump is a man who stands for what is right. He stands for America and I stand with him.”\n\n\nThe ad is currently airing in South Carolina leading up to the February 20th primary contest. Mr. Trump maintains a substantial, double digit lead in all state polls and will spend the week prior to the primary campaigning around the state.\n\n\nYou can view the ad here: \nhttp://www.donaldjtrump.com/media/jamiel-tv-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-three-influential-florida-endorsements", "text": "\nTop National Security Experts and National Gold Star Mother Endorse Trump at Tampa Rally\n\n\n(New York, NY) February 12th, 2016 – Today Donald J. Trump was endorsed by former USAF Colonel and retired senior intelligence and political-military affairs officer, Jim Waurishuk, highly decorated, retired Senior CIA Operations Officer Gary Bernsten, and National Gold Star Mother, Susan Price.\n\n\nMr. Trump says, “I am proud to be endorsed by such accomplished and well-respected military experts. Additionally, to be endorsed by a Gold Star mother is such a wonderful honor. Homeland security and strengthening our military are two of the most important issues and cornerstones of my campaign. Jim and Gary’s support is so important to me and Susan is an incredible person and with their help we will win Florida and Make America Great Again!”\n\n\nWaurishuk is extremely well respected in the security community and an expert on national security with specific expertise in strategic engagement and policy, and unconventional and asymmetric warfare. He has served as Deputy Director for Intelligence for U.S. Central Command (USCENTCOM) during the peak years (2004-07) of the wars in Afghanistan, Iraq, and the War on Terrorism. He is a former White House National Security Council staffer and former Distinguished Senior Fellow at the Atlantic Council, Washington, DC.\n\n\nAdditionally, Colonel Waurishuk served combat and combat-support tours in Grenada, Panama, Bosnia, Lebanon, Afghanistan, and Iraq, as well as on numerous special operations and intelligence contingency missions and operations Colonel Waurishuk is an in-resident graduate of both DIA’s and CIA’s National Senior Intelligence Officer programs, the USAF and the Armed Forces Command and Staff Colleges, a War College Senior Fellow, and the Office of the Secretary of Defense Executive Leadership Development Program.\n\n\nGary Berntsen is a highly decorated, retired Senior CIA Operations Officer and Chief of Station. He is the bestselling author of \nJawbreaker, The Attack on Bin Laden and Al Qaeda,where he chronicles his leading role in the response to the September 11th attacks. In that role Berntsen led CIA Paramilitary Operations in Eastern Afghanistan on the Shomali Plains, Talaqan and Tora Bora where 135 CIA Officers and 350 Special Forces personnel led indigenous forces to defeat 70,000 Taliban and 5,000 Al Qaeda fighters. Mr. Berntsen is the recipient of the CIA’s Distinguished Intelligence Medal and Intelligence Star. Mr. Berntsen is the author of several other books and is a frequent guest commentator on National Security and Counter terrorism on Fox News, CNN, Newsmax and other media outlets.\n\n\nSusan Price, resident of Hillsborough County, is a National Gold Star Mother. She is an Army Veteran and the daughter of a Marine. She is also the mother of a fallen Marine hero, Gunnery Sgt. Aaron M. Kenefick, USMC. Aaron was killed in action on September 8, 2009, in Kunar Province, Afghanistan. Susan is a Veterans advocate and a national voice. She has appeared on 60 Minutes, and other national media, in television, newspaper, and radio. Susan has dedicated herself in the name of her son to protect America’s legacy.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-announces-dan-scavino-as-director-of-soc", "text": "\n(New York, NY) February 11th, 2016 – Today Donald J. Trump for President Inc. announced campaign staffer and longtime Trump confidant has been named Director of Social Media for the Trump Campaign. Scavino joined the campaign last spring and has since managed the campaign’s social media efforts working directly with Mr. Trump to strategize and execute all social content.\n\n\nTrump Campaign Manager, Corey Lewandowski said, “We are pleased to announce Dan’s promotion. He is a real asset that provides tremendous value as Mr. Trump continues to change the political landscape with his unprecedented influence on social media channels, among other tactics.”\n\n\nMr. Trump continues to dominate social media channels with over 13,000,000 followers, a larger audience than all the other candidates combined. His current social media followings include Twitter 6,125,000, Facebook 5,675,000, and Instagram 970,000. You can follow Mr. Trump and the campaign’s activities via @RealDonaldTrump.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-endorsements-from-dozens-of-georgia-officials", "text": "\n(New York, NY) February 11th, 2016 - Today Donald J. Trump for President Inc. announced the endorsements of dozens of Georgia officials including that of his first statewide elected official, Public Service Commission Chairman Lauren “Bubba” McDonald, Jr.\n\n\nMr. Trump stated, “It is my great honor to receive these coveted and influential endorsements from tremendous people in the state of Georgia. I have visited many times and had great crowds and poll numbers. I look forward to being in Georgia again soon and working with each of these local leaders to Make America Great Again.”\n\n\nMcDonald served 20 years as a State Representative in the Georgia Legislature and also served as a commissioner in Jackson County, served on the Board of Managers of the Association of County Commissioners of Georgia, and volunteered as a Firefighter for the city of Commerce for 35 years. He joins the campaign as a Statewide Co-Chair.\n\n\nMcDonald said, “Mr. Trump is a proven leader with unparalleled success. He has the capabilities to make our country stronger and better than ever before. I am proud to endorse his candidacy for President of the United States along with many other community leaders here in Georgia.”\n\n\nFormer State Representative Mitchell Kaye will lead the local elected officials coalition. Mitchell Kaye served east Cobb county for five terms in the Georgia House of Representatives, rising to deputy GOP Whip and ranking member of the tax-writing and cutting House Ways and Means committee. Kaye was awarded \"Legislator of the Year\" by the Georgia Association of Taxpayers for his tax cutting successes and by Phyllis Schlafly's Eagle Forum for his educational efforts.\n\n\nThe Georgia officials endorsing Donald J. Trump for President join State Senators Burt Jones and Michael Williams. Mr. Trump continues to lead in all national and state polls after winning the New Hampshire Primary by a landslide. He will campaign in South Carolina and other SEC states prior to the first in the south primary on February 20th.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-bill-stern-in-south-carolina", "text": "\n(New York, NY) February 10th, 2016 - Bill Stern of Columbia, S.C. has endorsed Donald Trump and has been announced Chairman of the Southeast Business Coalition on the Trump for President campaign.\n\n\nOne of the South’s most respected business leaders, Bill Stern is President and CEO of Stern & Stern, a commercial real estate development company that owns and manages real estate throughout the United States.\n\n\nMr. Trump said,”I am delighted Bill Stern has accepted a leadership role in my campaign. He is a successful real estate developer and for eight years he served as Chair of the South Carolina Ports Authority, which is one of the most important commercial ports in the world. I look forward to working closely with Bill --- with his support we will Make American Great Again.”\n\n\nMr. Stern stated, ”Throughout American history, we've had great Presidents who were lawyers, politicians and military leaders. I believe the complex global challenges of our time call for a President with a background in business, a record of success in creating jobs and the strong leadership skills it will take to Make America Great Again. That's why I'm supporting Donald Trump. He's a world class business leader who I believe will make a world class President of the United States.\"\n\n\nStern has served as Chair of the South Carolina Ports Authority for eight years and has recently been named the first Chairman Emeritus in the port's history. During his period of leadership, South Carolina's port was ranked as the fastest growing in the nation and now ranks number one in container volume growth.\n\n\nBill Stern has also served in leadership roles in political campaigns at the national, state and local levels. He served on the George W. Bush for President State Finance Committee, and he was State Finance Chair of the John McCain for President campaign. Other leadership roles include: State Finance Chair, Lindsey Graham for U.S. Senate, Co-Chair, Lindsey Graham for President; and State Finance Chair for Henry McMaster for Lt. Governor, Alan Wilson for Attorney General, and many other state and local political campaigns.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-new-radio-ad-featuring-south-carolina-lieutenant-go", "text": "\n(New York, NY) February 5th, 2015 -  Today Donald J. Trump debuted a new radio ad featuring South Carolina Lieutenant Governor Henry McMaster. The ad will begin airing today in South Carolina. Last week Mr. Trump received McMaster’s endorsement. The Lt. Gov. previously served as South Carolina Attorney General, South Carolina Republican Party Chairman, and was the first United States Attorney appointed by President Ronald Reagan.\n\n\nThe new ad focuses on key issues of Mr. Trump’s campaign including homeland security, job creation and Mr. Trump’s leadership and strength.\n\n\nLt. Gov. McMaster joined Mr. Trump at his rally in Lexington County, South Carolina last week, where there were thousands in attendance, to voice his support.\n\n\nHe said, “I am delighted to support Donald Trump.  He is a man of accomplishment and speaks the truth in words everyone can understand, instills confidence in the people about our country’s bright future, and reflects and believes in the strength and determination necessary for success.  These qualities - and his quiet compassion for those in need - are essential to making America Great Again.  Now is the time for Donald Trump.”\n\n\nMr. Trump will be in Florence this evening for a rally with a record crowd expected to attend. The Trump Campaign continues to dominate in South Carolina with all recent polls showing Mr. Trump with substantial, double digit leads in all state polls and great momentum as the February 20th primary contest approaches.\n\n\nYou can listen to the ad here: http://www.donaldjtrump.com/media/mcmaster-radio-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-endorsement-from-former-santorum-senior-adviser", "text": "\n(New York, NY) February 4th, 2016 - Today Donald J. Trump for President Inc. announced the endorsement of respected Alderman Nick Pappas of Manchester, New Hampshire.\n\n\nPappas served as the New Hampshire based senior adviser to Senator Rick Santorum and recently served as New Hampshire State Director for Generation Opportunity, a national conservative advocacy group with a focus on millennials.\n\n\nMr. Trump will be campaigning in New Hampshire today with five events around the state. He will return for the eighth Republican Presidential Debate on Saturday and stay through the primary on Tuesday.\n\n\nMr. Trump continues to lead in all national and state polls, with a significant lead in New Hampshire where he has 38% support, a massive 26-point lead over his nearest rival. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-latest-campaign-ad-to-begin-airing-in-new-hampshire", "text": "\n(New York, NY) February 3rd, 2016 – Today Donald J. Trump unveiled the latest campaign add to begin airing in New Hampshire. The ad will appear on TV starting Wednesday and is part of an $850,000 spend the campaign made last week. The ad is a compilation of footage from Trump events showcasing massive crowds, energy, passion and supporters reinforcing Mr. Trump’s message to take back the country. \n\n\nMr. Trump stated, “This is a movement. People believe in my vision to make our country better and stronger than ever before and I am so honored to have their support. I am going to make you so proud--- we will take our country back and Make America Great Again!”\n\n\nMr. Trump continues to dominate all national and local polls including maintaining a massive twenty-six point lead in New Hampshire, where he will compete in the first in the nation primary contest on Tuesday, February 9th.\n\n\nMr. Trump is self-funding his campaign and has spent millions on advertising in the first three early states. He also maintains his frontrunner status in South Carolina and all national surveys.\n\n\nYou can view the ad here: \nhttp://www.donaldjtrump.com/media/voters-speak-tv-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-raises-millions-for-veterans-organizations", "text": "\nMr. Trump Made a $1 Million Dollar Contribution at a Special Event in Des Moines to Benefit Vets\n\n\n(New York, NY) January 28th, 2016 – Today Donald J. Trump hosted an event to raise money for Veterans organizations in Des Moines, Iowa. The GOP frontrunner spoke to a record crowd at Drake University and was joined by special guests, including Senator Rick Santorum and Governor Mike Huckabee, as well as Veterans, throughout the night. Mr. Trump personally contributed $1 million dollars to the cause and raised an additional $5 million before the one-hour event concluded, totaling more than $6 million dollars.\n\n\nMr. Trump stated, “Our Veterans have been treated like third-class citizens and it is my great honor to support them with this $1 million dollar contribution – they are truly incredible people. We are going to strengthen our military, take care of our Vets and Make America Great Again.”\n\n\nThe night benefited twenty-two different organizations, a number of which are Iowa based Veterans groups. Mr. Trump has been a major supporter of Veterans organizations throughout his life and has made strengthening our military, reforming the VA and taking care of our great Veterans cornerstones of his campaign.\n\n\nSFC (R) John Wayne Walding, who spoke during the event, spent 12 years in the U. S. Army. He has combat deployments to both Iraq and Afghanistan. John's awards and badges include: Silver Star, Bronze Star, Purple Heart, Combat Infantry Badge, Airborne Air Assault and the Special Forces Tab. John participated in numerous battles during his deployments; most famous was the Battle of Shok Valley.\n\n\nTo make a contribution please visit donaldtrumpforvets.com.  A list of organizations benefitting from tonight’s event can be see here: DonaldJTrump.com/MilitaryCharities\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-becomes-the-first-campaign-to-announce-s", "text": "\nGeorgia Operation Solidifies Grassroots Teams in All 159 Counties\n\n\n(New York, NY) January 28th, 2016 - Today, Donald Trump for President Inc. announced that it is the first 2016 Presidential campaign to organize County Managers in all 159 of Georgia’s counties. These committed volunteers consist of veterans of the Tea Party movement, GOP activists, local elected officials and political newcomers energized and inspired by Mr. Trump’s candidacy to get involved in the political process for the first time in decades.\n\n\nMr. Trump said, “We have such tremendous support all over the country, the people of Georgia have been amazing. We are leading in all the polls, with 33% in the most recent Georgia survey. The support from this state is so important to me --- with their help we will Make America Great Again!”\n\n\nThese county-level leaders will form the backbone of the campaign’s grassroots operations in Georgia. They will work with the district and statewide leadership team in turning out Trump supporters for the March 1st primary.\n\n\nThe County Managers and Statewide Leadership Team join the five staffers already on the ground building out a grassroots operation. The Georgia team is led by State Director Brandon Phillips and its headquarters is located at 1000 Circle 75 Parkway, Suite 700, Atlanta, GA 30339.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-south-carolina-lieutenant-governor-henry-mcmast", "text": "\n(New York, NY) January 27th, 2016 - Today Donald J. Trump received South Carolina Lieutenant Governor Henry McMaster’s endorsement. The Lt. Gov. previously served as South Carolina Attorney General, South Carolina Republican Party Chairman, and was the first United States Attorney appointed by President Ronald Reagan. Lt. Gov. McMaster joined Mr. Trump at his rally in Lexington County, South Carolina, where there were thousands in attendance, to voice his support.\n\n\nMr. Trump stated, “Lt. Governor McMaster has a distinguished record of service to the people of South Carolina and the country, and his endorsement is a great honor. I’m proud to have Henry and his wife Peggy, join the team. The people of South Carolina are amazing and I continue to lead all state polls by wide, double digit margins.”\n\n\nLt. Governor McMaster added, “I am delighted to support Donald Trump. He is a man of accomplishment and speaks the truth in words everyone can understand, instills confidence in the people about our country’s bright future, and reflects and believes in the strength and determination necessary for success. These qualities - and his quiet compassion for those in need - are essential to “making America great again.” Now is the time for Donald Trump.”\n\n\nThe Trump Campaign continues to dominate in South Carolina with all recent polls showing Mr. Trump with substantial, double digit leads in all state polls and great momentum as the February 20th primary contest approaches. Today’s event in Lexington County, South Carolina was attended by thousands of people. He will return to South Carolina early next month. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-campaign-statement-on-fox-news-debate", "text": "\n(New York, NY) January 26th, 2016 - As someone who wrote one of the best-selling business books of all time, The Art of the Deal, who has built an incredible company, including some of the most valuable and iconic assets in the world, and as someone who has a personal net worth of many billions of dollars, Mr. Trump knows a bad deal when he sees one. FOX News is making tens of millions of dollars on debates, and setting ratings records (the highest in history), where as in previous years they were low-rated afterthoughts. \n\nUnlike the very stupid, highly incompetent people running our country into the ground, Mr. Trump knows when to walk away. Roger Ailes and FOX News think they can toy with him, but Mr. Trump doesn’t play games. There have already been six debates, and according to all online debate polls including Drudge, Slate, Time Magazine, and many others, Mr. Trump has won all of them, in particular the last one. Whereas he has always been a job creator and not a debater, he nevertheless truly enjoys the debating process - and it has been very good for him, both in polls and popularity. \n\nHe will not be participating in the FOX News debate and will instead host an event in Iowa to raise money for the Veterans and Wounded Warriors, who have been treated so horribly by our all talk, no action politicians. Like running for office as an extremely successful person, this takes guts and it is the kind of mentality our country needs in order to Make America Great Again.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-maricopa-county-arizona-sheriff-joe-arpaio", "text": "(New York, NY) January 26th, 2016 – Today Donald J. Trump received Sheriff Joe Arpaio’s endorsement. The Sheriff is well known for his hard-line stance on illegal immigration. Sheriff Arpaio joined Mr. Trump at his rally in Marshalltown, Iowa to voice his support less than one week before the Iowa Caucus.Mr. Trump stated, “I have great respect for Sheriff Arpaio. We must restore law and order on the border and respect the men and women of our police forces. I thank him for his support of my policies and candidacy for President.” Sheriff Arpaio added, “Donald Trump is a leader. He produces results and is ready to get tough in order to protect American jobs and families. I have fought on the front lines to prevent illegal immigration. I know Donald Trump will stand with me and countless Americans to secure our border. I am proud to support him as the best candidate for President of the United States of America.” Mr. Trump has visited Arizona twice since announcing his campaign in June and Sheriff Arpaio has attended both rallies in Phoenix and Mesa where the Trump campaign hosted record crowds. Mr. Trump has a strong state operation in place and has been endorsed by several community leaders including Arizona State Treasurer Jeff DeWit. Mr. Trump continues to lead all national and state polls with a significant lead in Arizona where the most recent poll out last week shows him with 38% support. He maintains a substantial lead in Iowa with great momentum heading into Monday’s Caucus. Mr. Trump will be in South Carolina on Wednesday before returning to Iowa on Thursday for the seventh Republican Presidential debate in Des Moines, Iowa. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-jerry-falwell-jr", "text": "\n(New York, NY) January 26th, 2016 – Today Donald J. Trump received the endorsement of Jerry Falwell Jr., just one week after Mr. Trump spoke to a record crowd at Falwell’s Liberty University Convocation.\n\n\nMr. Trump said, “It is truly an honor to receive Jerry’s endorsement. Not only is he a high quality person, with a wonderful family, whom I have great respect for – I also consider him a very good friend and his support means so much to me.”\n\n\nThe endorsement, which is personal and not on behalf of the University, comes just days after the campaign released an ad featuring excerpts from Falwell’s glowing introduction of Mr. Trump at the Liberty University event stating, “I see a lot of parallels between my father and Donald Trump. Like Mr. Trump, Dad would speak his mind… Dad explained that when he walked into the voting booth, he wasn't electing a Sunday school teacher, or a pastor, or even a President who shared his theological beliefs. He was electing a President of the United States to lead a nation.”\n\n\nAfter his endorsement Falwell added, “I am proud to offer my endorsement of Donald J. Trump for President of the United States. He is a successful executive and entrepreneur, a wonderful father and a man who I believe can lead our country to greatness again.”\n\n\nUnder Falwell, Jr.’s leadership, Liberty University has grown to become the largest, private non-profit university in the nation, the largest university in Virginia and the largest Christian university in the world, creating an innovative business model for higher education and increasing net assets from $100 million in 2007 to over $1.6 billion today.\n\n\nMr. Trump continues to lead all national and state polls with the latest results from FOX News and CBS showing Mr. Trump gaining momentum with a strong lead in Iowa and substantial, double digit leads in New Hampshire and South Carolina. He also maintains a very strong lead in all national surveys, with the most recent CNN poll showing Mr. Trump with 41% support nationwide. Falwell’s endorsement is expected to carry tremendous weight in Iowa, where Mr. Trump maintains strong support with the evangelical community as we approach the Iowa Caucus on February 1st.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-announces-iowa-caucus-finder", "text": "\nTrump Campaign Encourages Iowans to Vote with New Location Finder and Instructional Video\n\n(New York, NY) January 22nd, 2016 – Today Donald J. Trump for President Inc. announced a new digital tool to help voters find their Iowa Caucus locations on Monday, February 1st.\n\n\nThe campaign stated, “The only way to ensure that Donald J. Trump will be our next President of the United States is to caucus for him on February 1st— the caucus process is very fast and easy, and we are here to help if you have any questions.”\n\n\nThe  Iowa Caucus Finder (also at https://www.donaldjtrump.com/iowa/caucus-finder) will show voters where to go on Caucus night. It also includes an instructional video on how what to do once you arrive at the pre-determined locations.\n\n\nMr. Trump continues to dominate all national and state polls including an 11 point lead in the most recent CNN/ORC poll in Iowa. He will be campaigning across the state for much of the next week and continues to encourage the thousands of Iowans attending each of his rallies to Caucus next Monday night. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-debuts-new-radio-ad-featuring-jerry-falwell-jr", "text": "(New York, NY) January 22nd, 2016 – Today Donald J. Trump debuted the campaign’s most recent radio ad to begin airing in Iowa and South Carolina featuring Jerry Falwell Jr. Mr. Trump was a guest at Liberty University on Monday and was introduced by Falwell who spoke glowingly of Mr. Trump’s success, leadership and character, which he stated reminded him of his late father.Mr. Trump said, “It was a great honor to be introduced by the legendary Jerry Falwell Jr. He has built a tremendous institution and is a really terrific person with a beautiful family. We have always had a wonderful relationship and I am proud to share his kind words with the people of Iowa and South Carolina.” The ad features statements from Falwell’s introduction of Mr. Trump at the Liberty University convocation this week, which was attended by a record crowd of students and supporters. Falwell is a highly respected and influential figure in Evangelical communities. In the ad Mr. Falwell says, “I see a lot of parallels between my father and Donald Trump. Like Mr. Trump, Dad would speak his mind. He would make statements that were politically incorrect. He speaks the truth publicly, even if it is uncomfortable for people to hear it. Dad explained that when he walked into the voting booth, he wasn't electing a Sunday school teacher, or a pastor, or even a President who shared his theological beliefs. He was electing a President of the United States to lead a nation.”Mr. Trump continues to lead all national and state polls with the latest polls from Iowa and New Hampshire showing him with substantial, double digit leads over his nearest rival. The CNN/ORC poll from Iowa shows Mr. Trump with 36% support and an 11 point lead over Senator Ted Cruz and a 20 point lead over Cruz in the WMUR/CNN poll out of New Hampshire. Mr. Trump will return to Iowa this weekend and campaign in all three primary states throughout the week. You can listen to the ad here: http://www.donaldjtrump.com/media/trump-falwell-radio-spot", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-latest-tv-ad-aimed-at-senator-ted-cruz", "text": "\n(New York, NY) January 22nd, 2016 – Today Donald J. Trump unveiled his latest campaign ad aimed at Senator Ted Cruz and focused on illegal immigration, which Mr. Trump has brought to the forefront of this election and made a cornerstone of his campaign. Mr. Trump began his campaign focused on this issue, which has resonated with the American people, and he has maintained his strong stance, releasing detailed policies to address this issue posing a threat to America’s national security and economic growth.\n\n\nMr. Trump stated, “Ted Cruz is a total hypocrite and, until recently, a Canadian citizen who may not even have a legal right to run for President. He didn’t disclose loans, pretending he’s Robin Hood, when he’s just another all talk, no action politician. Had I not brought up the subject of illegal immigration, an issue which Ted Cruz is very weak on, nobody would even be talking about it. I will build a great wall, and Mexico will pay for it.”\n\n\nThe footage captures Senator Cruz in a confused state, unable to answer simple policy questions, as he contemplates his position, advice from his pollsters, donors and the special interests who control him. The only special interest Mr. Trump is beholden to is the American people, and he is the only candidate that will stop illegal immigration and Make America Great Again.\n\n\nThe ad will run on TV in Iowa, New Hampshire and South Carolina. Mr. Trump continues to spend $2 million dollars per week on advertising. Mr. Trump continues to dominate all local and national polls, including in Iowa, where we are less than two weeks away from the Caucuses and the most recent poll from CNN shows Mr. Trump with an 11 point lead.\n\nMr. Trump was in Iowa earlier this week where he received the coveted endorsement of influential conservative Sarah Palin, who previously endorsed Ted Cruz during his Senatorial bid, and attributed his success to her support stating, “She picks winners.” Mr. Trump will return to Iowa over the weekend and several days next week ahead of the Iowa Caucus on February 1st.\n\nYou can view the ad here: http://www.donaldjtrump.com/media/clear-difference-tv-spot\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-willie-robertson", "text": "Mr. Trump Attended the Outdoor Sportsman Awards with Son Don Jr. in Las Vegas and Received Robertson’s Endorsement(New York, NY) January 21st, 2016 – Today Donald J. Trump announced yet another coveted endorsement, with Duck Dynasty star Willie Robertson touting his support for the candidate in Las Vegas. Willie is an extremely popular figure in conservative circles and previously attended a rally in Oklahoma with Mr. Trump where he praised the GOP frontrunner’s brash style and truthful talk in front of 25,000 people. Mr. Trump stated, “I am truly honored to receive Willie’s endorsement. He is a great person, has had tremendous success and a really terrific family. He believes in my message and knows that I am the only one who will Make America Great Again!” Mr. Trump was joined by his son Don Jr. and Willie at the Outdoor Sportsman Awards in Las Vegas Thursday night. Mr. Trump attended several events in Nevada on Thursday including a campaign rally attended by thousands of people. He continues to lead in all national and state polls, including the most recent Nevada poll showing Mr. Trump with a substantial lead just weeks away from the fourth in the nation Primary contest. Willie Robertson added, “Mr. Trump is a real leader. He represents success and strength, two attributes our country needs. Like me, he is a successful businessman and family man and I endorse his candidacy for President of the United States.\"", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-state-treasurer-of-arizona", "text": "\nJeff DeWit and Numerous Arizona Community Leaders Endorse Trump for President as Arizona Campaign Team Expands\n\n\n(New York, NY) January 20th, 2016 – Today Donald J. Trump received the endorsement of Jeff DeWit, State Treasurer of Arizona. DeWit is a well-respected Republican leader in Arizona where he was first elected in 2014. In addition to Mr. DeWit, Mr. Trump received the endorsement of seven other community leaders including the former State Attorney General and NRA President, Bob Corbin, former State Senator, Lori Klein Corbin, former State Senator, Senator President Pro Tempore and House Majority Whip Robert Blendu, former Arizona State Republican Chairman Tom Morrissey, former Maricopa Country Republican Chairman Lyle Tuttle, former National Committeewoman Lori Urban and former State Treasurer of Arizona former Arizona State Senator and former Yavapai County Supervisor, Carol Springer.\n\n\nMr. Trump stated, “Jeff is a terrific guy. He has been supportive of my campaign since the very beginning and it is a honor to receive the endorsement of such an intelligent, high quality individual, committed to my vision to Make America Great Again!”\n\n\nMr. Trump has campaigned in Arizona on two occasions. His first rally in Phoenix, where he spoke about illegal immigration, was attended by thousands and he most recently Mr. Trump visited Mesa, Arizona for a campaign event with more than 12,000 people in attendance. He continues to dominate all Arizona state polls and lead by wide, double digit margins in all national polls.\n\n\nTreasurer DeWit added, “Our country's political elite have forgotten that this country was built with grit and hard work, and don't seem to understand the economic ramifications of the laws they pass. As a businessman, turned State Treasurer, I am a big believer that we cannot rely on politicians to put our country back on the path to prosperity. We need a conservative political outsider with financial savvy and success, who understands what it means to build a business, make payroll, and flourish during tough times. America is fortunate to have this and more in Mr. Donald J. Trump.”\n\n\nDeWit continued, “As someone who has spent one on one time with him, I can tell you that Mr. Trump is one of the smartest and quickest minds of our time. His business success is extraordinary. His passion for America, our veterans, and protecting our freedoms is inspiring. But what may be his most admirable quality is his willingness to give back and serve our country, and fight to see that our children and our grandchildren will have the same opportunities to live, work, and raise a family in the greatest country ever known to man, the USA. I have been proud to stand with Mr. Trump since before his campaign for President was announced and in every step along the way, and I am excited to now serve as his campaign Chairman in Arizona to ensure victory in 2016. Together, let's Make America Great Again!”\n\n\nIn addition to these key endorsements, the Trump campaign has expanded its Arizona operation with new hire Thayer Verschoor, Former State Senator, Senate Majority Leader, Senate Pro Tempore, who will serve as Deputy State Director under Arizona State Director Charles Munoz.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-coveted-endorsement-of-influential-conservative-sa", "text": "\nPalin Praises Trump’s Leadership with Endorsement in Iowa\n\n(New York, NY) January 19th, 2016 – Today Donald J. Trump received the coveted and influential endorsement of former Vice Presidential Candidate and Governor of Alaska, Sarah Palin. Palin praised Trump’s leadership and unparalleled ability to speak the truth and produce real results. A trusted conservative, Palin has a proven record of being fiscally modest, staunchly pro-life and believes in small government that allows businesses to grow and freedom to prosper. Gov. Palin joined Mr. Trump in Ames on Tuesday, just two weeks before the Iowa Caucuses, to announce her endorsement of the GOP frontrunner.\n\n\nMr. Trump stated, “I am greatly honored to receive Sarah’s endorsement. She is a friend, and a high quality person whom I have great respect for. I am proud to have her support.”\n\n\nSarah Palin served as the Governor of Alaska before being selected as Senator John McCain’s Vice Presidential nominee in 2008. As the first ever female Vice Presidential candidate for the Republican party, Palin is a highly influential, decorated public figure having been named as one of the Smithsonian Institute’s 100 Most Influential Americans of All Time, one of TIME magazine’s Most Influential People In The World, Forbes 100 Most Powerful Women and 100 Most Influential Pro-life advocates by Newsmax. In addition to her political accomplishments, Sarah Palin is also a New York Times Best-Selling Author, former FOX News contributor and internationally sought-after speaker.\n\n\nSarah Palin stated, \"I am proud to endorse Donald J. Trump for President of the United States of America.”\n\n\nPalin’s endorsement is amongst the most sought after and influential amongst Republicans. Since 2009 she has supported over 150 conservative candidates, helping to flip over thirty US House seats and 5 US Senate seats to regain historic majorities. She helped launch the careers of several key future leaders of the Republican Party and conservative movement. Senator Ted Cruz notes: “I would not be in the United States Senate were it not for Gov. Sarah Palin… She can pick winners.” Senator Jim Demint noted: “She has done more to change the political landscape in America as anyone since Ronald Reagan.”\n\n\nMr. Trump campaigned in Winterset, Altoona, and Ames, Iowa today and will be in Norwalk, Iowa for an event tomorrow, before traveling to Tulsa, Oklahoma for a rally with thousands expected to attend. Palin will travel with the candidate to both events on Wednesday. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-names-louisiana-state-leadership-team", "text": "\nJenkins, Skrmetta to Serve as State Chairmen\n\n\n\n(New York, NY) January 19th, 2016 – Today Donald J. Trump for President Inc. announced its Louisiana State Leadership Team. The Trump Campaign’s Louisiana operation is being led by State Director Ryan Lambert and today announced Public Service Commissioner Eric Skrmetta and former State Representative Woody Jenkins as the State Chairman and Jeff Crouere and Brian Trascher as state Co-Chairs.\n\n\nMr. Trump says, “I am proud to announce our Leadership Team in Louisiana where we have tremendous grassroots support and a great team in place. I look forward to visiting soon and working with these individuals, whose support is so important, to share my vision to Make America Great Again!”\n\n\nSkrmetta was elected Public Service Commissioner for District 1 in 2008. His district includes 11 parishes and a million consumers in the southeastern part of Louisiana. Skrmetta served as Chairman of the Commission and earned high praise for leading Louisiana to the lowest utility rates in the nation. He also serves as President on the Entergy Regional State Committee. A lifelong Republican, Skrmetta began his dedication to public service on the staff of the former Louisiana Governor Dave Treen, the first Republican Governor of Louisiana since Reconstruction.\n\n\nAlso a lifelong Republican, Jenkins was elected to the Louisiana House of Representatives in 1972 and served for 28 years until 2000. He represented District 66 located in East Baton Rouge parish. As a legislator, over three hundred of the bills he authored became law. While in the legislature, Jenkins formed and served as chairman of the Conservative Caucus in the state house. He also served as chairman of the House Committee on Labor and Industrial Relations and was the 1996 Republican Nominee for Senate. A journalist by trade and an inductee into the LSU Journalism Hall of Fame, Jenkins is the editor of Capital City News, an award-winning community weekly newspaper. Jenkins is the Chairman of the East Baton Rouge Parish Republican Party, the largest in the state.\n\n\nSaid Skrmetta, \"I look forward to sharing the policies of businessman Donald Trump and promoting his candidacy. His confidence and strong convictions have a place in today's politics. His business-savvy and negotiation skills will be valuable assets to our country. I support Mr. Trump's economic policies favoring free enterprise and fewer government regulations.”\n\nRepublicans Jeff Crouere and Brian Trascher, both natives of New Orleans, will add political expertise as State Co-Chairs of the campaign. Jeff Crouere is host of the Louisiana based radio and TV program, “Ringside Politics” and is previous Executive Director & Deputy Chairman for the LAGOP. Brian Trascher is a Senior Partner with New Orleans-based Gulf South Strategies, the firm best known for recruiting the Uber Car Service to Louisiana. Trascher is a veteran political operative with strong, bipartisan relationships throughout Louisiana. Crouere and Trascher join Tim Breaux of Lafayette and Wayne Ryan of Alexandria as Co-Chairs.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-new-radio-ad-in-iowa-and-new-hampshire-featuring-d", "text": "\nIvanka Trump Featured in Latest Radio Spot for Trump Campaign\n\n\n(New York, NY) January 18th, 2016 – Today Donald J. Trump unveiled a new radio ad to begin airing in Iowa and New Hampshire featuring his daughter Ivanka Trump.\n\n\nMr. Trump stated, “My family has been so supportive of me and my candidacy and I am so proud of Ivanka. She is a terrific person, a devoted mother and an exceptional entrepreneur. Ivanka is doing a fantastic job running my company, alongside her brothers, and is building many of my biggest jobs. It is so important to have the support of all of my children and I’m really proud of this ad.”\n\n\nThe ad features Ivanka talking about her father as only a daughter can. She discusses what it was like to grow up learning from the GOP frontrunner, and what he taught her about becoming a great entrepreneur and parent.\n\n\nIvanka added, “My father has experienced unparalleled success in business over many decades and built an amazing company that employs thousands of people. I have witnessed his vision, strength and competence each day of my life. He has been an incredible father to me and my siblings and I love him very much.”\n\n\nMr. Trump continues to lead all national and state polls, with the Iowa Caucus just two weeks away. Last Thursday Mr. Trump participated in the sixth Republican Presidential debate in South Carolina after which he was unanimously declared the winner.\n\n\nYou can listen to the radio ad here:\nhttp://www.donaldjtrump.com/media/ivanka-trump-radio-spot\n\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-tidewater-and-valley-leadership-teams", "text": " Mr. Trump is the Definitive Frontrunner With 9 Point Lead in Recent Virginia Poll \n(New York, NY) January 18th, 2016- Today the Donald J. Trump for President Campaign has announced additional members to its Tidewater Leadership Team consisting of current and former elected officials and party leaders.\n\n\nMr. Trump said “It is such an honor to have the support of so many grassroots leaders across Virginia where we are leading in the polls by substantial margins. The people of Virginia are ready to Make America Great Again!”\n\n\nNew members of the leadership team include Chesapeake County School Board Chairman Christie New Craig, Accomack County Supervisor Wanda Thornton, Former Northampton GOP Chair John Salm, Newport News GOP Chair Cliff Dunn, Former Hampton City Councilman Chris Stuart and Virginia GOP State Central Committee Members Cheryl Hargrove and Roger Miles.\n\n\nIn addition to the newest additions to the Tidewater team the Trump campaign is proud to announce its Valley Leadership team comprising of local elected officials, business leaders and party leaders. The addition to the leadership team builds momentum in Roanoke area and Shenandoah Valley.\n\n\nFormer Republican Party of Virginia Finance Chairman Walter Curt of Harrisonburg will serve as Chairman. Amherst County Board of Supervisors Chairwoman Claudia Tucker will serve as co-chair.\n\n\nOther members of the leadership team include Augusta County businessman Charlie O’Baugh, Shenandoah Tea Party Chairman Ed Long, Sixth Congressional District GOP Vice Chair Chris Green and Botetourt County Supervisor Billy Martin.\n\n\nAlso today, Mr. Trump spoke to thousands of people at Liberty University in Lynchburg, Virginia where he held a campaign rally for students and supporters.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-releases-second-ad-to-begin-airing-in-iowa-and-new-hampshir", "text": "\nTV Spot Called “Our Country” Features Trump Emphasizing his Message to Make America Great Again\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-sue-everhart-former-georgia-republican-party-ch", "text": "\nTrump Campaign Continues to Expand in Georgia with Statewide Leadership Team\n\n(New York, NY) January 14th, 2016 – Today Donald J. Trump announced the expansion of his campaign operation in Georgia with a statewide leadership team led by honorary chair, and former Georgia Republican Party Chair, Sue Everhart. Following a successful campaign headquarters grand opening with a record crowd in Cobb County, the Trump campaign received the endorsement of Sue Everhart and a group of prominent community leaders, including grassroots activists, business executives, veterans, elected officials, former GOP party leaders, former Democrats, and many more.\n\n\n\nGeorgia State-Wide Leadership Committee:\n\nSue Everhart, Honorary State Chair\n\nSenator Burt Jones, State Co-Chair\n\nSenator Michael Williams, State Co-Chair\n\nRayna Casey, State Co-Chair\n\nBruce LeVell, State Co-Chair\n\nTyler Van Landingham, Metro Atlanta Regional Coordinator\n\nCarolyn Roddy, Metro Atlanta Regional Deputy Coordinator\n\nJordan Howard, 1st District Manager\n\nRitch McCutchen, 2nd District Manager\n\nBob Blackburn, 3rd District Manager\n\nAnthony Morris, 8th District Manager\n\nTerry Wellham, 9th District Manager\n\nMitch Mitcheltree, 10th District Manager\n\nLee Burton, 12th District Manager\n\nSeth Owens, 14th District Manager\n\nVivian Childs, GOP Grassroots Liaison\n\nBob Mayzes, Ballot Access Chairman\n\nMitchell Kaye, Local Elected Officials Chair\n\nShawn Hanley, Veterans for Trump Chair\n\nChad Ethridge, Farm Team Chair\n\nJennifer Maloney, Women for Trump Chair\n\nEugene Yu, Asain Americas for Trump Chair\n\nWeston Kirk, Young Professionals for Trump Chair\n\nCody Lautner, Students for Trump Chair\n\nCarmenza Perdomo, Hispanics for Trump Chair\n\nDennis Bell, Law Enforcement for Trump Chair\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-several-community-leaders-in-florida", "text": "\n\nTrump Campaign Stronger Than Ever in Sunshine State Rolling Out Key Endorsements at Massive Pensacola Rally\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-joseph-a.-trillo-as-rhode-island-honorary-chairma", "text": "\n(New York, NY) January 12th, 2016 – Today Donald J. Trump announced State Representative Joseph A. Trillo will serve as the Honorary Chairman of his campaign in the state of Rhode Island.\n\n\nMr. Trump stated, “It is my pleasure to have Joe serve as our Honorary Chairman in the great state of Rhode Island. Securing our border and solving the issue of illegal immigration has become a cornerstone of my campaign and I have great respect for Joe’s passion with regard to solving this problem. With the help of Joe and so many other supporters in Rhode Island, we will Make America Great Again.”\n\n\nState Representative Joseph A. Trillo currently serves as the Minority Whip in the Rhode Island General Assembly, is host of the statewide cable TV show “Trillo Talks” and is a life-long businessman and real estate investor. He has been an outspoken opponent of illegal immigration, having traveled to the Mexican border to see first-hand how serious the problem really is. Trillo has introduced e-verify legislation and supported the prohibition of illegal immigrants obtaining drivers licenses. Trillo previously served as Republican National Committeeman for the state.\n\n\nTrillo added, “As a long-time admirer of Mr. Trump’s business acumen, it is a great honor to now serve as his Honorary Campaign Chairman for Rhode Island, where his vision and messageare clearly resonating. I look forward to helping take that message to even more voters so we can Make America Great Again.”\n\n\nMr. Trump continues to be the definitive front-runner in all national polls. Yesterday day he campaigned in Windham, New Hampshire before traveling to \nIowa, Florida, and South Carolina for multiple visits throughout the week.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-major-granite-state-endorsements-from-prominent-co", "text": "\nTrump Campaign Continues to Dominate in New Hampshire Weeks Before Primary Contest\n\n\n(New York, NY) January 11th, 2016 – Today Donald J. Trump received endorsements from four prominent and highly respected businessmen in New Hampshire: Ben Gamache, Bruce Breton, Arthur Sullivan, and Sam Tamposi Jr. These four individuals are responsible for driving the majority of economic development in the state for the last several years and they recognize Mr. Trump’s unparalleled abilities and leadership as one of the most successful entrepreneurs of all time.\n\n\nMr. Trump stated, “I am honored to receive these important endorsements from such accomplished businessmen in the great state of New Hampshire. Their support, and the support of so many incredible people all over the state means so much to me. It is time to Make America Great Again and with your help, on February 9th, we will do just that.”\n\n\nA strong supporter of the local community, Gamache has served the Manchester Chamber of Commerce, Chairman of the Board for Intown Manchester, and proudly served as Chairman of the Board for Easter Seals New Hampshire from 2007 to 2009. His strong professional reputation, charitable endeavors, and active participation in Manchester city politics have made him a coveted community endorsement and he is proud to support Donald J. Trump as the Republican nominee for President of the United States.\n\n\nBruce Breton served as Chair of Windham GOP in 2015 and is a Selectman in the Town of Windham. Breton, a former Pataki supporter, proudly endorses Donald J. Trump.\n\n\nArthur Sullivan is co-owner of Brady Sullivan properties, which owns some of the most iconic properties in the state of New Hampshire, including City Hall Plaza, Brady Sullivan Plaza, and Brady Sullivan Tower.\n\n\nSam Tamposi Jr. is President of the Tamposi Company, a well-known Republican Party activist, member of the Rivier College Board of Trustees, and Heritage Club Member of the Boys and Girls Club of Greater Nashua. His father, Sam Tamposi Sr., was part owner of the Boston Red Sox.\n\n\nMr. Trump visited New Hampshire again today where he had a capacity crowd at his rally in Windham, New Hampshire and has several more visits planned prior to February 9th. Mr. Trump continues to hold a commanding lead in all New Hampshire state polls as well as nationally, as the first in the nation primary contest approaches. The most recent poll, just released by Monmouth University, shows Mr. Trump with a wide, double digit point lead over his closet rival with 26% support. Also, recently released polls from NBC/WSJ, FOXNews, and NH1 show similar, double digit leads for Mr. Trump who continues to be the definitive front runner for the Republican nomination for President of the United States.  \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-is-first-to-file-to-be-on-the-ballot-in-west-virginia", "text": "Trump Campaign Files a Full Slate of Convention Delegates(New York, NY) January 11th, 2016 – Today Donald J. Trump for President Inc. announced the campaign has officially filed to be on the ballot of the May 10th, 2016 West Virginia Republican Presidential Primary. The Trump campaign also filed a full slate of delegates for the Republican National Convention, which will take place in Cleveland July 18-21, 2016. The Trump campaign filing is the first of any candidate and was submitted weeks ahead of the deadline. Mr. Trump stated, “It is my honor to be on the ballot in West Virginia. We have received tremendous support from so many people in the Mountain State and are leading in all the polls by double digits. In fact, my support in West Virginia is higher than in any other state in the nation. I look forward to visiting soon and sharing more about my message and my plans to Make America Great Again!” Mr. Trump’s campaign also filed a full slate of delegate candidates for the Republican National Convention. The delegate candidates will also appear on the ballot of the May 10 primary. Two of the delegate candidates, State Senator Mark Maynard (Wayne County) and former West Virginia GOP Chairman Mike Stuart (Kanawha County), will serve as co-chairs of the campaign’s leadership team in the state.The slate of delegates committed to Mr. Trump includes current and former state legislators, activists and party leaders from every region of the state.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-expansion-of-georgia-campaign-operation", "text": "\n\nTrump Campaign Hires Four Additional Staffers and Announces Cobb County, GA Grand Opening \n\n(New York, NY) January 7th, 2016 – Today Donald J. Trump for President Inc. announced four new hires and a new office Georgia where Mr. Trump has had tremendous crowds and continues to lead all state polls by double-digits.\n\n\nMr. Trump says, “The people of Georgia are incredible and the response to my message has been amazing. We have built a great team and with their help, we will Make America Great Again!”\n\n\nRyan Caudelle, Deputy Director, oversees the statewide political operation and administration. He has an MBA and previously worked at Barclays and has experience working for Georgia Governor Nathan Deal and Congressman Jack Kingston.\n\n\nCharlice Byrd, Field Coordinator, oversees the North Georgia Field Operations. She is a former State Representative, graduate of the Coverdell Leadership Institute and veteran of several national, state and local campaigns and was selected as one of the Top 25 Most Influential Asians in Georgia by Asian Times Magazine.\n\n\nGary Wisenbaker, Field Coordinator, oversees the South Georgia Field Operations. He has a Juris Doctor and has been active in Georgia politics since his days as Georgia Young Republican Chairman in 1986. He is a former appointee to the Georgia Student Finance Commission by Governor Sonny Perdue and veteran of several state and local campaigns.\n\n\nJeanne Seaver, Grassroots Coordinator, oversees the statewide grassroots operation, volunteer onboarding and coalition outreach. She is the co-founder of the Savannah TEA Party and President of the Georgia Grassroots Coalition and veteran of Republican grassroots activities. She is also a graduate of the Coverdell Leadership Institute, former Chatham County Co-Chair for David Perdue for U.S. Senate and Chair for Herman Cain for President.\n\n\nAdditionally, the campaign has opened a Georgia Headquarters in Cobb County at 1000 Circle 75 Parkway, Suite 700, Atlanta, GA 30339 and will be hosting a Grand Opening, Saturday, January 9th at 10:00 a.m. The Georgia Trump campaign is led by State Director Brandon Phillips.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-campaign-announces-louisiana-leadership-team", "text": "\nTrump Campaign Continues to Build Beyond Early Primary States\n\n\nJay Batt currently serves as Chairman of the Allstate Sugar Bowl and previously served as President of the Sugar Bowl Committee, New Orleans Parish Council Member, owner and operator of multiple businesses nationwide, and deputy chairman of the Republican state central committee, among other accomplishments.\n\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-expansion-of-texas-campaign-operation", "text": "Trump Campaign Hires Four Additional Staffers\n\n(New York, NY) January 6th, 2016 - Donald J. Trump for President Inc. announced four new hires in the state of Texas where Mr. Trump has visited several times and continues to lead in almost all state polls.\n\nMr. Trump stated, “I love the people of Texas and I am proud to have such a strong team in place in this important state as we work together to Make America Great Again!”\n\nJoshua Jones, Deputy Director, oversees the statewide grassroots operation and administration. He has an MBA, is an engineer by trade and a veteran of campaigns at the highest levels including U.S. Senate, Governor and U.S. Congress races.\n\nEric Mahroum, Field Director, oversees Dallas/Fort Worth and north Texas. A former candidate for State Board of Education, Eric, along with his extensive business background, brings strong grassroots organization skills and keen political knowledge, having worked on several campaigns for President, U.S. Senate, Governor and Congress.\n\nKayla Hensley, Field Director, oversees the Houston area and east Texas. She is a social media expert and helped organize grassroots volunteers across the state via one of the first pro-Trump Facebook groups, which led to the campaign tapping her to join the campaign full time.\n\nPaul Janiczek, Field Director, oversees central, south and west Texas. A veteran of the U.S. Navy and graduate of U.S. Naval War College, Paul is a former State Director for Concerned Veterans of America, served in several roles in the U.S. State Department and mobilized veterans for McCain for President in 2008.\n\nThe Trump Campaign’s Texas operation is headquartered in Austin (815-A Brazos Street PMB 403 Austin, TX 78701) and led by State Director Corbin Casteel. \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-endorsement-of-andrew-hemingway", "text": "\nTrump Campaign Continues to Expand New Hampshire Team Ahead of February 9th Primary\n\n\n(New York, NY) January 5\nth, 2016 – Today Donald J. Trump announced that he has received the endorsement of former Ted Cruz supporter and respected New Hampshire activist and entrepreneur Andrew Hemingway. Hemingway will play a key role in assisting the campaign as a state co-chair in New Hampshire.\n\n\nMr. Trump stated, “I love the people of New Hampshire and have made many great friends over the years. We have a great team in place, the biggest crowds and continue to lead all the polls. Andrew is a great addition and with his help we will win New Hampshire and Make America Great Again!”\n\n\nHemingway served as the state director for Newt Gingrich’s 2012 presidential campaign, and he is a former chair of the New Hampshire Republican Liberty Caucus. He is currently the CEO of TheMountain.com, a New Hampshire-based business that employs over 200 Granite Staters.\n\n\nHemingway added that, “Mr. Trump built the most robust grassroots network out of all candidates in the race. He has engaged thousands of Granite Staters who had never found a reason to participate in the past. He is earning the support of these voters with the straight-talk they have been seeking for years. Mr. Trump has the business experience and leadership abilities that the other candidates in this race lack. We cannot afford to elect another Washington insider that promises one thing and does another.”\n\n\nTonight Mr. Trump will be in Claremont, New Hampshire for a rally, where Mr. Hemingway will speak during the pre-program, and last night Mr. Trump visited nearby Lowell, Massachusetts where he hosted a record crowd of nearly 10,000 people.  \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-files-to-be-on-the-ballot-in-illinois", "text": "\n(New York, NY) January 4th, 2016 – Today Donald J. Trump for President Inc. announced the campaign has officially filed to be on the ballot of the March 15, 2016 Illinois Republican Presidential Primary. Mr. Trump’s campaign also filed a full slate of delegates for the Republican National Convention which will take place in Cleveland July 18-21, 2016. \n\n\nMr. Trump stated, “It is my honor to be on the ballot in Illinois and to file a full slate of delegates. We have received tremendous support from so many people in Illinois, we are leading in all the polls and have had the largest crowds. With the support of the people of Illinois, and around the country, we will Make America Great Again.”\n\n\nMr. Trump has a definitive lead in all national and state polls where most recently he was leading in Illinois by a wide, double digit margin.\n\n\nTonight, Mr. Trump will campaign in Massachusetts before heading to New Hampshire, Vermont, South Carolina, and Iowa later in the week.\n\n \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-unveils-first-campaign-television-ad-with-significant-buy-i", "text": "Ad Focuses on Key Messages Including Illegal Immigration and National Security(New York, NY) January 4th, 2016 - Today Donald J. Trump unveiled his first campaign ad, which will air in the early states of Iowa and New Hampshire beginning Tuesday, January 5th. Mr. Trump will be spending at least $2 million dollars per week, with $1.1 million allocated to TV in Iowa and close to $1 million spent on TV in New Hampshire.Mr. Trump said, “I am leading in every poll by wide, double digit margins. We have tremendous crowds, incredible support from all over the country and I am $35 million dollars under budget. We have spent the least amount of money and have the best results and this is the kind of thinking the country needs. I am very proud of this ad, I don’t know if I need it, but I don’t want to take any chances because if I win we are going to Make America Great Again.”The initial ad focuses on the key issues of Mr. Trump’s campaign including national security, illegal immigration and his vision to Make America Great Again. Mr. Trump has previously run radio ads in the first three primary states and will continue to do so with a new radio ad also premiering this week featuring Kathryn Gates-Skipper, the first female Marine to serve in combat operations. Kathryn endorsed Mr. Trump at his Sarasota rally in November.Also airing this week, is a new radio ad in South Carolina featuring Nancy Mace, the first female graduate of The Citadel.Mr. Trump continues to lead all national and state polls and will travel to Lowell, Massachusetts, Claremont, New Hampshire, Burlington, Vermont, Rock Hill, South Carolina, multiple stops in Iowa and Reno, Nevada for rallies this week.Please visit DonaldJTrump.com to view the ad, which can be seen here:http://www.donaldjtrump.com/media/great-again-tv-spot", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-announces-statewide-leadership-in-all-36-congressional", "text": "\n(New York, NY) December 29th, 2015 – Today Donald J. Trump for President Inc. announced its Texas operation continues to expand, most recently amassing a statewide organization in all 36 Congressional Districts in over 50 counties. These counties account for nearly 80% of the Republican Primary vote in the state. Hundreds of leaders have signed on to Co-Chair their Congressional District to help Donald Trump carry their district and the state.\n\nMr. Trump stated, “I love Texas and have visited many times. We have had tremendous crowds, are winning all the polls and have met some terrific people who truly want to Make America Great Again. With their support, we will make the country better than ever before.”\n\nGeorge M. Clayton, Congressional District Co-Chair for Trump for President in Texas stated, “Donald Trump is strong for America. He is truthful. He is dedicated and loyal to the Constitution. He supports a strong military. He has the overall goodwill of the American people as his number one priority. I heartily and enthusiastically support and endorse Donald Trump for President of the United States. ”\n\nDr. Bas Nair from Houston, Congressional District Co-Chair for Trump for President in Texas added, “I waited four long years, 34 years ago to come through the proper immigration channels. Mr. Trump is right on with his immigration policy and is the only candidate who is brave enough to say what our country really needs.”\n\nDaren Garcia Cantu of McAllen, Congressional District Co-Chair for Trump for President in Texas says, “I am the son of two Individuals that came to America to live a better life and pursue the American Dream, They were able to do this legally and my father even became a naturalized citizen. Mr. Trump is the only candidate that does not flip flop. Political correctness is ruining this country!”\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-louisiana-state-director-ryan-lambert", "text": "\nTrump Campaign Continues to Build Beyond Early Primary States\n\n\n(New York, NY) December 23rd, 2015 – Today Donald J. Trump announced new hire Ryan Lambert will serve as Louisiana State Director. Earlier this month, Mr. Trump qualified to be on the ballot for the March 5th Louisiana Presidential Preference Primary. Lambert will oversee the Trump Campaign operation for the entire state.\n\n\nMr. Trump said, “I am pleased to welcome Ryan to the team. We already have tremendous grassroots support across the state of Louisiana and I look forward to visiting soon and sharing my vision to Make America Great Again!”\n\n\nRyan Lambert previously worked with the campaigns of Congressman Charles Boustany in 2012 and Congressman Garret Graves in 2014. He also handled numerous campaigns throughout Louisiana and other parts of the south.\n\n\nRyan added, “It is a great honor to serve as Mr. Trump’s State Director in Louisiana. He has created a movement and I am proud to be part of it as we all work to ensure Mr. Trump is the Republican nominee for President of the United States. He is a proven leader with unparalleled success in numerous industries. He is the only one who will Make America Great Again.”\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-campaign-enlists-support-in-over-200-communities", "text": "Trump Campaign Enlists Support in Over 200 Communities\n(New York, NY) December 22nd, 2015 - Today Donald J. Trump announced Town Chairs in over 200 communities in New Hampshire. Mr. Trump remains the national front-runner for the Republican nomination for President of the United States and maintains a wide, double digit lead in all recent New Hampshire polls.\n\nMr. Trump stated, “It is a great honor to have such incredible grassroots support across the state of New Hampshire. We have tremendous poll results and crowds and I look forward to visiting many times over the next several weeks. With the support of each Town Chair and so many others, we will Make America Great Again!”\n\nThis is yet another example of Mr. Trump’s extensive support in the first in the nation primary state. The Trump Campaign has offices in Manchester, Keene, Newmarket and Colebrook, over a dozen paid staffers and thousands of volunteers helping to share Mr. Trump’s vision to make the country better than ever before.\n\nMr. Trump will return to New Hampshire on Monday, December 28th to host a rally in Nashua. Most recently, Mr. Trump visited Portsmouth to receive the coveted endorsement of the New England Police Benevolent Association, where he was joined by hundreds of officers supporting his campaign for President.\n\nNew Hampshire Town Chairs:\n\nAdelina Winfield of Hennikerin in Merrimack County\n\nAl Constant of Gilmanton IW in Belknap County\nAl Letizio Jr. of Rockingham County in Windham, NH \nAlan Balog of Starkin Coos County\n\nAlex Scott of Canterbury in Merrimack County\n\nAlexis Chechowitz of Hampton Beach in Rockingham County\n\nAllie McIntosh of Chichester in Merrimack County\n\nAmy Brooks of Stewartstown in Coos County\n\nAndrew Disbrow of Grafton in Grafton County\n\nAndrew Horvit of Londonderry in Rockingham County\n\nAndrew Scolaro of Center Barnstead in Belknap County\n\nAngelina Falcon of Bristol in Grafton County\n\nAnne Miller of New Castle in Rockingham County\n\nAnthony Campello of East Kingston in Rockingham County\n\nAshley Custance of Campton in Grafton County\n\nBarbara Ferdinando of Manchester in Hillsborough County\n\nBarbara Kresse of Croydon in Sullivan County\n\nBarbara Maloney of Stratham in Rockingham County\n\nBen Soussan of Hampton in Rockingham County\n\nBill Schroeter of Unity in Sullivan County\n\nBob Heghmann of Wolfeboro in Carroll County\n\nBrandon Fields of Lancaster in Coos County\n\nBrenda Beauregard of Center Ossipee in Carroll County\n\nBrenda Case of Alexandria in Grafton County\n\nBrenna Cavanaughof Portsmouth in Rockingham County\n\nBrian Fulwood of Gilsum in Cheshire County\n\nBrian Mitchell of Rye Beach in Rockingham County\nBruce Breton of Rockingham County in Windham, NH \nBruce Kozikowski of South Sutton in Merrimack County\n\nCarol Ann Mcfarland of Chester in Rockingham County\n\nCarol Vincelette of Benton in Grafton County\n\nCatherine Hall of Deerfield in Rockingham County\n\nCharles Colbert of Brookline in Hillsborough County\n\nCheryl Jones of Claremont in Sullivan County\n\nChip Kelley of Rye in Rockingham County\n\nChris Dawe of Hampton Falls in Rockingham County\n\nChris Fela of Barrington in Strafford County\n\nChris Gilman of Gorham in Coos County\n\nChris Kachanian of Atkinson in Rockingham County\n\nChris Linker of Madbury in Strafford County\n\nChristopher Carter of Deering in Hillsborough County\n\nChristopher Mazerall of Jaffrey in Cheshire County\n\nChuck Beauregard of Troy in Cheshire County\n\nCindy Fitzgerald of Bethlehem in Grafton County\n\nColin Cambo of Rollinsford in Strafford County\n\nCorey Garabedian of Salem in Rockingham County\n\nCrae Hoffmaster of Kensington in Rockingham County\n\nCraig Gidley of Hillsborough in Hillsborough County\n\nDan Stolworthy of South Hampton in Rockingham County\n\nDana Cullen of Ossipee in Carroll County\n\nDavid Brock of Pinardville in Hillsborough County\n\nDavid Brown of Fremont in Rockingham County\n\nDavid Gattuso of Deerfield in Rockingham County\n\nDavid Prescott of Ossipee in Carroll County\nDeb Ackerman of Berlin in Coos County\nDebbie Balog of Jefferson in Coos County\n\nDebbie Demarais of Hudson in Hillsborough County\n\nDebra Reilly of Alstead in Cheshire County\n\nDeena Forcier of Sullivan in Cheshire County\n\nDennis Romeo of Hooksett in Merrimack County\n\nDerek Paul of Swanzey in Cheshire County\n\nDiane Abdy of Bristol in Grafton County\n\nDick Wentzel of Newport in Sullivan County\n\nDon Bacon of Newfields in Rockingham County\n\nDon Medbury of Dover in StraffordCounty\n\nDonald Dotsie of Stratford in Coos County\n\nDonald Murphy of Mont Vernon in Hillsborough County\n\nDonna Horvit of Londonderryin Rockingham County\n\nDorothy Habben of Hopkinton in Merrimack County\n\nDoug Lambert of Gilford in Belknap County\n\nDrew Carter of Sutton in Merrimack County\n\nDuncan Britton of Auburn in Rockingham County\n\nEd Bissonof Andover in Merrimack County\n\nEddie Gargiulo of Newmarket in Rockingham County\n\nElisabeth Malboeuf of Mason in Hillsborough County\n\nElizabeth Varney of Alton in Belknap County\n\nEllen Cuccio of Conway in Carroll County\n\nEllen Williams of Newbury in Merrimack County\n\nEric Corum of Gilmanton in Belknap County\n\nEric Kelso of Canterbury in Merrimack County\n\nEric Miller of New Castle in Rockingham County\n\nErik Wallof Peterborough in Hillsborough County\n\nEvan Nelson of Littleton in Grafton County\n\nFrancine Monica of Wentworth in Grafton County\n\nFred Gilman of Gorham in Coos County\n\nGary Brown of Raymond in Rockingham County\n\nGary Fouts of Danbury in Merrimack County\n\nGeorge Carmichael of Rindge in Cheshire County\n\nGeorgia Palmieri of Keene in Cheshire County\n\nGerard Deshaies of Portsmouth in Rockingham County\n\nGil Towne of Derry in Rockingham County\n\nGlen Hyslop of Milton in Strafford County\n\nGordon Gowen of Acworth in Sullivan County\n\nGriffin Gamache of Durham in Strafford County\n\nHarold Moller of Sunapee in Sullivan County\n\nHeidi Buxton of Pittsfield in Merrimack County\n\nHelen Molloy of Lincoln in Grafton County\n\nHolly Young of Plymouth in Grafton County\n\nHon. Al Baldassaro of Londonderry in Rockingham County\n\nHon. Dan Itse of Fremont in RockinghamCounty\n\nHon. Dan Tamburello of Londonderry in Rockingham County\n\nHon. George Lambert of Litchfield in Hillsborough County\n\nHon. Joe Pitre of Farmington in Strafford County\n\nHon. John Hikel of Goffstown in Hillsborough County\n\nHon. Laurie Pettengill of Bartlett in Carroll County\n\nHon. Peter Varney of Alton in Belknap County\n\nHon. Steven J Woitkun of Danville in Rockingham County\n\nHon. Tom Boriso of Meredith in Belknap County\n\nHon. Werner Horn of Franklin in Merrimack County\nJames King of New Ipswich in Hillsborough County\nJames Yamartino of Bartlett in Carroll County\n\nJane Quale of Hanover in Grafton County\n\nJanet Bunnell of Kensington in Rockingham County\n\nJason Rella of Colebrook in Coos County\n\nJason Udeen of Surry in Cheshire County\n\nJay C Davey of Plaistow in Rockingham County\n\nJayne Fiore of Epping in Rockingham County\n\nJeannie Hines of Rumney in Grafton County\n\nJeff Hiattof Newington in Rockingham County\n\nJeff Odhner of Amherst in Hillsborough County\n\nJene Liepold of Grantham in Sullivan County\n\nJennifer Warren of Allenstown in Merrimack County\n\nJill Stocking of Washington in Sullivan County\n\nJim Cropsey of Tilton in Belknap County\n\nJoe Capuzzo of Thornton in Grafton County\n\nJoe Montanaro of Windham in Rockingham County\n\nJoe Silveira of Candia in Rockingham County\n\nJoe St. Jean of Kingston in Rockingham County\nJohn Washburn of Merrimack in Hillsborough County\nJohn Woods of Amherst in Hillsborough County\n\nJolene Levesque of Northwood in Rockingham County\n\nJolene Vogelien of Orford in Grafton County\n\nJoseph Castagnaro of Gilford in Belknap County\n\nJoseph Gasparik of Enfield in Grafton County\n\nJoseph Wysocki of Henniker in Merrimack County\n\nJulianne Griffin of Laconia in Belknap County\n\nJulianne Pagliaruloof Belmont in Belknap County\n\nJulie Newcombe of Bennington in Hillsborough County\n\nKaren Goerndt of Brentwood in Rockingham County\n\nKaren Lewandoski of Tilton in Belknap County\n\nKarl Zahn of Milford in Hillsborough County\n\nKathy Corso of Center Harbor in Belknap County\n\nKathy Duane of Hale's Location in Carroll County\n\nKatie Haughton of Nottingham in Rockingham County\n\nKatrina Kekalo of Lebanon in Grafton County\n\nKelly Frenette of Seabrook in Rockingham County\n\nKen Martell of Groton in Grafton County\n\nKen Patey of Hampstead in Rockingham County\n\nKen Strong of Northumberland in Coos County\n\nKenneth Finn of Greenfield in Hillsborough County\n\nKevin Bazan of Winchester in Cheshire County\n\nKevin Genest of Barnstead in Belknap County\n\nKevin Roy of Barrington in Strafford County\n\nLana Miller of Plaistow in Rockingham County\n\nLaura Soussan of Hampton in Rockingham County\n\nLaurie Caruso of Greenland in Rockingham County\n\nLois DeYoung of Brentwood in Rockingham County\n\nLori Davis of Weare in Hillsborough County\n\nLorrie Clark of Newton in Rockingham County\n\nLouise Bacon of Newfields in Rockingham County\n\nLuke Sacher of Fitzwilliam in Cheshire County\n\nMadelene Beaulieu of Hollis in Hillsborough County\n\nMalia Boaz of Westmoreland in Cheshire County\n\nMarc Normandin of Stoddard in Cheshire County\n\nMaria Noel of Ashland in Grafton County\n\nMarilyn Stacy of Tuftonboro in Carroll County\n\nMarilyn Walsh of Bethlehem in Grafton County\n\nMark French of Bridgewater in Grafton County\n\nMark Kilbane of Exeter in Rockingham County\n\nMark Morrison of Stewartstown in Coos County\n\nMarlene Smith of Bow in Merrimack County\n\nMartin Judd of Hill in Merrimack County\n\nMary Ann Adams of Holderness in Grafton County\n\nMatt Crow of New Boston in Hillsborough County\n\nMatt Pitaro of Bedford in Hillsborough County\n\nMaurice Glaude of Francestown in Hillsborough County\n\nMelanie Benton of New Hamptonin Belknap County\n\nMelissa Boccelli of Sandown in Rockingham County\n\nMichael Bushway of Contoocook in Merrimack County\n\nMichael Parker of Piermont in Grafton County\n\nMichael Parrott of Surry in Cheshire County\n\nMichael Weston of Hinsdale in Cheshire County\n\nMichele Autenzio of Moultonborough in Carroll County\n\nMichele Paradiso of Rochester in Strafford County\n\nMichelle Perron of Hampton in Rockingham County\n\nMonica Charpentier of Hooksett in Merrimack County\nNancy Weston of Hinsdale in Cheshire County\nNate Lynch of Walpole in Cheshire County\n\nNeal Burns of New Durhamin Strafford County\n\nNicholas Mignanelli of Campton in Grafton County\n\nNorman Brooks of Stewartstown in Coos County\n\nPatricia Cook of Haverhill in Grafton County\n\nPatrick Mooney of Wakefield in Carroll County\n\nPaul Barnet of Sanbornton in Belknap County\n\nPaul Fisher of New Ipswich in Hillsborough\n\nPaul Garabedian of Salem in Rockingham County\n\nPaul Morrissette of Loudon in Merrimack County\n\nPaul Nagy of East Andover in Merrimack County\n\nPaul Rella of Columbia in Coos County\n\nPaul Smalley of Hebron in Grafton County\n\nPaul Sodano of Bristol in Grafton County\n\nPaul Whitney of Harrisville in Cheshire County\n\nPaula Johnson of Nashua in Hillsborough County\n\nPaula Malmborg of Penacoook in Merrimack County\n\nPerry Wagner of Littleton in Grafton County\n\nPhil Riendeau of Chesterfield in Cheshire County\n\nPhyllis Buatti of Barnstead in Belknap County\n\nPriscilla Root of Ashuelot in Cheshire County\n\nRalph Collins of Milan in Coos County\n\nRalph DeRosa of Albany in Carroll County\n\nRay Dewis of Woodstock in Grafton County\n\nRaymond Heelan of Wilmot in Merrimack County\n\nRebecca Gifford of Lee in Strafford County\n\nRex Jenna of Warner in Merrimack County\n\nRich Autenzio of Moultonborough in Carroll County\n\nRich Innie of Hooksett in Merrimack County\n\nRichard Bettcher of North Hampton in Rockingham County\n\nRichard Cook of Somersworth in Strafford County\n\nRick Dube of Pittsburg in Coos County\n\nRick Nadick of Errol in Coos County\n\nRita Falwell of Hampton Beach in Rockingham County\n\nRob Peterson of Eaton in Carroll County\n\nRobert Campbell of Wilton in Hillsborough County\n\nRobert Loeser Jr. of Salisburyin Merrimack County\n\nRobert Miller of New Castle in Rockingham County\n\nRobert Willis of Marlow in Cheshire County\n\nRonald Tatro of Ashuelot in Cheshire County\n\nRussell Wyatt of Whitefield in Coos County\n\nSally Bourbeau of Danville in Rockingham County\n\nSandra Laughy of Northfield in Merrimack County\n\nSandy Woodmansee of Epping in Rockingham County\n\nSarah Florio of Freedom in Carroll County\n\nScott Brown of Webster in Grafton County\n\nScott Innie of Hooksett in Merrimack County\n\nSen. Dick Ferdinando of Manchester in Hillsborough County\n\nSen. Frank Sapareto of Derry in Rockingham County\n\nShelly Manougian of Rye in Rockingham County\n\nShirley Hurd of Derry in Rockingham County\n\nStephen Keith of Pembroke in Merrimack County\n\nSteve Astrauas of Pelham in Hillsborough County\n\nSteve Digiovanni of Middleton in Strafford County\n\nSteve Walker of Charlestown in Sullivan County\n\nSusan Coulombe of Bristol in Grafton County\n\nSusanne Montanaro of Windham in Rockingham County\n\nTammy Coutts of Marlborough in Cheshire County\n\nTammy Sinapius of Effingham in Carroll County\n\nTara Hooper of Warren in Merrimack County\n\nTerry Wagner of Littleton in Grafton County\n\nThomas Kawczynski of Lisbon in Grafton County\n\nTim Dillon of Concord in Merrimack County\n\nTodd Smith of Richmond in Cheshire County\n\nTom Humphrey of Brookline in Hillsborough County\n\nTommy Sharpe of Clarksville in Coos County\n\nValerie Rella of Columbia in Coos County\n\nVicki Wilson of Sandown in Rockingham County\n\nWarren Hurd of Lempster in Sullivan County\n\nWayne Fiore of Epping in Rockingham County\n\nWestley Bailey Jr. of Epsom in Merrimack County\n\nWilliam Hill of Strafford in Strafford County\n\nWilliam Maloney of Stratham in Rockingham County\nZac Mercauto of Tamworth in Carroll County ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-campaign-announces-michigan-state-director-scott-hagerstrom", "text": "\nMr. Trump Announces New Staff Ahead of Grand Rapids Rally\n\n(New York, NY) December 21st, 2015 – Today Donald J. Trump for President Inc. announced new hire Scott Hagerstrom will serve as State Director in Michigan. Hagerstrom is the first hire in the state and will be joined by Mr. Trump Monday night when the campaign holds its second Michigan rally of the cycle in Grand Rapids. \nMr. Trump stated, “I am excited to return to Michigan where we had an incredible rally attended by over 5,000 people in August. Scott will be a great asset to our team as we continue to build infrastructure beyond the early primary states and share my vision to Make America Great Again.” \nScott Hagerstrom is a political consultant and attorney practicing law in the state of Michigan. Scott previously served as the Director of Grassroots and Strategic Engagement for the Coalition Against Higher Taxes and Special Interest Deals Ballot Committee. Scott has also worked in the Michigan House of Representatives and also previously worked as the State Director of Americans for Prosperity-Michigan. He is a lifelong Michigan resident. \nScott added, “It is a great honor to serve as Mr. Trump’s Michigan State Director. He is a proven success with the leadership capabilities to accomplish what those in Washington, D.C. cannot. I believe in his message, his vision and his ability to make our country better than ever before.” \nThe Trump Campaign returns to Michigan Monday night where they are expecting thousands at a rally in Grand Rapids. In August, Mr. Trump hosted over 5,000 people at a rally in Birch Run, Michigan. Additional hires and visits are expected in the near future.\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-budget-deal", "text": "(New York, NY) December 17, 2015 – \"If anyone needed more evidence of why the American people are suffering at the hands of their own government, look no further than the budget deal announced by Speaker Ryan. In order to avoid a government shutdown, a cowardly threat from an incompetent President, the elected Republicans in Congress threw in the towel and showed absolutely no budget discipline.The American people will have to absorb higher deficits, greater debt, less economic liberty and more corporate welfare. Congress cannot seem to help itself in bending to every whim of special interests. How can they face their constituents when they continue to burden our children and grandchildren with debts they will never be able to repay? Our government is failing us, so we must do something about it. Who knows how bad things will be when the next administration comes in and has to pick up the pieces?The only special interest not being served by our government is the American people. It is time we imposed budget discipline by holding the line on spending, getting rid of waste, fraud and abuse, and by taking on our debt. To do these things, we need a President who can lead the fight to hold Congress and the rest of government accountable. Together, we can Make America Great Again.\" – Donald J. Trump", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/statement-on-donald-j.-trump-record-of-health", "text": "Download PDFI am proud to share this report, written by the highly respected Dr. Harold Bornstein of Lenox Hill Hospital, stating that I am in excellent health. I am fortunate to have been blessed with great genes --- both of my parents had very long and productive lives. I have truly enjoyed working on the campaign trail with one objective in mind, to Make America Great Again! People have been impressed by my stamina, but to me it has been easy because I am truly doing something that I love. Our country will soon be better and stronger than ever before. – Donald J. Trump\nThe report can be viewed here:\nDonald Trump Health Record PDF\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-new-england-police-benevolent-association", "text": "Trump Campaign Announces Police Endorsement and New Hampshire Youth Coalition Chairman(New York, NY) December 10th, 2015 – Today Donald J. Trump received the coveted endorsement of the New England Police Benevolent Association. Mr. Trump was joined by hundreds of officers who endorsed the front runner for the Republican nomination after a private meeting in New Hampshire Thursday night.Mr. Trump stated, “I am incredibly honored to receive this endorsement. My entire life has been spent defending the police and the incredible job they do. Especially today, they will play an increasingly vital part in making our nation safe. With their support and hard work together we will Make America Great Again.”The New England Police Benevolent Association historically endorses a candidate during the primary season and Mr. Trump was the overwhelming choice by the entire association.Additionally, Bob Burns, Chairman of the New Hampshire Federation of Young Republicans, was selected to serve as Donald J. Trump for President Youth Coalition Chairman.Burns expressed his full support for Donald Trump's bid for the Presidency stating, \"I am confident that Donald Trump is the right man for our country at this time in our nation's history. It is clear Donald Trump is uniting Americans from every political persuasion as he ensures a solid future for my generation and the generations to come.\"Burns has been actively involved with New Hampshire Young Republicans since 2005. His extensive political history also includes serving as the Youth Outreach Director for Huckabee 2008 and Deputy State Director for Newt Gingrich 2012. Additionally, he was elected as Hillsborough County Treasurer.Mr. Trump continues to dominate the polls nationally and in each of the early primary states. According to the latest CNN/WMUR poll released in New Hampshire earlier this week, Mr. Trump maintains his commanding lead with 32% support, an 18 point lead over his closest rival. Mr. Trump is also dominating in Massachusetts with a recent poll showing him with 48% support. The campaign announced the addition of Massachusetts State Director Dean Cavaretta on Monday. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-files-full-slate-of-delegates-for-the-new-hampshire-an", "text": "(New York, NY) December 10, 2015 – Today, Donald J. Trump for President Inc. announced the campaign has officially filed a full slate of state delegates to appear on the ballot in the New Hampshire and Tennessee 2016 Primaries. The Tennessee slate of 82 potential delegates, the most allowed under state law, includes veterans, elected officials and many first time delegates who are drawn to participate in the political process because of Mr. Trump’s candidacy and his vision to Make America Great Again.Mr. Trump stated, “I am so proud with this tremendous showing of support in New Hampshire and Tennessee. We are winning all the polls by huge, double digit margins and have the biggest crowds. With support from each of these incredible delegates and supporters across both states, we will Make America Great Again.”The list of Trump delegates filed in Tennessee includes:State Senators Mae Beavers and Bill Ketron;Shelby County Commission Chairman, Terry Roland;10 members of the GOP State Executive Committee;Kay White, who served as Rick Santorum’s state chair in 2012 when he won Tennessee;Numerous veterans, first time delegates, and former GOP chairs and elected officials.The Trump delegates in Tennessee range in age from 20 years old to 93 year old Beada Corum, who has never registered to vote but did so to be able to vote for Mr. Trump.Trump New Hampshire Delegates Filed:Alfred Baldasaro — 41 Hall Rd, Londonderry, NHJudy Baldasaro — 41 Hall Rd, Londonderry, NHRobert Burns — 1035 South Mammoth Rd, Manchester, NHWillian Cuccio — 186 Randall Farm Rd, North Conway, NHFrederick Doucette — 36 Royal Circle, Salem, NHBarbara Ferdinando — 954 Straw Hill Rd, Manchester, NHRichard Ferdinando — 954 Straw Hill Rd, Manchester, NHLouis Gargiulo —21 Linden Rd, Hampton Falls, NHJarold Gregory Johnson - 329 Sawyers Crossing Rd. Swanzey. NHPaula Johnson — 15 Westborn Drive, Nashua, NHGeorge Lambert — 3 Lydston Lane, Litchfield, NHCorey Lewandowski —21 Emerson Rd. Windham. NHSteven Peterson — 24 Penny Lane. Merrimack, NHStephen Stepanek — I Colonel Wilkins Rd, Amherst. NHEllen Suprunowicz— I Colonel Wilkins Rd, Amherst, NHDaniel Tamburello —3 Royal Lane. Londonderry. NHMichael Teed - 555 Canal St, Apt #910, Manchester, NHElizabeth Varney — 129 Main St, Alton, NHPeter Varney — 129 Main St, Alton. NHJoshua Whitehouse — 45 Foxtrot Drive. Farmington, NH", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-announces-texas-women-for-trump-coalition-ove", "text": "Donald J. Trump for President Announces Texas Women for Trump Coalition Over 100 Texas Women Lead Statewide Group(New York, NY) December 10th, 2015 - The Donald J. Trump for President campaign is proud to announce the Leadership Committee of the Texas Women for Trump Coalition. This group of over 100 accomplished leaders - Republican women, Tea Party leaders, former city officials, business leaders, entrepreneurs, community leaders, and philanthropists support Donald Trump and are committed to working to help him carry Texas.Mr. Trump said, \"It is a great honor to receive the endorsement of so many strong, accomplished women in the great state of Texas. Their leadership will help us win this important state on March 1st, 2016. With their support and the support of so many other women across the country, we are going to Make America Great Again.\"The Texas Women for Trump Coalition is led by many of the best, longtime Republican organizers all across Texas, as well as many newcomers who have been inspired by Mr. Trump's message of securing our border, taking care of our Veterans and true tax reform.\"I always knew Donald Trump would be the answer to the desperate situation our country is enduring. And now with almost $20 trillion in debt, it is critical that we take Mr. Trump all the way to the White House and fix this mess,\" said Caro Delgado of Houston, a Mexican-born businesswoman and proud American citizen who recently earned her U.S. citizenship.\"Donald J. Trump is the only candidate that will salvage this country and make things great again because he can't be bought. He is the only choice!\" said Gina O'Briant of Dallas, Statewide Co-Chair of Texas Women for Trump and Congressional District 3 Co-Chair.\"I am proud to support Donald Trump for President of the United States. Washington is broken and it's going to take a leader who knows how to rebuild this country to make it great again. And Mr. Trump is that leader,\" said Pamela Martin Duarte of Dallas, a 5th generation Texan and co-star of NBC Universal's hit TV show \"Big Rich Texas.\"\"I have worked in Republican politics since my days of helping Ronald Reagan, and I have not seen such excitement for a Republican for President since then. I am thrilled to be on Mr. Trump's campaign leadership team and will do all I can to help him win Texas!\" said Mary Sue McCarty of Mesquite, a longtime Republican activist and organizer.Mr. Trump has visited Texas numerous times throughout his campaign including hosting 20,000 at his Dallas rally in September and most recently in Beaumont where thousands turned out to hear Mr. Trump speak about his vision to Make America Great Again. Texas Women For Trump - Leadership CommitteeKayla Hensley, HoustonMary Sue McCarty, MesquiteGina O'Briant, DallasToni Clawson Randall, KemahCaroline Delgado, HoustonPamela Martin Duarte, DallasLydia Randazzo, Flower MoundShelly Vitanza, BeaumontStacey Newsom, RockwallTammy Harris Nakamura, ColleyvilleCatherine West, HoustonRene Abshire, ConroeShelly Payne, HumbleKatrina Pierson, GarlandLinda Garrido, FriscoDianne Fritz, GranburyDena Miller, DallasJeana McCormick Blackford, HoustonKelly Dearman, CleburneNancy Chritton Rogers, DallasPhyllis Comu, DallasAmber Buchanan, LaBelleCathy Vieth, FriscoDebra Wells, TempleJan Dedrie Pfeffer Strimple, DallasShelly Miller, GranburyHeidi Spooner, AllenSylvia Sommer, HallettsvilleJaton Liner, San LeonStacey Hockstad Messing Sauer, Flower MoundAnita Hutcherson Jones, League CityRhonda Sargent Chambers, DallasDeborah Nettles-Salazar, League CityTricia Vickers, League CityJulie Pitrucha Overhultz, BaytownRobin Collins, KemahCherie Britton, LiverpoolArlene Smart, LibertyRoselyn Peirce, Clear Lake ShoresSandy Lile Garber, Santa FePeggy Arledge, McKinneyHolly Takach, BaytownClaire Durkee Worthington, KemahAlisha Smith, League CityTanah Marie Broussard, Lake JacksonJennifer Miller, DallasMorgan Takach, BaytownAmber King, FriscoMaggie Cooke Kipp, DallasLisa Teets Aurich, League CityGina Ginsburg, DallasDaphne Hallman, FriscoNancy Laskoskie, DickinsonWinnie Freeland Anderson, DallasApril Strunk, DallasMindi Paine, GrapevineAlison Volk, DallasTania Vojvodic, WaxahachieBrooky Bush Sanders Tubb, DallasBrenda White, KellerPam Romero, SpringGinger Grutzius, San LeonRobin Basham-Engbroch, Santa FeClara L. Ferguson, Mattox, HoustonMelissa Painter-Senter, Texas CityLavillas Clawson, BacliffSusan Kaplan Williams, HoustonTiffany Saylor, BurnetStephanie Collier, BacliffGabby Alessi, League CityDarlene Graham Campbell O'Brien, DallasLacey Gammons, DallasD'Andra Simmons, DallasJennifer Paris, FriscoDaretha Paul, DallasKathy Friston Collier, BaycliffPolly Boggus Wright, AustinAmy Jackson, HoustonVictoria Romero-Broderick, HoustonTracey Templet Honish, LaMarqueTerri Provencal, DallasTanya Houston, Lake JacksonLinda Steiber Brown, KatyMary Jo Hansen-Lindsay, Santa FeAbril Overgarrad, El PasoCarol Price, League CityTiffany Nicole Randazzo, FriscoSandra Pizanie-Dunn, League CityMary Jo Hansen, Lindsay, Santa FeJamie Kell Bond, DallasDebbie Freeland Hranicky, CoppellEmily Tang, AddisonCheryl Mason, Santa FeClaudetta Newsom, Mt. VernonKimberley Newsom, Mt. VernonAngie Strawn, RowlettRegan Hicks, Mt. VernonTiffany Gilbert Jackson, Dallas Karen VanLandingham, Mesquite", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-statewide-leadership-team-in-oklahoma", "text": "Donald J. Trump Announces Statewide Leadership Team in OklahomaMr. Trump is now Officially on the Ballot in Oklahoma as he Expands his Support Across the State(New York, NY) December 8th, 2015 - Today Donald J. Trump announced his Oklahoma Statewide Chairmen and a growing number of endorsements for his campaign for President of the United States. The list includes elected officials, Veterans, small business owners, and county leaders. Additionally, the Trump campaign has announced Mr. Trump has officially qualified for the ballot in the state of Oklahoma.Mr. Trump said, \"I am proud to have the support of so many community leaders in Oklahoma and it is an honor to be on the ballot. I visited in September and was overwhelmed by the enthusiasm at the State Fair where over 20,000 people attended my speech. With the support of those people and my team, we will Make America Great Again!\"Co-Chairing Mr. Trump's campaign in Oklahoma is Mr. Bob Mills and Mr. Dan Keating. Bob Mills has been operating Bob Mills furniture in Oklahoma since 1972. His operations have now expanded into Texas as well. Tulsa native, Dan Keating, is a retired Marine and currently serves as President of Summit Consolidated Group.The list of Oklahoma leaders endorsing Mr. Trump and county coordinators currently includes: Senator Ralph Shortey; Senator Mark Allen; Representative Mike Christian; Representative John Bennett; Representative Mike Turner; Bob Mills; Dan Keating & Kathy Keating; Rodney and Jill Timms; Dr. Sam & Lynn Coury; Bob Dani; Stan Ward; Lisa & Steven Kalman; Ferlin Kearns; Larry Stein; Darren Ward; Angie & Jason Thomas; Lester Claraval; Guy & Jennifer Madison; Beth Marshall; Ronnie Farmer; David Morgan; Orvel Robinson; Ella McDonald; Andy Barber; Suzanne Landess; D.W. & Rochelle Converse; Kelly Gatz; Jo Senske; John Horn; Richard Leathers; Monte Kleiner; Gene Marshall; and April Miller.Mr. Trump has hired State Director Stephanie Milligan and Field Director Ben Keel to lead the campaign's Oklahoma operation. The most recent polls show Mr. Trump with a commanding lead in the state and he looks forward to visiting again soon.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-preventing-muslim-immigration", "text": "(New York, NY) December 7th, 2015, -- Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what is going on. According to Pew Research, among others, there is great hatred towards Americans by large segments of the Muslim population. Most recently, a poll from the Center for Security Policy released data showing \"25% of those polled agreed that violence against Americans here in the United States is justified as a part of the global jihad\" and 51% of those polled, \"agreed that Muslims in America should have the choice of being governed according to Shariah.\" Shariah authorizes such atrocities as murder against non-believers who won't convert, beheadings and more unthinkable acts that pose great harm to Americans, especially women.Mr. Trump stated, \"Without looking at the various polling data, it is obvious to anybody the hatred is beyond comprehension. Where this hatred comes from and why we will have to determine. Until we are able to determine and understand this problem and the dangerous threat it poses, our country cannot be the victims of horrendous attacks by people that believe only in Jihad, and have no sense of reason or respect for human life. If I win the election for President, we are going to Make America Great Again.\" - Donald J. Trump", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-state-directors-in-massachusetts-and-mississippi", "text": "(New York, NY) December 7th, 2015 - Today Donald J. Trump announced the expansion of his campaign team to include state directors in Massachusetts and Mississippi. Dean Cavaretta will serve as Trump campaign State Director in Massachusetts and Dane Maxwell will serve as Trump campaign State Director in Mississippi.Mr. Trump stated, \"I love Massachusetts and have many great friends there, with a recent poll showing me in first place with 48%. The support has been incredible and I look forward to being there again soon and visiting Mississippi for the first time. With support from these two important states we will Make America Great Again!\"Dean Cavaretta has more than 20 years of experience in local and state politics, including serving as special projects director to Lieutenant Governor Polito with the Baker-Polito gubernatorial campaign and advising the Massachusetts Republican Party on high-profile special election races. Most recently he served on the staff of Worcester County Sheriff Lew Evangelidis. Dane Maxwell is a former law enforcement officer, business man and political consultant who has been actively involved in state and local politics for 40 years. During that time, Dane has worked on numerous local and statewide elections developing successful ground operations for Republican candidates.Mr. Trump has held three campaign events in Massachusetts since announcing his candidacy, most recently hosting 12,000 people at a rally in Worcester. Mr. Trump has tremendous support across the state with a Mount Pleasant South Carolina tonight, with thousands expected to attend his campaign rally on the USS Yorktown. Later this week he will travel to Des Moines, Iowa and return to South Carolina on Saturday the 12th.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-qualifies-to-be-on-the-ballot-in-georgia-louisiana-missouri", "text": "(New York, NY) December 4, 2015 - Today Donald J. Trump for President, Inc. announced the campaign has officially qualified to be on the ballot of the March 1st, 2016 Georgia Presidential Preference Primary, the March 5th Louisiana Presidential Preference Primary, the March 15th Missouri Presidential Preference Primary, the March 1st Tennessee Presidential Preference Primary and the March 22nd Utah Republican Party Presidential Caucus. Mr. Trump stated, \"It is my honor to be on the ballot in Georgia, Louisiana, Missouri, Tennessee and Utah. I have visited Tennessee and Georgia many times and we have tremendous crowds and support from the great people there and I look forward to campaigning in Louisiana, Missouri, and Utah soon. We are leading in all the polls and with your help we will Make America Great Again!\" Mr. Trump was in Macon, Georgia on Monday night where thousands attended his second rally in the SEC state. Mr. Trump visited Knoxville, Tennessee on November 16th and hosted 10,000 people at his third major rally in the state where he spoke about foreign policy and homeland security.  Mr. Trump continues to be the definitive front-runner for the Republican presidential nomination with a significant lead in all national polls, including today's CNN/ORC poll, showing Mr. Trump with 36% support and a 20 point lead over his closest rival.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/statement-on-meeting-with-coalition-of-african-american-ministers", "text": "The Coalition of African American Ministers attended a private meeting today with leading Presidential candidate Donald J. Trump at Trump Tower in New York City to discuss issues of faith, job creation, illegal immigration and unifying communities to Make America Great Again. The two-hour meeting was attended by dozens of Pastors and Bishops from across the country.After the meeting Mr. Trump attended a large, impromptu press conference and stated, \"This was an extraordinary meeting of religious leaders many of whom have decided to endorse me--- such a great honor! I look forward to future meetings with the Coalition of African American Ministers.\"Bruce LeVell of Atlanta, GA said \"The misinformation that Pastors and Bishops had heard in the past was quickly dispelled by having an honest discussion with Mr. Trump. He shared with us openly about the needs to help our communities as well as addressed important issues that have been cornerstones of his campaign. It is my honor to endorse Mr. Trump.\"Pastor Darrell Scott, a member of the Coalition who also endorsed Mr. Trump and helped organize the meeting stated, \"Mr. Trump is a real leader and I have great respect for his honesty and candor. He is going to make our country great again and I am proud to endorse his campaign for President.\"The meeting was considered a great success by all those in attendance and many of the attendees were impressed by Mr. Trump's honesty, leadership and vision.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-files-to-be-on-the-ballot-in-arizona-the-commonwealth-of-th", "text": "(New York, NY) November 30, 2015 - Today Donald J. Trump for President, Inc. announced the campaign has officially filed to be on the ballot of the March 22, 2016 Arizona Presidential Preference Election, the March 15 Commonwealth of the Northern Mariana Islands Republican Party Presidential Caucus, the March 12 Presidential Preference Convention in the District of Columbia, the March 1 Vermont Presidential Primary Election and the March 19 U.S. Virgin Islands Republican Caucus.Mr. Trump stated, \"It is my honor to be on the ballot in Arizona, the Commonwealth of the Northern Mariana Islands, the District of Columbia, Vermont and the U.S. Virgin Islands. We are going to make this country better than it has ever been before by building a wall to secure our southern border, creating jobs, strengthening our military, taking care of our Vets and protecting our country. We will Make America Great Again!\"Mr. Trump last visited Arizona this summer when more than 10,000 people attended his rally in Phoenix where he addressed illegal immigration and the importance of border security in order to protect American families and jobs.Mr. Trump has visited Washington, D.C. frequently since announcing his campaign. He employs thousands of people at his D.C based properties including the iconic Old Post Office building on Pennsylvania Avenue, which he is redeveloping into a luxury hotel. The project is under budget and ahead of schedule. Mr. Trump will host a campaign rally in Manassas, Virginia on Wednesday evening and will be a featured speaker at the RJC Presidential Forum in Washington, D.C. on Thursday.Mr. Trump continues to be the definitive front-runner for the Republican presidential nomination with a significant lead in all national polls.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-kathryn-kat-gates-skipper-the-first-woman-marin", "text": "Mr. Trump's Plan to Reform the Veterans Administration Lauded by Tireless Veterans' Advocate(New York, NY) November 28, 2015 - Today Donald J. Trump announced that he is proudly receiving the endorsement of Kathryn \"Kat\" Gates-Skipper, the First Woman Marine in Combat Operations and tireless Veterans' advocate. Gates-Skipper will serve as Co-Chair of Florida Veterans for Donald Trump. Kathryn introduced Mr. Trump at a campaign rally in Sarasota on Saturday.Mr. Trump stated, \"It is a great honor to receive Kat's endorsement. She is a genuine patriot who has worked tirelessly in service to our country and her fellow Veterans. With her support and the support of so many other Veterans across the country, we are going to Make America Great Again.\"Kathryn \"Kat\" Gates-Skipper served 20 years in the U.S. Marine Corps and Reserves. During her two decades of service, she was the First Woman Marine (WM) to stay overnight in the field for combat training, and the first to stay aboard a Ship overnight. She was heavily involved in Operations Desert Shield/Desert Storm and was the First WM in Combat Operations. Kat has received countless awards and recognition for her service including the Marine Corps Distinguished Service Award. A voice and advocate for Veterans, Kat is a life member of the American Legion, VFW and Marine Corps League-where she is the only female and youngest Marine at her local Detachment.\"I believe America needs strong leadership and a man like Donald Trump who will be strong on defense and ensure our Veterans have convenient access to the best quality care,\" said Gates-Skipper. \"This Marine, this Veteran, this woman, this grandmother wants her grandchildren to grow up in an America of hard work with high rewards. That is why I am proud to be the Co-Chair of the Florida Veterans for Donald Trump, and pledge to rally other Veterans behind the only man that will fight for us, Donald J. Trump.\" Mr. Trump has consistently called for better treatment of our Veterans and his support is well documented. Mr. Trump's recently released Veterans Administration Reform plan has received praise from Veterans all over the country.Thousands attended the rally in Sarasota on Saturday, where Mr. Trump returned for the first time since he was honored with the Republican Party of Sarasota Statesmen of the Year award for the second time this spring. He continues to visit Florida regularly where his campaign office is located in Sarasota [1517 State Street, Suite 300], and he owns and operates some of the most iconic properties in the country employing thousands of people. On Monday, Mr. Trump will host an informational meet and greet with many members of the Coalition of African American Ministers. This is not a press event, but a private meeting, after which, a number of attendees are expected to endorse Mr. Trump's campaign for President. Mr. Trump said, \"As a Christian, I have had a tremendous relationship with large numbers of religious leaders, who I greatly respect. I look forward to our meeting.\"", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-demands-an-apology-from-new-york-times", "text": "Donald J. Trump today demanded an apology from the failing New York Times which accused him (during a major speech before 10,000 people in Myrtle Beach, SC) of mocking a reporter’s physical disability when in fact, Mr. Trump does not know anything about the reporter or anything about what the reporter looks like.He was merely mocking the fact that the reporter was trying to pull away from a story that he wrote 14 years ago. Mr. Trump stated, “Serge Kovaleski must think a lot of himself if he thinks I remember him from decades ago – if I ever met him at all, which I doubt I did. He should stop using his disability to grandstand and get back to reporting for a paper that is rapidly going down the tubes.”", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-campaign-announces-southside-central-virginia-leadership-team", "text": "Former Congressman Virgil Goode and Fifth District Leaders Stand with Mr. Trump(New York, NY) November 25th, 2015 - The Donald J. Trump for President Campaign has announced its 5th Congressional District Virginia Leadership Team comprised of Republican and Tea Party leaders as well as current and former elected officials. Mr. Trump stated, \"I am proud to announce these fantastic additions to my Virginia leadership team. We have had tremendous crowds and enthusiasm from supporters across the state. I will do a great job for the people of Virginia and with their help we will Make America Great Again!\"Former Congressman Virgil Goode, will serve as Chairman of the Fifth District Team. Danville Tea Party Chairman and Pittsylvania County Supervisor-elect Ron Scearce and Campbell County Supervisor and GOP Chairman Eric Zehr will serve as Goode's co-chairs.Virgil Goode stated, \"Contrary to the claims of the political consultant class, Mr. Trump is the only candidate who can defeat Hillary Clinton. Millions of Republican voters stayed home in 2008 and 2012 because they felt the GOP represented the interests of Wall Street rather than those of working Americans. Donald Trump is the best candidate to connect with those voters who feel disaffected from both parties.\"Other members of the leadership team include Republican Party of Virginia State Central Committee Member Renee Trent Maxey, local political activist and businessman Jim McKelvey, and Lynchburg-area attorney Susan Oliver.The Trump Campaign announced Hampton Roads Chairman, Gary C. Byler last month as well as additions to the Virginia staff. Mr. Trump has visited Virginia many times throughout his campaign, most recently on October 31st when he announced his Veterans Affairs Reform policy in Norfolk. Mr. Trump will return to Manassas for a rally on Wednesday, December 2nd.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-four-new-hires-in-florida", "text": "Trump Campaign Solidifies Florida Operation as Mr. Trump Surges in Local PollsMr. Trump stated, \"I have created thousands of jobs and own some of the most iconic assets in the state. I love the people of Florida and I am proud to have such overwhelming support and a great staff in place. I look forward to visiting often and working with my team to share my vision to Make America Great Again.\" Jennifer R. Locetta has an extensive background related to data organization and grassroots voter contacts. In 2012, she served as Statewide Data Director for the Republican Party of Florida and worked at the Romney for President Headquarters in Tampa. After four years in the US Navy Ken Mayo began a political career spanning three decades. Most recently, Ken has held positions with American Majority in 2011, AFP in 2012-2013 as Florida's Manager of Field Operations, and Coalition for a Prosperous America (CPA is a national trade association). Additionally, Ken was recruited to be the National Coalitions Director for Convention of States Project.John Pughe has been involved in Florida politics for more than a decade. He served as the Director of Community Affairs for the Northern Palm Beach County Chamber Commerce. Prior to joining the chamber, John served as Legislative Aide to State Representative George Moraitis. He also managed Fort Lauderdale City Commissioner Romney Rogers' municipal campaign and Representative Moraitis' bid for State House. Craig Bachler is a well-known for his grassroots activism, as a volunteer and full time organizer of statewide and national campaigns. He previously served as the Florida Director of Field Operations for Rick Santorum for President, grassroots leader and organizer for Governor Rick Scott, and Pat Buchanan for President in 1992 and 1996 in New Hampshire. The Trump Campaign announced Florida State Director Karen Giorno and Co-Chairs Joe Gruters and Susie Wiles last month. Mr. Trump has visited Florida numerous times throughout his campaign and will return to Sarasota for a rally on Saturday, November 28th. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-north-carolina-state-director-and-deputy-sate-dir", "text": "Trump Campaign Continues to Expand With Two Hires in North Carolina (New York, NY) November 19th, 2015 - Donald J. Trump is continuing to expand his operation across the country announcing two additional hires based in North Carolina. Earl Phillip will serve as State Director and Taylor Playforth will serve as Deputy State Director.Mr. Trump stated, \"It is great to announce the additions of Earl and Taylor who will be valuable members of our operation in North Carolina, where I have been leading in every poll for many months. I look forward to being back in North Carolina soon as I continue to share my vision to Make America Great Again!\"Earl Phillip previously served as the North Carolina African American State Director for the Republican National Committee (RNC), Director of The Frederick Douglass Foundation in the Greater Charlotte Area, Chairman of National Veterans for Republicans Association and Chairman of National Minority Conservative Convention. Earl also consulted for the Director of Minority Engagement for the NCGOP. He is the President and owner of Innovative Consulting Services and the current Director of North Carolina Black Engagement.Earl Phillip said, \"North Carolina is a very strong Republican State that knows and understands upfront, common-sense leadership. Mr. Trump exudes that leadership. I will lead the campaign's effort here in North Carolina to further continue that leadership.\"Taylor joins the campaign as a Raleigh based Republican activist who previously worked with the RNC on voter registration efforts, organized volunteers across the state and lead Republican leadership courses with a focus on galvanizing grassroots support for the North Carolina Republican Party. He has also worked as the Regional Field Director for RNC Deployment.Taylor Playforth added, \"It is truly a privilege to be working alongside Mr. Trump, supporting his vision to Make America Great Again, one that I feel resonates strongly among North Carolina voters. Mr. Trump's record of success and strong leadership is unmatched in this election. I look forward to working with the staff and volunteers here in North Carolina, to make sure his message is heard by the great people of our state.\"Mr. Trump has led all local North Carolina Polls by a significant margin since June and has visited North Carolina on several occasions over the past few months. He will return in December. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-campaign-announces-southwest-virginia-leadership-team", "text": "Trump Team Continues Momentum in Virginia after Submitting 16,000 Petitions for Ballot Access(New York, NY) November 18th, 2015 - The Donald J. Trump for President Campaign has announced its Southwest Virginia Leadership Team comprised of current and former local elected officials and party leaders.Mr. Trump stated, \"It is an honor to be on ballot in the state of Virginia where we have a great staff and team of volunteers in place. I am pleased to announce the Southwest Virginia Leadership Team as we continue to be successful in Virginia and across the country.\"Jack Morgan, the former Chairman of the Ninth Congressional District Republican Party will serve as Chairman of the Ninth District Team. Former Buchanan County Commonwealth's Attorney Tamara Neo will serve as Mr. Morgan's Co-Chair.\"It is an honor to support Mr. Trump, who is a proven leader with unparalleled capabilities and successes. He is undoubtedly the strongest candidate and he continues to generate unprecedented enthusiasm across the state of Virginia and around the country. I look forward to working with the staff and volunteers here in Virginia as we share Mr. Trump's vision to Make America Great Again.\"Other members of the leadership team include former Allegheny/Covington Republican Party Chairman, Derrick Barr, Tazewell County Supervisor, Seth White, Christiansburg Town Councilman, Harry Collins, Richlands Mayor, Jan White, Richlands Vice Mayor, Doug Ratliff and the former Sheriff of Patrick County, Jay Gregory.Virginians in Southwest Virginia have born the brunt of the failed and misguided government policies for years. Overreaching regulations and the Obama Administration's outright war on coal has uprooted and destroyed families and entire communities that have lived in the Blue Ridge Mountains of Virginia for generations.Horrible trade deals such as NAFTA, which Mr. Trump has consistently opposed, have shipped manufacturing jobs overseas, and crippled the area economically. America, now more than ever, needs a true leader with proven ideas and real world experience to fix Washington. Mr. Trump is the only one who can Make America Great Again.Mr. Trump has visited Virginia several times since launching his campaign in June and was recently the first Republican candidate to qualify for ballot access after submitting 16,000 signatures. Last month, Mr. Trump hosted a capacity crowd at a rally in Richmond and weeks later unveiled his Veterans Affairs Reform Plan in Norfolk, Virginia with thousands in attendance at the USS Wisconsin. Mr. Trump owns the award winning Trump Winery in Charlottesville, Virginia where he employs hundreds of people and visits often. He will return to Virginia early next month.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-airs-new-radio-ads-in-iowa-new-hampshire-and-south-carolina", "text": "Mr. Trump and Supporters Echo Key Campaign Messages in Early States and Beyond with New Radio Spots(New York, NY) November 18th, 2015 - Today Donald J. Trump for President, Inc. began airing new radio advertisements in Iowa, New Hampshire and South Carolina. The ads are part of a $300,000 buy announced earlier this month and feature Mr. Trump, Campaign Co-Chair and Iowa Republican Sam Clovis, New Hampshire resident and Trump for President supporter, Louise Buck.With recent events putting an added emphasis on illegal immigration, homeland security, strengthening our military, and defeating ISIS, which have been cornerstones of Mr. Trump's campaign since its inception, the ads highlight his vision, leadership and competency.Mr. Trump stated, \"We must address Islamic terrorism and protect our country first. I will lead by example, as I always have, by vowing to defeat ISIS, stop illegal immigration and the Syrian refugee program, secure our border and bring real change to Washington, D.C. I am the only one who can Make America Great Again.\"The ads stress the need for real change in Washington, D.C. in order to address problems created by the \"all talk, no action politicians\" that have failed American's for far too long. Mr. Trump reminds voters he is self-funding his campaign, unlike all the other republican candidates who are funded by scam Super PAC's, lobbyists, and special interests. His financial independence and proven leadership as a job creator and businessman with a hugely successful career built on real results serve as yet another major distinction.Sam Clovis is an Iowa based conservative serving as national Co-Chair for the campaign. He describes Mr. Trump's candidacy as historical and reinforces Mr. Trump's unparalleled success and proven capability to get things done. Louise Buck is a New Hampshire resident who voices her concerns about homeland security and her support for Mr. Trump as the only choice for a Commander in Chief that will protect American families first.The new advertisements can be heard at:www.donaldjtrump.com/media/category/ads.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/thank-you-to-our-veterans", "text": "November is a great month for Americans. In New York City, we get to look out on Central Park and see the leaves change as we move from the beauty of Fall to a magnificent city cloaked in the chill and briskness of Winter. What we Americans often gloss over is that November is a time for celebrating the very reason we enjoy the freedom, opportunity and prosperity found nowhere else in the world. The reason we are able to live like we do is due to the courage, dedication and sacrifice of those who serve in the armed forces of the United States and to those who have given the last full measure.This November we should pay particular attention to the world situation. All over the world, young men and women who have volunteered to serve this nation are standing watch to protect us from the evil that is focused on taking away all that we value. We have turmoil in the Middle East, unrest in Europe, aggressive expansion in the Pacific Rim and stateless terrorism that threatens every aspect of freedom all across the globe. At no time in history have things been so precarious. Yet, we are able to find the best among us to step forward and take on the traditions and values of generations past, humbly putting on the uniform of this nation. They do so to support and defend the Constitution, not the President, the Congress or even the flag. They swear to defend an idea and an ideal. As is so subtly stated in the Preamble of our Founding Document, they take on the task \"to secure Liberty for ourselves and our posterity.\"On November 10th, the Marine Corps celebrated its 240th birthday. The Marines were, are and will remain unique in the world, a force that is first to fight and last to come home. The Marines have maintained the highest standards and \"once a Marine, always a Marine,\" captures the sense of duty and honor that permeates every pore of those who have worn the Eagle, Globe and Anchor.Today, we honor all veterans who are and have served in the armed forces. This day has special meaning to so many. Over the years, I have hired thousands of veteransand have found them to be among the very best. They bring no attention to themselves except in their extraordinary professionalism and dedication to whatever they choose to do. Quietly, humbly, and without fanfare, they go about their daily lives being great citizens, good moms and dads, and loving, devoted companions. Bearing up under the terrible damage of war, so many carry on with dignity and grace. We should be so proud of them and we should honor them every day.November is also the month we celebrate the Military Family. Too many of us have never had to be away from family and friends on holidays, birthdays and anniversaries. We have never been asked to risk life and limb in places we cannot even find on a map. We go about our daily lives enjoying freedom, most of the time without ever thinking about what it is like to have a loved one in harm's way. The sacrifice and strength of military families, those who also serve, is so important to morale and welfare of those so far from home.I have lived a full life and have benefited more than most from the opportunities found in this country. I have a loving, healthy family and I am running for President -- only in America. To be where I am, I thank God every day for those who stand on the ramparts of liberty with courage, strength, humility and dignity. So, this November, let's celebrate our veterans and their families and keep them in our prayers. Because of these dedicated Americans, we will be able to Make America Great Again!", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/reforming-the-u.s.-china-trade-relationship-to-make-america-great-again", "text": "REFORMING THE U.S.-CHINA TRADE RELATIONSHIP TO MAKE AMERICA GREAT AGAINDonald J. Trump Addresses Highly Detrimental Currency Manipulation(New York, NY) November 10th, 2015- Donald J. Trump today unveiled his most recent policy on trade reforms, highlighting his position in a Wall Street Journal op-ed entitled Ending China's Currency Manipulation. Mr. Trump has consistently been a strong critic of these tactics that prohibit fair trade and have been largely neglected by the all talk, no action politicians that have failed us for far too long. Mr. Trumpoutlines common sense solutions to address the major threat of currency manipulation and trade reforms that will Make America Great Again.How We Got Here: Washington Politicians Let China Off The HookIn January 2000, President Bill Clinton boldly promised China's inclusion in the World Trade Organization (WTO) \"is a good deal for America. Our products will gain better access to China's market, and every sector from agriculture, to telecommunications, to automobiles. But China gains no new market access to the United States.\" None of what President Clinton promised came true. Since China joined the WTO, Americans have witnessed the closure of more than 50,000 factories and the loss of tens of millions of jobs. It was not a good deal for America then and it's a bad deal now. It is a typical example of how politicians in Washington have failed our country.The most important component of our China policy is leadership and strength at the negotiating table. We have been too afraid to protect and advance American interests and to challenge China to live up to its obligations. We need smart negotiators who will serve the interests of American workers - not Wall Street insiders that want to move U.S. manufacturing and investment offshore.The Goal Of The Trump Plan: Fighting For American Businesses And WorkersAmerica has always been a trading nation. Under the Trump administration trade will flourish. However, for free trade to bring prosperity to America, it must also be fair trade. Our goal is not protectionism but accountability. America fully opened its markets to China but China has not reciprocated. Its Great Wall of Protectionism uses unlawful tariff and non-tariff barriers to keep American companies out of China and to tilt the playing field in their favor.If you give American workers a level playing field, they will win. At its heart, this plan is a negotiating strategy to bring fairness to our trade with China. The results will be huge for American businesses and workers. Jobs and factories will stop moving offshore and instead stay here at home. The economy will boom. The steps outlined in this plan will make that a reality.When Donald J. Trump is president, China will be on notice that America is back in the global leadership business and that their days of currency manipulation and cheating are over. We will cut a better deal with China that helps American businesses and workers compete. The Trump Plan Will Achieve The Following Goals:1. Bring China to the bargaining table by immediately declaring it a currency manipulator.2. Protect American ingenuity and investment by forcing China to uphold intellectual property laws and stop their unfair and unlawful practice of forcing U.S. companies to share proprietary technology with Chinese competitors as a condition of entry to China's market.3. Reclaim millions of American jobs and reviving American manufacturing by putting an end to China's illegal export subsidies and lax labor and environmental standards. No more sweatshops or pollution havens stealing jobs from American workers.4. Strengthen our negotiating position by lowering our corporate tax rate to keep American companies and jobs here at home, attacking our debt and deficit so China cannot use financial blackmail against us, and bolstering the U.S. military presence in the East and South China Seas to discourage Chinese adventurism.The entire plan can be viewed here:www.DonaldJTrump.com/positions/us-china-trade-reform.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-officially-filed-to-be-on-the-ballot-in-new-hampshire", "text": "Donald J. Trump Officially Filed to be on the Ballot in New HampshireMr. Trump Became the First Major Republican Candidate to File for Ballot Access in the First in the Nation Primary State(Concord, New Hampshire) November 4th, 2015 - Donald J. Trump is the first major Republican candidate to officially file to be on the ballot in the first in the nation primary state of New Hampshire. Mr. Trump was joined by hundreds of supporters today at the New Hampshire State House including Secretary of State Bill Gardner and State Representatives Steve Stepanek, Fred Doucette, and Al Baldassaro. Mr. Trump has led every state poll in New Hampshire for more than one hundred days and continues to generate great support and excitement at rallies and town hall events.Mr. Trump will be back in New Hampshire for a town hall event next week on Veteran's Day. The Trump Campaign has an offices located in Manchester, New Market, Colbrook and Keene. With ten paid staffers and thousands of volunteers across the state this is the largest organization of any GOP candidate in New Hampshire this cycle. Most recently, the Trump Campaign released a list of over 1,000 endorsements from supporters representing every demographic across the Granite State. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-officially-qualifies-for-the-ballot-in-nevada-and-kentucky", "text": "(New York, NY) October 29th, 2015 - Today Donald J. Trump for President Inc. has qualified for the ballot in Nevada and Kentucky. Mr. Trump attended a campaign rally in Sparks, Nevada today where he spoke about his vision to Make America Great Again to a capacity crowd. It was the largest campaign event in Nevada by any candidate this cycle and Mr. Trump's second trip to Nevada this month. The Trump campaign also announced it has officially made the ballot in Kentucky. Mr. Trump said, \"I greatly appreciate the professional service shown by the representatives of the states of Nevada and Kentucky. It is my great honor to be on the ballot in these important states and I look forward to Making America Great Again.\" Last week, the campaign announced official ballot access in Maine and Kansas. Mr. Trump delivered yet another commanding performance at the third Republican Presidential debate in Boulder, Colorado last night and will be in Norfolk, Virginia on Saturday delivering a speech to a packed crowd aboard the USS Wisconsin.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-calls-on-all-presidential-candidates-to-return-dark-money", "text": "  (New York, NY) October 23rd, 2015 - Donald J. Trump today announced he sent notices Wednesday disavowing nine unauthorized Super PAC's claiming to support him in his bid for the Republican nomination for President of the United States and subsequently demanding the return of all funds raised. Mr. Trump is self-funding his campaign and is only accepting unsolicited small dollar donations, of which he has received more than 75,000 with an average amount of $50 since launching his campaign. He has repeatedly stated his opposition to the use of Super PAC's and major contributions, which he has consistently turned down since announcing his candidacy and is calling on all candidates to do the same. Mr. Trump stated, \"I am self-funding my campaign and therefore I will not be controlled by the donors, special interests and lobbyists who have corrupted our politics and politicians for far too long. I have disavowed all Super PAC's, requested the return of all donations made to said PAC's, and I am calling on all Presidential candidates to do the same. The character of our country is only as strong as our leaders---the only special interest I am beholden to is the American people and together we will Make America Great Again!\" The letters, produced by Mr. Trump's campaign counsel, were sent on Wednesday, October 21st, 2015 and disavow all fundraising activities based on the confusion said PAC's could potentially cause with supporters across the country. Additionally, the letters request the return of any donations made to date. The letters state, \"We are providing this written notice that your organization is not authorized to use Mr. Trump's name and likeness in connection with its fundraising activities, and we are formally disavowing such activities. Thus, given the invocation of Donald J. Trump in connection with your activities, we ask that you refund all funds received by you in connection with any fundraising undertaken to specifically support and/or done in the name of Donald J. Trump...The campaign has never received money from your PAC, nor does the campaign want any money, services or goods from your committee.\" While Mr. Trump appreciates the incredible outpouring of grassroots support from all over the country he will continue to campaign with integrity, wholly independent of the dark money, donor class perpetuating a broken Washington, D.C. and the all talk, no action politicians propped up by donations representing corporate interests. Mr. Trump's only interest is to represent the people of the United States and Make America Great Again.  ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j-trump-receives-endorsement-of-iowa-state-senator-brad-zaun", "text": "(New York, NY) October 13, 2015 - Today Donald J. Trump is announcing that State Senator Brad Zaun is endorsing his candidacy for the Republican nomination for President of the United States.\n\nMr. Trump stated, \"I am grateful to have the endorsement of Senator Zaun who understands what is at stake in this election. Our country faces tough challenges. But America can be bigger and better than ever before. It will require leadership and a commitment to do what is right even when it may not be popular among the elites in Washington, D.C. who have created more problems than they have solved. With the support of Senator Zaun and so many other conservatives across the country, we will Make America Great Again\".\n\n\nSenator Brad Zaun was first elected to the Iowa Senate in 2004. Before serving in the Iowa Senate, Senator Zaun was the mayor of Urbandale, and owner and operator of Zaun's Trustworthy Hardware. He is currently Director of Sales at Master Dowel in Ankeny. Senator Zaun supported Governor Scott Walker before he dropped out of the race.\n\n\n\"I am proud to endorse Donald J. Trump for the Republican nomination for President of the United States,\" said Senator Zaun. \"For me public service is about doing what is right for the people and following through on what you say you will do. I am confident that Mr. Trump will be that kind of President and that he has the leadership skills necessary to make America great again.\" ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-receives-endorsements-from-oklahoma-leaders", "text": "(New York, NY) October 15, 2015 - Today Donald J. Trump is announcing that 23 Oklahoma leaders are endorsing his candidacy for the Republican nomination for President of the United States. The list highlights the breadth and depth of support Mr. Trump's campaign is receiving and includes State Senators and Representatives as well as small business owners and community leaders. Mr. Trump stated, \"I am grateful to have the support of so many leaders in Oklahoma. These individuals share my concern for our country and know that our challenges are not going to be solved by career politicians in Washington, D.C. With their support and the support of so many other conservatives across the country, we are going to Make America Great Again\".  The list of Oklahoma leaders endorsing Mr. Trump today includes: Senator Ralph Shortey; Senator Mark Allen; Representative Mike Christian; Representative John Bennett; Representative Mike Turner; Bob Mills; Rodney Timms; Dr. Sam & Lynn Coury; Carol & Robert Hefner, IV; Bob Dani; Stan Ward; Lisa & Steven Kalman; Ferlin Kearns; Larry Stein; Darren Ward; Angie & Jason Thomas; Lester Claraval; and Guy & Jennifer Madison. More endorsements from additional Oklahoma leaders will be forthcoming. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-state-directors-in-alabama-and-illinois", "text": "Donald J. Trump Announces State Directors in Alabama and IllinoisMr. Trump Continues to Build a Substantial Campaign Team Across the Country (New York, NY) October 9, 2015 - Today Donald J. Trump announced Chess Bedsole will serve as the Campaign State Director in Alabama and Kent Gray will serve as the Campaign State Director in Illinois.  Mr. Trump stated, \"My message to Make America Great Again has been so overwhelmingly well received, drawing record crowds and putting me in first place in all the polls. America is crippled right now and Washington, DC is broken. Our politicians are not capable or competent enough to fix our problems. We will continue to build out a substantial campaign team that allows us to take our message across the country and continue to share my vision to Make America Great Again\".  Chess Bedsole is a lawyer and municipal judge who lives in Birmingham, Alabama. Mr. Bedsole previously served as Counsel in the United States Senate and was dispatched to Broward County, Florida during the 2000 Presidential election for the recount effort of President George W. Bush. Since returning home to Alabama, Mr. Bedsole has represented numerous candidates and officials across the state as well as the Alabama Republican Party.  Kent Gray is a Republican strategist and attorney in Illinois. During his twenty-five year career, Kent has worked on seven national presidential campaigns, along with numerous state and local races. As an attorney, Kent has handled ballot access issues for dozens of candidates for offices from President of the United States to school board members. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-state-directors-in-florida-texas-and-virginia", "text": "Donald J. Trump Announces State Directors in Florida, Texas and VirginiaMr. Trump Continues to Build a Strategic and Significant National Campaign Team (New York, NY) October 2, 2015 - Today Donald J. Trump announced the expansion of his campaign team with the addition of state directors in Florida, Texas and Virginia. Karen R. Giorno will serve as Trump campaign state director in Florida, Corbin Casteel will serve as Trump campaign state director in Texas and Mike Rubino will serve as Trump campaign state director in Virginia. Last week Mr. Trump announced new campaign hires in Georgia and Tennessee as well as Field Staff in Virginia. The Trump Campaign also has staff in Iowa, New Hampshire, South Carolina, and Nevada. Mr. Trump stated, \"We are in this to win it. These staff additions are the continuation of our plan to have a strategic and significant presence across the country. I am pleased that my vision to Make America Great Again has generated so much support and such a positive response that we are leading in all the polls. By adding to our team in these critical states we will be able to build on the tremendous support we have received and share our message with even more voters in these states.,. . I look forward to being in these states even more as I continue to share my ideas about how to put America back on top!\"  Karen Giorno is a Political and External Affairs Specialist with 25 years experience in public relations, communications, organizational management, and presidential advance operations. She previously served as Director of External Affairs for Governor Rick Scott (R-FL).  Corbin Casteel has vast experience in Political Strategy and Corporate Communications Consulting including previous positions with the Republican National Committee and the Republican Party of Texas. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-new-hires-in-georgia-tennessee-and-virginia", "text": "Donald J. Trump Announces New Hires in Georgia, Tennessee and VirginiaThe Trump Campaign Continues to Bolster State Staff Nationwide While Maintaining Front Runner Status (New York, NY) September 22, 2015 - Donald J. Trump today announced the appointment of Seth Weathers as Georgia State Director and Darren Morris as Tennessee State Director. Mr. Weathers brings a decade of experience in politics at both the national and state levels and will be charged with the day to day operations in Georgia where Mr. Trump is currently leading the Republican Primary field with 30% in the most recent state poll. Mr. Morris, also a seasoned political operative, has worked on several Presidential races and will serve as the State Director of Tennessee for the Trump campaign.Mr. Trump stated, \"It is great to welcome Seth and Darren as we continue to build our team around the country and organize in early states. We have received great support in Georgia and Tennessee where my message to create jobs, secure our border, strengthen our military and take care of our vets resonates strongly with voters who are ready to Make America Great Again.\"Seth Weathers came to the political arena from a tech and business background and is the founder of Weathers Corp, which services both corporate and political clients. Seth is formerly Chairman of The Gwinnett Young Republicans, Georgia GOP State Committee, 7th District Committee for the Georgia GOP, Fulton County GOP Executive Committee, and Board of Directors Live Oak Republicans. He was previously nominated by U.S. Senator Saxby Chambliss to the US Senate Leadership Summit for Young Professional in DC, and is an Atlanta Power 30 Under 30 Award Winner.Darren Morris is president of Morris Global Strategies, a public affairs and political consulting firm based in Nashville, Tennessee. For over two decades, Morris has served a wide array of political campaigns, corporations and associations across the United States and the European Union. He began his career in presidential campaigns in 1996, when he served in the press operation for Lamar Alexander and has worked in each presidential campaign cycle since then, as well as in various communications positions for each Republican National Convention. Additionally, Dena Espenscheid will serve as Field Director for the Trump Campaign in Virginia. Dena brings more than two decades of experience in grassroots organizing, campaign management, public policy, and grassroots lobbying. Most recently, Dena taught grassroots advocacy in Florida to Tea Party and 9-12 groups for American Majority, and build a network of conservative women's clubs in Virginia. Mr. Trump maintains his definitive front- runner status by a wide margin in all of the most recent polls including NBC News, Zogby, CNN, and Morning Consult. He will be in South Carolina on Wednesday and will visit Oklahoma on Friday. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/national-trump-holds-lead-carson-2nd", "text": "Download PDFDonald Trump has increased his GOP vote share since last month’s debate. The latest Monmouth University Poll of Republican voters nationwide also finds Ben Carson moving into second place, Jeb Bush slipping to third, and Scott Walker fading into the background. ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/make-america-great-again-rally-in-mobile-alabama", "text": "\nFriday is going to break records and we want to make sure you're there. Join tens of thousands of supporters for a Make America Great Again Rally in Mobile, Alabama. Get your ticket here.Ladd-Peebles Stadium1621 Virginia StreetMobile, AL 36604", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-new-hampshire-town-hall", "text": "This Wednesday Donald J. Trump will be hosting a Town Hall Meeting at the Pinkerton Academy (5 Pinkerton St., Derry, NH). We expect a big crowd, so make sure you RSVP.Doors open at 6:00PM, and the Town Hall will begin at 6:30PM. There will be an opportunity for Q&A following Mr. Trump's remarks.We had a great event in Hampton last weekend, with nearly 3000 people coming out to hear Mr. Trump speak! Thank you to everyone who volunteered or attended.See you Wednesday!Team Trump", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-leads-in-south-carolina", "text": "Download PDFDonald J. Trump leads by a wide margin in South Carolina among every age group and gender according to a new poll by Gravis Marketing.", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-in-first-place-in-florida", "text": "\nI wanted to make sure you had seen the latest poll for Florida. This poll shows us with 26% support – proving our commanding lead in the Sunshine State. We are proud to have the support of hardworking Florida residents and hope that you continue sharing our message to Make America Great Again with your family, friends, and neighbors.\n\nGo Team Trump! \n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-in-first-place-in-new-hampshire", "text": "\nI wanted to make sure you had seen \nthe latest polls for New Hampshire. This poll shows us with 24% support – proving we have a commanding lead in the Granite State. We are proud to have the support of hardworking New Hampshire residents and hope that you continue sharing our message with your family, friends, and neighbors.\n\nThis Saturday, Team Trump in New Hampshire will be marching in the Freedom Old Home Week Parade. Meet at 9am at Freedom Elementary School. 40 Loon Lake Rd. Freedom, NH.\n\nCall our New Hampshire office at 603-836-5098 for more details.\n\nGo Team Trump!\n", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/the-silent-majority-has-awakened", "text": "\nHave you seen\ntoday’s poll? What about this Fox poll? We are in first place! All the polls confirm it! We continue to prove we are ready to take our country back and, more than any other candidate; we have the support of the people. \nYesterday I traveled to Laredo, Texas to visit the border and meet with local law enforcement officials. We discussed the need for stronger border security and the importance of continuing the national discussion on this issue. Strengthening our border will most benefit legal immigrants and working class Americans. Continuing to allow illegal immigrants to cross a weak border is hurting America’s economy.\n\n\nMany politicians in Washington talk about the border but have no idea how dangerous it really is. I went to the border to make sure the American people have the opportunity to see the truth.\n\nMeeting with Laredo Mayor Pete Saenz, City Manager Jesus Olivares, and the Laredo Police Department\nEarlier this week I hosted my South Carolina campaign kickoff. Hundreds of veterans came to watch my speech. I announced the launch of a new hotline, 855 – VETS – 352, and email address, veterans@donaldtrump.com, for Veterans to share their stories about the need to reform our Veterans Administration. The way veterans are being treated in our country is a disgrace and I am the candidate that will fix it.\n\nMeeting with veterans in South Carolina\nI made a campaign stop in Nevada to speak at Freedom Fest. In front of 2,000 energized conservatives I made a pledge that I will remake today; as President I will restore the American free market and ensure that companies are incentivized to bring factories and jobs back to American soil.\n\nSpeaking at Freedom Fest\nI also traveled to Phoenix to host a rally.\n15,000 people showed up. It was an incredible testament to the deep commitment of the American people to restoring American greatness. We have stayed silent for far too longwatching bad policies wreak havoc on our economy and our nation. I will take care of our veterans, rebuild our military, and secure our borders.\n\nOur incredible crowd in Phoenix, AZ\nMost politicians would have backed down after being relentlessly targeted by the media.\nI will never stop speaking out on behalf of all Americans.\nWe have been bringing our message across America over the past several weeks. In California I met with\nthe families of six victims who were killed by illegal aliens. Each family shared their story. It was a heartbreaking reminder of why we must secure our border – to make sure no more Americans are senselessly killed by illegal aliens.\nOur unprotected border is a threat to the stability of our economy, the personal safety of Americans, and our national security. Too many American lives have been lost because our leaders refuse to secure the border.\n\nStanding with the families of victims\nI also filed my\nFEC financial disclosure form. I have spent my life building businesses in large American cities and small American towns. I will use my experience to put Americans back to work – and the polls prove that the people know I am the only one who can do it.\n\nSome of our enthusiastic supporters\nThis campaign is about changing Washington. We need to once again have a government that is of the people, for the people and by the people.\nWe will make America Great Again!", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-the-formation-of-veterans-for-trump-coalition-in", "text": "Donald J. Trump Announces the Formation of “Veterans for Trump” Coalition in New Hampshire(New York, NY) July 23, 2015 – Today, Donald J. Trump, announced the formation of the “Veterans for Trump” Coalition in New Hampshire. These veterans have pledged their support to Mr. Trump in the primary, and they will be advocating for him among other veterans and military families in New Hampshire, where there continues to be overwhelming support for Mr. Trump. Mr. Trump stated, “Our Veterans are incredibly important and I’m proud to have the support of this coalition, especially in New Hampshire, where if I am elected I will build a full-service, first-class VA hospital to ensure all New Hampshire Veterans received the care they deserve. I love all Veterans and will help them finally lead the kind of lives that they should be leading.” The Trump for President Veteran’s Coalition’s co-chairs are: Rep. Werner Horn of Franklin, Rep. Dan Tamburello of Londonderry, Rep. Joe Pitre of Farmington and Jerry Delemus of Rochester. Dan Tamburello of the Marine Corps said, \"I believe that Donald Trump has the leadership, the will, the courage, and the unabashed love-of country Americans so desperately crave in the White House. We have some very serious issues facing this country that are going to take a steely-eyed, proven, tough leader to overcome. Furthermore, should Mr. Trump find his way into the White House, he won't owe anything to anyone except the American people. Mr. Trump is a Patriot who loves his country, the American people, and cares about America being respected and great again. I believe he has what it takes to restore the faith of America's allies and be respected by our enemies once more.\"In addition to forming the New Hampshire Veterans Coalition, earlier this week Mr. Trump established a hotline (855- VETS- 352) and email address (veterans@donaldtrump.com) for Veterans to share their stories about the need to reform our Veterans Administration. If he is elected President he will take care of these and all Veteran complaints very quickly and efficiently.  Veterans for Trump:Rep. Werner Horn, Franklin, Vets Coalition Co-chairRep. Dan Tamburello, Londonderry, Vets Coalition Co-chairRep. Joe Pitre, Farmington, Vets Coalition Co-chairJerry Delemus, Rochester, Vets Coalition Co-chairTony Mayfield, Hillsborough James Johnson, Nashua Robert Kollman, Nashua Hank Vanderbeek, Bedford Michael, Fairley Stratham Edward Anzalond, Nashua David Staplefond, Nashua Dennis Romeo , Hooksett John Mercauto, Conway Alfred Constant, Gilmonton Iron Works Lionel Leblanc, Manchester Marilyn Manfra-Walsh, Bethlehem Frank Candelieri, Merrimack Karl Zahn, Milford Lou Gargiulo, Hampton Falls Dennis Wolfe, Sandown Robert Vallieres, Concord Bob Banks, Hollis Patrick O'Connor, Manchester Jim Densmore , Claremont Ralph Drews, Amherst Robert Krahulec, Weirs Beach Daniel Paul, Nashua Brandon Brown, Pelham Robert Sturtevant, Auburn Edward Cunningham, Candia Joe Capuzzo, Thornton Ray Dewis, West Woodstock Chuck Lindlau, Gilford Bob Hamel, Laconia David Patelle, Warren Roger Rist, Meredith Elaine Sweeny, Manchester Steven Sweeny, Manchester Donald Richards, Laconia Connie Richards, Laconia Ronald Tyo, Somersworth Mike Zayac, Farmington Bruce Berry, Berlin Rodney Cramer, Belmont Earl Gray, Plainfield Bob Peligrino, Derry Douglas Campbell, Manchester Bill McNally, Windham P.G McAdams, Manchester Ernie Fusi, Atkinson Rep Fred Doucette, Salem   ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-in-first-place-in-one-america-news-poll-in-nevada", "text": "Donald J. Trump In First Place in One America News Poll in NevadaNevada Poll Shows Mr. Trump is Definitive Leader with Hispanic Support(New York, NY) July 16, 2015- Donald J. Trump maintains his national momentum as the top choice in the crowded Republican field. The latest poll from the fourth in the nation state reveals Mr. Trump as the uncontested leader with 27.7% of voters selecting him as their first choice. Additionally, Mr. Trump has a commanding 31.4% of Hispanic support.Mr. Trump stated, \"I love the state of Nevada, have big interests there and employ lots of great people. I am particularly happy with so easily winning tremendous Hispanic support. As I have said, if I win the primary I will win the Hispanic vote--- I will produce jobs and Make America Great Again!\"Mr. Trump has also been the GOP leader in several recent national polls including Reuters and USA Today/ Suffolk University. Tonight, Mr. Trump is in Laconia, New Hampshire at a campaign rally. Tomorrow he will travel to Arkansas, followed by Iowa on Saturday.Press Contact:hhicks@donaldtrump.com203-273-0226 ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-for-president-inc.-releases-q2-fec-statistics", "text": "Download PDFDonald J. Trump for President, Inc. Releases Q2 FEC StatisticsTrump Campaign Files First Financial Report with FEC(New York, NY) July 15, 2015 – The Donald J. Trump for President, Inc. campaign officially filed its first report with the FEC revealing Q2 donations and spending. The FEC Statistics capture financial data from the campaign between April 2, 2015 and June 30, 2015. In total, the campaign had spent approximately $1.5 million dollars as of June 30th. Mr. Trump is self-funding his campaign; however there were 1,052 donations during this time period amounting to a total of $92,249.33 in unsolicited donations. 94% of the donors donated under $250.00. The average donation to the Trump campaign for those that donated less than $250 was $40.14. 98% of the donations received were received on-line to the DonaldJTrump.com website. Mr. Trump loaned the committee $1.8 million and the campaign has a cash on hand balance of $487,736. Mr. Trump’s Campaign Manager Corey R. Lewandowski stated, “Mr. Trump has surged in the most recent national polls, which show him leading the crowded GOP field, including the recently released USA Today/ Suffolk University poll, one of several showing Mr. Trump as a definitive top tier choice for the 2016 Republican Presidential primary.”Mr. Trump will be in Laconia, New Hampshire on Thursday for a rally; he will then travel to Arkansas on Friday to meet with voters at the Republican Party of Arkansas’s 2015 Reagan Rockefeller Dinner and will visit Iowa on Saturday where he will attend the Family Leadership Summit in Ames. Press Contact: hhicks@donaldtrump.com203-273-0226 ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-files-personal-financial-disclosure-statement-with-federal", "text": "Download PDFDonald J. Trump Files Personal Financial Disclosure Statement With Federal Election Commission For Immediate Release:  (New York, NY) July 15, 2015 - Today, Donald J. Trump filed his Personal Financial Disclosure (PFD) forms with the Federal Election Commission (FEC).  This report was not designed for a man of Mr. Trump's massive wealth. For instance, they have boxes once a certain number is reached that simply state $50 million or more. Many of these boxes have been checked. As an example, if a building owned by Mr. Trump is worth $1.5 billion, the box checked is “$50,000,000 or more.” Mr. Trump stated, “First people said I would never run, and I did. Then, they said, I would never file my statement of candidacy with the FEC, and I did. Next, they said I would never file my personal financial disclosure forms. I filed them early despite the fact that I am allowed two 45 days extensions. Now I have surged in the polls and am fighting to Make America Great Again. I look forward to the challenge of winning the presidency and doing a fantastic job for our country. I will make the United States rich and strong and respected again, but also a country with a 'big heart' toward the care of our people.” Mr. Trump's net worth has increased since the more than one year old financial statement produced at his presidential announcement. Real estate values in New York City, San Francisco, Miami and many other places where he owns property have gone up considerably during this period of time. His debt is a very small percentage of value, and at very low interest rates. As of this date, Mr. Trump's net worth is in excess of TEN BILLION DOLLARS.  Mr. Trump's income for the year 2014, as reported in the PFD statement, is $362 million dollars (which does not include dividends, interest, capital gains, rents and royalties).  In addition, he was successful in choosing multiple stocks which were sold in January 2014. Even though stock market purchases are not something that Mr. Trump has focused on in the past, and while only a small part of his net worth, 40 of the 45 stocks purchased went up in a relatively short period of time, creating a gain of $27,021,471, not including those stocks still remaining in the portfolio which currently have an unrealized gain of over $22 million (schedule attached).  Mr. Trump showed almost 500 business entities of which 91% are owned 100% by him. Mr. Trump wrote Trump: The Art of the Deal, one of the bestselling business books of all time, and numerous other bestsellers over the years.  NBC/Universal renewed, at the upfronts this year, The Apprentice (for a 15th season), but Mr. Trump decided to turn them down in order to run for President of the United States. NBC was not happy. During the 14 seasons of The Apprentice, Mr. Trump was paid $213,606,575.  For further information please contact:  Corey R. Lewandowski: 646.736.1931  Hope Hicks: 212.715.6785", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-statement-on-iran-agreement", "text": "Download PDFDonald J. Trump Statement on Iran Agreement(New York, NY) July 14, 2015 – Today Donald J. Trump released the following statement in response to the Obama Administration’s agreement with Iran. The Obama Administration’s agreement with Iran is very dangerous. Iran developing a nuclear weapon, either through uranium or nuclear fuel, and defying the world is still a very real possibility. The inspections will not be followed, and Iran will no longer have any sanctions. Iran gets everything and loses nothing. Every promise the Obama Administration made in the beginning of negotiations, including the vow (made at the beginning of the negotiations) to get our great American prisoners returned to the U. S. has been broken. This is a bad deal that sets a dangerous precedent. This deal sets off a nuclear arms race in the Middle East, which is the most-unstable region in the world. It is a horrible and perhaps catastrophic event for Israel.Furthermore, we should have kept the billions of dollars we have agreed to pay them. Any great dealmaker would know this is a perfect example of “tapping along” and because they have been unchecked for so long throughout this extremely lengthy process, I guarantee they are much closer to producing a nuclear weapon than they were at the start of negotiations. The fact is, the US has incompetent leaders and even more incompetent negotiators. We must do better for America and the world. We have to Make America Great Again.##", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-response-to-hillary-clinton", "text": "Download PDFDonald J. Trump Response to Hillary Clinton(New York, NY) July 14, 2015 – Today Donald J. Trump released the following statement as a response to Hillary Clinton.Failing candidate Hillary Clinton, who is desperately trying to hold on to her lead in the democratic primary against Bernie Sanders, is knowingly putting out lies about my stance on illegal immigration. I said “Mexico is sending”--- I’m not knocking immigration or immigrants, but rather am very critical of the country of Mexico for sending us people that they don’t want. Likewise I am very critical of illegal immigration and the tremendous problems including crime, which it causes. She is desperate, she is sad, and she is obviously very nervous when she has to revert to issues that have already been settled given the absolute accuracy of my statement. She speaks about “my tone” and that’s the problem with our country’s leaders. They are more worried about tone than results! It’s not about being nice--- it’s about being competent. Hillary should spend more time producing her illegally hidden emails and less time trying to obfuscate a statement by me that is totally clear and obviously very much accepted by the public as true. I am honored, however, that she is attacking me, instead of Jeb Bush. Obviously she knows that JEB is no longer her real competition. The last person she wants to face is Donald Trump.##", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/usa-today-suffolk-poll-release", "text": "Download PDFTRUMP TAKES TOP SPOT IN USA TODAY/SUFFOLK UNIVERSITY POLLJuly 14, 2015 (New York, N.Y.) - The latest poll from highly respected USA Today/ Suffolk University shows Donald Trump with 17% at the top of a crowded GOP field. Mr. Trump has been pulling ahead of the competition in recent weeks with his truthful talk on a number of issues, which has been resonating with voters across the country. The USA Today/ Suffolk University poll is one of several recently released polls showing Mr. Trump as a definitive top tier choice for the 2016 Republican Presidential primary.Also released this week, the most recent poll from Reuters, which shows Mr. Trump tied for first place alongside establishment candidate Jeb Bush and the latest results from the Monmouth University poll which shows Mr. Trump in second place with 13%. Both polls contributed to the Huffington Post pollster average showing Mr. Trump as the clear lead amongst the 2016 GOP field. Mr. Trump will be in Laconia, New Hampshire on Thursday for a rally; he will then travel to Arkansas on Friday to meet with voters at the Republican Party of Arkansas’s 2015 Reagan Rockefeller Dinner and will visit Iowa on Saturday where he will attend the Family Leadership Summit in Ames. ##", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/arizona-event-july-11-2015-location-update", "text": "Download PDFDonald J. Trump Media Advisory – Saturday, July 11th, 2015 Who: Donald J. Trump What: Mr. Trump will give a speech on illegal immigration and numerous other topics. When: Saturday, July 11th, 2015 at 2:00pm. Press should arrive no later than 1:00pm. Where: Phoenix Convention Center, North Ballroom, 100 north 3rd street Phoenix, AZ 85004Press Contact: Please contact Hope Hicks with any questions relating to Mr. Trump’s availability. hhicks@donaldtrump.com", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-endorsed-by-new-hampshire-state-representative-stephen-step", "text": "Download PDF(New York, NY) June 26, 2015- Today, Donald J. Trump was endorsed by New Hampshire State Representative Stephen Stepanek. Mr. Stepanek joins Mr. Trump’s robust New Hampshire leadership team and will work with his campaign to continue to share Mr. Trump’s message, which is resonating throughout the Granite State.Mr. Trump said, “Stephen is a great addition to our New Hampshire leadership team and I am proud to have his endorsement for the Republican presidential primary nomination. He understands what is at stake with our economy and will be an asset as we continue to solidify our position at the top of the field, both in New Hampshire and nationally.” Mr. Stepanek is a former Amherst Selectman, who served seven years as a member of the Hillsborough County Executive Committee. He is also a six year member of the New Hampshire Supreme Court Professional Conduct Committee, former four term State Representative serving the Citizens of Amherst, Chairman of the Granite State Tax Payers Association, Deputy Majority Leader of New Hampshire House of Representatives and Chairman of the House of Representatives Ways and Means Committee. Mr. Stepanek added, “Mr. Trump is a proven leader with a record of success and has the mindset to get our economy thriving and our country back on track. I’m proud to endorse Mr. Trump’s candidacy for President of the United States and look forward to working with the campaign team to continue to reach New Hampshire voters.” In addition to the leadership team, with representatives from all ten counties in New Hampshire, Mr. Trump has four full-time staffers in New Hampshire and an office based in Manchester, which daughter Ivanka Trump officially opened Wednesday with a packed house of supporters on hand.Three polls released this week show Mr. Trump in second place including the New Hampshire specific CNN/WMUR released yesterday, the Suffolk University poll released on June 23 and the latest national poll conducted by Fox News on June 24. Mr. Trump continues to visit New Hampshire regularly where he has been met with an overwhelmingly positive response when speaking to record crowds. Mr. Trump is expected to return to New Hampshire on June 30th. Press Contact: Hope Hicks- 203-273-0226 hhicks@donaldtrump.com", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-files-statement-of-candidacy-with-fec", "text": "Download PDFToday Donald J. Trump officially filed his Statement of Candidacy for the office of President of the United States of America.(New York, NY) June 22, 2015—Today, Donald J. Trump filed his Statement of Candidacy for office of President of the United States with the Federal Election Commission. This filing took place well in advance of the July 1st deadline. Last week, Mr. Trump declared his candidacy at Trump Tower where he spoke about the challenges we are currently facing, his proven record of success, and his belief in the Free Market, a strong military and our country’s sacred obligation to take care of our veterans and their families.Mr. Trump says, “I am pleased to submit this filing to the Federal Election Commission, formalizing my campaign for President of the United States. I can rebuild the American Dream so that it is stronger, bigger and better than ever before. Together we will Make America Great Again!”Mr. Trump’s Campaign Manager, Corey Lewandowski added, “As we have always said, the Donald J. Trump for President Committee, Inc. will meet all FEC imposed deadlines in accordance with being a candidate for the office of the President of the United States and today we are excited to complete this very important step.” Tomorrow, Mr. Trump will headline the Maryland Republican Party’s sold out 25th Annual Red, White, and Blue Dinner in Baltimore with a record setting crowd. Mr. Trump has visited Iowa and New Hampshire numerous times over the past several months and will return to Iowa this Saturday, June 27th and New Hampshire on Tuesday, June 30th. Also next week, Mr. Trump will speak at the City Club of Chicago on Monday, June 29th, which will be the largest event in the Club has ever had. The event sold out within twelve minutes and has a wait-list of over two thousand people. The Donald J. Trump for President Campaign is headquartered in New York City. For more information please visit DonaldJTrump.com. Press Contact:Hope Hickshhicks@donaldtrump.com203-273-0226 ", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-exposes-club-for-growths-shakedown-attempt", "text": "Download PDFToday, Donald J. Trump is calling for the immediate resignation of Club for Growth President David McIntosh after a failed attempt to secure $1 million dollars from Mr. Trump.\nIn calling for Mr. McIntosh’s immediate resignation, Mr. Trump says, “I am appalled by Mr. McIntosh’s shameless pandering and blatant shakedown attempt, exposing him and the Club for Growth as a fraud.”Mr. McIntosh met with Mr. Trump and his representatives in New York City at Trump Tower on May 26th. During that meeting he praised Mr. Trump for his business success and talked about the need for someone like Mr. Trump to be in Washington, D.C. He then talked about the Club for Growth and what it is doing. The meeting lasted approximately 30 minutes.One week later, Mr. Trump and political advisor Corey Lewandowski (now campaign manager) received letters (attached)  from Mr. McIntosh requesting $1 million dollars of financial support for the Club for Growth. The letter to Mr. Trump states, “As we both know, it is business owners who create jobs- not the government.”Less than fourteen days after sending his request for the $1 million, and after Mr. Trump did not give money to the Club for Growth and instead declared his candidacy, Mr. McIntosh attacked Mr. Trump, was critical of his candidacy, and said, “It would be unfortunate if (Mr. Trump) takes away a spot at even one Republican debate.”Lewandowski stated, “The Club for Growth is the worst of the two-faced hypocrisy of Washington.”This exemplifies everything that is wrong with politics in our country. Club for Growth claims to fight for conservative causes and support Republican candidates who oppose politics as usual, and apparently will say anything in an effort to raise funds. This unfortunate incident is representative of the corruption that persists in Washington, D.C., and politics in general, in the United States.Press Contact: \nHope Hicks \n203-273-0226 \nhhicks@donaldtrump.com", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-postpones-south-carolina-event", "text": "Download PDF(Bluffton, SC) June 18, 2015- Republican presidential candidate Donald J. Trump today announced that he is postponing his scheduled visit to the Lowcountry of South Carolina due to the “shockingly sad” events that occurred in Charleston.“The tragic events that occurred on Wednesday evening should be our nation’s primary focus for the foreseeable future,” stated Mr. Trump. “This is a time for healing, not politics.” Mr. Trump, who announced his candidacy for President on Tuesday in New York, is in the midst of a multi-state tour that includes stops in Iowa, New Hampshire, and South Carolina. He was scheduled to appear before a capacity crowd in the residential community of Sun City in Bluffton, South Carolina.“I look forward to returning to South Carolina and continuing our discussion on how we can best move our country forward,” said Trump. “Until that time our prayers and deepest condolences are with the people of Charleston and the families of those who have been torn apart by this senseless act of violence and hate.”The Trump campaign announced that the South Carolina event will be rescheduled in the near future.###Press contact:Hope HicksHhicks@donaldtrump.com203-273-0226", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-declares-candidacy-for-president-of-the-united-states", "text": "Download PDF(New York, NY) June 16, 2015—Today, Donald J. Trump announced his candidacy for President of the United States of America. Mr. Trump was joined by his immediate family and stood before thousands of supporters to declare his candidacy for the 2016 GOP Presidential nomination. Donald J. Trump said, “Quite simply, it is time to bring real leadership to Washington. The fact is, the American Dream is dead -- but if I win, I will bring it back bigger and better and stronger than ever before. Together we will Make America Great Again!” Mr. Trump has frequently used his platform as a notable public figure to advocate for conservative causes and to educate the public on the failures of the Obama administration. Mr. Trump believes in the Free Market, a strong military and our country’s sacred obligation to take care of our veterans and their families. Mr. Trump has teams based in the early primary states of Iowa, New Hampshire and South Carolina. He will be visiting each of these states beginning with Iowa today, followed by New Hampshire on June 17th, and South Carolina on June 19th.The Donald J. Trump for President Campaign will be headquartered in New York City. For more information please visit DonaldJTrump.com.Press Contact: Hope Hicks 203-273-0226 hhicks@donaldtrump.com", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-near-top-in-latest-new-hampshire-poll", "text": "Download PDFDonald Trump Has Momentum on His Side as June 16th Announcement Approaches(New York, NY) June 9th, 2015 -- Donald Trump is at the top of the latest poll released yesterday, revealing 12% of approximately 500 Republican Primary voters consider Mr. Trump their top choice. The results show Donald Trump to be among voter favorites, trailing establishment darling Governor Scott Walker by just one point. Mr. Trump certainly has momentum on his side as he continues to gain support from Republican voters in early primary states like Iowa, South Carolina and New Hampshire as voters emphasize the increasingly strong desire for a Republican candidate that is a proven business leader and not a traditional politician. Donald Trump said, “I have great respect for the people of New Hampshire --- people who work hard and love this country. We are always greeted by massive crowds and immense support, which is reflected in these results. If I run, and if I win, the people of New Hampshire will be very proud--- we will Make America Great Again!” The positive results of the Gravis poll further emphasize Trump’s grass roots support in the Granite State, where he has a team of advisors, an office located in Manchester and a solid base excited about the potential of a Trump candidacy given his world renowned business acumen and truthful talk on the current state of the country. Corey Lewandowski, Senior Political Adviser to Mr. Trump said, “Mr. Trump’s message has always resonated strongly with the people of New Hampshire. He is a frequent visitor and looks forward to returning to the Granite State soon as he continues to share his vision to Make America Great Again.” Mr. Trump will be announcing his decision regarding his potential Presidential candidacy on June 16th at Trump Tower in New York City. Press Contact:Hope Hicks203-273-0226hhicks@donaldtrump.com", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/trump-addresses-record-crowd-of-700-at-nc-gop-state-convention-dinner", "text": "Download PDF\n(Raleigh, North Carolina) June 6th, 2015 -- Donald Trump addressed the record crowd of 700 attendees at the North Carolina GOP State Convention tonight where he was the featured keynote speaker of the two-day program held downtown at the Raleigh Convention Center. Mr. Trump had the crowd going wild with his truthful talk on immigration, free trade, Iranian nuclear negotiations, homeland security, economic policy and job creation.\nThe room was so packed with supporters the event organizers were forced to scramble at the last minute to reconfigure the tables in the room, still in place from the prior event. The capacity crowd of 700 GOP voters was excited to hear Mr. Trump’s vision to Make America Great Again and was enthusiastic about his upcoming announcement on June 16th.\nMr. Trump addressed the current administration and potential 2016 GOP candidate field saying, “Are these the people you want negotiating for you? Our country is in big trouble. We are not utilizing our best. It’s time we fix Washington with outsiders who actually know what they’re doing. It’s time we Make America Great Again!”\nMr. Trump spoke extensively about the issues we are currently facing and offered common sense solutions to the problems Washington continues to encounter. His unparalleled experience as one of the most successful businessmen in the world and a Washington outsider was clearly a popular differentiator among the crowd of North Carolina Republicans.\nThe crowd bid-farewell to Mr. Trump with a standing ovation after he exclaimed, “The American Dream is dead, but if I run, and if I win, we will bring it back stronger, bigger, and better than ever before!”\nMr. Trump will be announcing his decision regarding his potential Presidential candidacy on June 16th at Trump Tower in New York City.\nPress Contact:\nHope Hicks\n203-273-0226\nhhicks@donaldtrump.com", "author": "Trump"}
{"url": "https://www.donaldjtrump.com/press-releases/donald-j.-trump-announces-county-chairs-in-new-hampsire", "text": "Download PDF(New York, NY) May 21, 2015 – Donald J. Trump today announced the members of his New Hampshire Leadership team, with representatives from all ten New Hampshire counties. In addition to the robust leadership team unveiled today, Mr. Trump has four full-time staffers in the Granite State and an office based in Manchester. Donald J. Trump said, “I’m proud to announce these individuals that share my passion for the country and understand that now is the time for executive leadership and real action. Together we can Make America Great Again!” Mr. Trump continues to visit New Hampshire regularly where he has been met with an overwhelmingly positive response when speaking to record crowds. Mr. Trump is expected to return to New Hampshire several times over the summer to meet with and listen to residents from around the state as well as his newly established leadership team. Rockingham County Co- Chair, Lou Gargiulo, added, \"I am honored to be supporting Donald Trump as he continues to seriously and actively explore a potential Presidential candidacy. His in-depth business experience in this race is truly a staggering and exciting event. His reputation for business is known around the world, and has a proven record for knowing how to create tens of thousands of jobs. I look forward to hearing his perspectives on business, world events, and other important topics in the coming months.\"Background on Donald J. Trump’s New Hampshire Leadership Team:Belknap CountyChair- Josh Youssef Vice-Chair- Ben Wilson Carroll County Chair- Nate Sullivan Vice-Chair- Zac Mercauto Cheshire County Chair- Gregory Johnson Coos County Co-Chair- Jack Riendeau Co-Chair-Sandra Riendeau Grafton CountyChair- Raul Cervantes Hillsborough County Chair- Ellen Suprunowicz-StepanekVice-Chair- Tony Mayfield Merrimack County Co-Chair- Rick Cibotti Co-Chair- Debbie Cibotti Rockingham County Co-Chair- Lou Gargiulo Co-Chair- Mary A. Gargiulo Strafford County Chair- Karen L. Warburton Sullivan County Co-Chair- Cynthia Howard Co-Chair- Phil Howard Contact: Hope HicksDonald J. Trump Exploratory Committee hhicks@donaldtrump.com 203-203-0226 ", "author": "Trump"}
